stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/**
  ******************************************************************************
  * @file    stm32wb06.h
  * @author  MCD Application Team
  * @brief   CMSIS Cortex Device Peripheral Access Layer Header File.
  *          This file contains all the peripheral register's definitions, bits
  *          definitions and memory mapping for stm32wb06 devices.
  *
  *          This file contains:
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral's registers declarations and bits definition
  *           - Macros to access peripheral's registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/** @addtogroup CMSIS_Device
  * @{
  */

/** @addtogroup stm32wb06
  * @{
  */

#ifndef __STM32WB06_H
#define __STM32WB06_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/** @addtogroup Peripheral_interrupt_number_definition
  * @{
  */

/**
  * @brief stm32wb06 Interrupt Number Definition, according to the selected device
  *        in @ref Library_configuration_section
  */

typedef enum
{
  /* =======================================  ARM Cortex-M0+ Specific Interrupt Numbers  ======================================= */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
  /* =========================================  stm32wb06 Specific Interrupt Numbers  ========================================= */
  FLASH_IRQn                =   0,              /*!< 0  NVM interrupt                                                          */
  RCC_IRQn                  =   1,              /*!< 1  RCC interrupt                                                          */
  PVD_IRQn                  =   2,              /*!< 2  PVD interrupt                                                          */
  I2C1_IRQn                 =   3,              /*!< 3  I2C1 interrurpt                                                        */
  I2C2_IRQn                 =   4,              /*!< 4  I2C2 interrupt                                                         */
  SPI1_IRQn                 =   5,              /*!< 5  SPI1 interrupt                                                         */
  SPI2_IRQn                 =   6,              /*!< 6  SPI2 interrupt                                                         */
  SPI3_IRQn                 =   7,              /*!< 7  SPI3 interrupt                                                         */
  USART1_IRQn               =   8,              /*!< 8  USART interrupt                                                        */
  LPUART1_IRQn              =   9,              /*!< 9  Low Power UART interrupt                                               */
  TIM1_IRQn                 =  10,              /*!< 10 Timer 1 interrupt                                                      */
  RTC_IRQn                  =  11,              /*!< 11 RTC interrupt                                                          */
  ADC_IRQn                  =  12,              /*!< 12 ADC interrupt                                                          */
  PKA_IRQn                  =  13,              /*!< 13 PKA interrupt                                                          */
  UPCONV_IRQn               =  14,              /*!< 14 AHB_UP_CONVERTER interrupt                                             */
  GPIOA_IRQn                =  15,              /*!< 15 GPIOA interrupt                                                        */
  GPIOB_IRQn                =  16,              /*!< 16 GPIOB interrupt                                                        */
  DMA_IRQn                  =  17,              /*!< 17 DMA interrupt                                                          */
  RADIO_TXRX_IRQn           =  18,              /*!< 18 RADIO Tx/Rx interrupt                                                  */
  RADIO_TIMER_ERROR_IRQn    =  20,              /*!< 20  RADIO TIMER Error interrupt                                           */
  RADIO_RRM_IRQn            =  22,              /*!< 22  RADIO Resource Manager interrupt                                      */
  RADIO_TIMER_CPU_WKUP_IRQn =  23,              /*!< 23  RADIO TIMER CPU Wakeup interrupt                                      */
  RADIO_TIMER_TXRX_WKUP_IRQn =  24,             /*!< 24  RADIO TIMER Tx/Rx Wakeup interrupt                                    */
  RADIO_TXRX_SEQ_IRQn       =  25               /*!< 25 RADIO Tx/Rx sequence interrupt                                         */
} IRQn_Type;


/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

