stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
typedef struct                                  /*!< RTC Structure                                                             */
{
  __IO uint32_t  TR;                           /*!< (@ 0x00000000) Time register                                              */
  __IO uint32_t  DR;                           /*!< (@ 0x00000004) Date register                                              */
  __IO uint32_t  CR;                           /*!< (@ 0x00000008) Control register                                           */
  __IO uint32_t  ISR;                          /*!< (@ 0x0000000C) Initialization and status register                         */
  __IO uint32_t  PRER;                         /*!< (@ 0x00000010) Prescaler register                                         */
  __IO uint32_t  WUTR;                         /*!< (@ 0x00000014) Wakeup timer register                                      */
  __IO uint32_t  RESERVED;
  __IO uint32_t  ALRMAR;                       /*!< (@ 0x0000001C) Alarm A register                                           */
  __IO uint32_t  RESERVED1;
  __IO uint32_t  WPR;                          /*!< (@ 0x00000024) Write protection register                                  */
  __IO uint32_t  SSR;                          /*!< (@ 0x00000028) Sub second register                                        */
  __IO uint32_t  SHIFTR;                       /*!< (@ 0x0000002C) Shift control register                                     */
  __IO uint32_t  RESERVED2[3];
  __IO uint32_t  CALR;                         /*!< (@ 0x0000003C) Calibration register                                       */
  __IO uint32_t  RESERVED3;
  __IO uint32_t  ALRMASSR;                     /*!< (@ 0x00000044) Alarm A sub second register                                */
  __IO uint32_t  RESERVED4[2];
  __IO uint32_t  BKP0R;                        /*!< (@ 0x00000050) Backup register 0                                          */
  __IO uint32_t  BKP1R;                        /*!< (@ 0x00000054) Backup register 1                                          */
} RTC_TypeDef;                                  /*!< Size = 88 (0x58)                                                          */


/* =========================================================================================================================== */
/* ================                                            PKA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief PKA (PKA)
  */

typedef struct                                  /*!< PKA Structure                                                             */
{
  __IO uint32_t  CSR;                          /*!< (@ 0x00000000) Command and status register                                */
  __IO uint32_t  ISR;                          /*!< (@ 0x00000004) Interrupt register                                         */
  __IO uint32_t  IEN;                          /*!< (@ 0x00000008) Interrupt enable register                                  */
  uint32_t Reserved[253];                      /*!< Reserved memory area              Address offset: 0x0C  -> 0x03FC         */
  __IO uint32_t RAM[256];                       /*!< PKA RAM                           Address offset: 0x400 -> 0x07FF         */
} PKA_TypeDef;                                  /*!< Size = 12 (0x0C)                                                          */

/* =====================================================   Bits definition for PKA RAM   ===================================================== */
#define PKA_RAM_OFFSET                            0x400U                           /*!< PKA RAM address offset */

/* Compute ECC scalar multiplication input data */
#define PKA_ECC_SCALAR_MUL_IN_K                    ((0x046CU - PKA_RAM_OFFSET)>>2)   /*!< Input 'k' of KP */
#define PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_X      ((0x0490U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P X coordinate */
#define PKA_ECC_SCALAR_MUL_IN_INITIAL_POINT_Y      ((0x04B4U - PKA_RAM_OFFSET)>>2)   /*!< Input initial point P Y coordinate */

/* Compute ECC scalar multiplication output data */
#define PKA_ECC_SCALAR_MUL_OUT_RESULT_X            ((0x0490U - PKA_RAM_OFFSET)>>2)   /*!< Output result X coordinate */
#define PKA_ECC_SCALAR_MUL_OUT_RESULT_Y            ((0x04B4U - PKA_RAM_OFFSET)>>2)   /*!< Output result Y coordinate */
#define PKA_ECC_SCALAR_MUL_OUT_ERROR               ((0x0400U - PKA_RAM_OFFSET)>>2)   /*!< Output ERROR */


/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief ADC (ADC)
  */

typedef struct                                  /*!< ADC Structure                                                             */
{
  __IO uint32_t  VERSION_ID;                   /*!< (@ 0x00000000) VERSION_ID register                                        */
  __IO uint32_t  CONF;                         /*!< (@ 0x00000004) ADC configuration register                                 */
  __IO uint32_t  CTRL;                         /*!< (@ 0x00000008) ADC control register                                       */
  __IO uint32_t  OCM_CTRL;                     /*!< (@ 0x0000000C) Occasionnal mode control register                          */
  __IO uint32_t  PGA_CONF;                     /*!< (@ 0x00000010) PGA configuration register                                 */
  __IO uint32_t  SWITCH;                       /*!< (@ 0x00000014) ADC switch control for Input Selection                     */
  __IO uint32_t  DF_CONF;                      /*!< (@ 0x00000018) Decimation filter configuration register                   */
  __IO uint32_t  DS_CONF;                      /*!< (@ 0x0000001C) Downsampler configuration register                         */
  __IO uint32_t  SEQ_1;                        /*!< (@ 0x00000020) ADC regular sequence configuration register 1              */
  __IO uint32_t  SEQ_2;                        /*!< (@ 0x00000024) ADC regular sequence configuration register 2              */
  __IO uint32_t  COMP_1;                       /*!< (@ 0x00000028) ADC Gain & offset correction values register 1             */
  __IO uint32_t  COMP_2;                       /*!< (@ 0x0000002C) ADC Gain & offset correction values register 2             */
  __IO uint32_t  COMP_3;                       /*!< (@ 0x00000030) ADC Gain & offset correction values register 3             */
  __IO uint32_t  COMP_4;                       /*!< (@ 0x00000034) ADC Gain & offset correction values register 4             */
  __IO uint32_t  COMP_SEL;                     /*!< (@ 0x00000038) ADC Gain & Offset selection values register                */
  __IO uint32_t  WD_TH;                        /*!< (@ 0x0000003C) High/low limits for event monitoring a channel register    */
  __IO uint32_t  WD_CONF;                      /*!< (@ 0x00000040) Channel selection for event monitoring register            */
  __IO uint32_t  DS_DATAOUT;                   /*!< (@ 0x00000044) Downsampler Data output register                           */
  __IO uint32_t  DF_DATAOUT;                   /*!< (@ 0x00000048) Decimation filter Data output register                     */
  __IO uint32_t  IRQ_STATUS;                   /*!< (@ 0x0000004C) Interrupt Status register                                  */
  __IO uint32_t  IRQ_ENABLE;                   /*!< (@ 0x00000050) Enable/disable Interrupts                                  */
  __IO uint32_t  TIMER_CONF;                   /*!< (@ 0x00000054) Time to add after an LDO Enable or ADC Enable
                                                                    to let the HW to be stable before using it                 */
} ADC_TypeDef;                                  /*!< Size = 88 (0x58)                                                          */


/* =========================================================================================================================== */
/* ================                                     AHBUPCONV                                             ================ */
/* =========================================================================================================================== */


/**
  * @brief AHBUPCONV (AHBUPCONV)
  */

