stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
typedef struct                                  /*!< AHBUPCONV structure                                                       */
{
  __IO uint32_t  COMMAND;                      /*!< (@ 0x00000000) Command register                                           */
  __IO uint32_t  STATUS;                       /*!< (@ 0x00000004) Status register                                            */
} AHBUPCONV_TypeDef;                            /*!< Size = 8 (0x8)                                                            */


/* =========================================================================================================================== */
/* ================                                     BLUE                                                  ================ */
/* =========================================================================================================================== */


/**
  * @brief BLUE Radio (BLUE)
  */

typedef struct                                  /*!< BLUE structure                                                            */
{
  __IO uint32_t  CONTROLLERVERNUMREG;          /*!< (@ 0x00000000) Controller Version Number register                         */
  __IO uint32_t  INTERRUPT1REG;                /*!< (@ 0x00000004) Interrupt1 register                                        */
  __IO uint32_t  INTERRUPT2REG;                /*!< (@ 0x00000008) Interrupt2 register                                        */
  __IO uint32_t  TIMEOUTDESTREG;               /*!< (@ 0x0000000C) TimeoutDest register                                       */
  __IO uint32_t  TIMEOUTREG;                   /*!< (@ 0x00000010) Timeout register                                           */
  __IO uint32_t  TIMERCAPTUREREG;              /*!< (@ 0x00000014) TimerCapture register                                      */
  __IO uint32_t  CMDREG;                       /*!< (@ 0x00000018) Cmd register                                               */
  __IO uint32_t  STATUSREG;                    /*!< (@ 0x0000001C) Status register                                            */
  __IO uint32_t  INTERRUPT1ENABLEREG;          /*!< (@ 0x00000020) Interrupt1Enable register                                  */
  __IO uint32_t  INTERRUPT1LATENCYREG;         /*!< (@ 0x00000024) Interrupt1Latency register                                 */
  __IO uint32_t  MANAESKEY0REG;                /*!< (@ 0x00000028) ManAesKey0 register                                        */
  __IO uint32_t  MANAESKEY1REG;                /*!< (@ 0x0000002C) ManAesKey1 register                                        */
  __IO uint32_t  MANAESKEY2REG;                /*!< (@ 0x00000030) ManAesKey2 register                                        */
  __IO uint32_t  MANAESKEY3REG;                /*!< (@ 0x00000034) ManAesKey3 register                                        */
  __IO uint32_t  MANAESCLEARTEXT0REG;          /*!< (@ 0x00000038) ManAesClearText0 register                                  */
  __IO uint32_t  MANAESCLEARTEXT1REG;          /*!< (@ 0x0000003C) ManAesClearText1 register                                  */
  __IO uint32_t  MANAESCLEARTEXT2REG;          /*!< (@ 0x00000040) ManAesClearText2 register                                  */
  __IO uint32_t  MANAESCLEARTEXT3REG;          /*!< (@ 0x00000044) ManAesClearText3 register                                  */
  __IO uint32_t  MANAESCIPHERTEXT0REG;         /*!< (@ 0x00000048) ManAESCipherText0 register                                 */
  __IO uint32_t  MANAESCIPHERTEXT1REG;         /*!< (@ 0x0000004C) ManAESCipherText1 register                                 */
  __IO uint32_t  MANAESCIPHERTEXT2REG;         /*!< (@ 0x00000050) ManAESCipherText2 register                                 */
  __IO uint32_t  MANAESCIPHERTEXT3REG;         /*!< (@ 0x00000054) ManAESCipherText3 register                                 */
  __IO uint32_t  MANAESCMDREG;                 /*!< (@ 0x00000058) ManAESCmd register                                         */
  __IO uint32_t  MANAESSTATREG;                /*!< (@ 0x0000005C) ManAESStat register                                        */
  __IO uint32_t  AESLEPRIVPOINTERREG;          /*!< (@ 0x00000060) AesLePrivPointer register                                  */
  __IO uint32_t  AESLEPRIVHASHREG;             /*!< (@ 0x00000064) AesLePrivHash register                                     */
  __IO uint32_t  AESLEPRIVPRANDREG;            /*!< (@ 0x00000068) AesLePrivPrand register                                    */
  __IO uint32_t  AESLEPRIVCMDREG;              /*!< (@ 0x0000006C) AesLePrivCmd register                                      */
  __IO uint32_t  AESLEPRIVSTATREG;             /*!< (@ 0x00000070) AesLePrivStat register                                     */
  __IO uint32_t  DEBUGCMDREG;                  /*!< (@ 0x00000074) DebugCmd register                                          */
  __IO uint32_t  DEBUGSTATUSREG;               /*!< (@ 0x00000078) DebugStatus register                                       */
  __IO uint32_t  RESERVED;
} BLUE_TypeDef;                                 /*!< Size = 128 (0x80)                                                         */


/* =========================================================================================================================== */
/* ================                                     RADIO_CTRL                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Radio Controller (RADIO_CTRL)
  */

typedef struct                                  /*!< Radio Control structure                                                   */
{
  __IO uint32_t  RADIO_CONTROL_ID;            /*!< (@ 0x00000000) Radio Controller ID register                               */
  __IO uint32_t  CLK32COUNT_REG;              /*!< (@ 0x00000004) Window length register                                     */
  __IO uint32_t  CLK32PERIOD_REG;             /*!< (@ 0x00000008) Slow clock period register                                 */
  __IO uint32_t CLK32FREQUENCY_REG;          /*!< (@ 0x0000000C) Slow clock frequency register                              */
  __IO uint32_t  RADIO_CONTROL_IRQ_STATUS;    /*!< (@ 0x00000010) Radio Controller Interrupt Status register                 */
  __IO uint32_t  RADIO_CONTROL_IRQ_ENABLE;    /*!< (@ 0x00000014) Radio Controller Interrupt Control register                */
  __IO uint32_t  RESERVED;
} RADIO_CTRL_TypeDef;                           /*!< Size = 28 (0x1C)                                                          */


/* =========================================================================================================================== */
/* ================                                     RRM                                                   ================ */
/* =========================================================================================================================== */


/**
  * @brief RRM (RRM)
 */

