stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* Peripherals available on APB1 bus */
#define I2C1                        ((I2C_TypeDef*)                I2C1_BASE)
#define I2C2                        ((I2C_TypeDef*)                I2C2_BASE)
#define SPI1                        ((SPI_TypeDef*)                SPI1_BASE)
#define SPI2                        ((SPI_TypeDef*)                SPI2_BASE)
#define USART1                      ((USART_TypeDef*)            USART1_BASE)
#define LPUART1                     ((USART_TypeDef*)           LPUART1_BASE)
#define ADC1                        ((ADC_TypeDef*)                ADC1_BASE)
#define SPI3                        ((SPI_TypeDef*)                SPI3_BASE)

/* Peripherals available on AHB bus */
#define GPIOA                       ((GPIO_TypeDef*)                                  GPIOA_BASE)
#define GPIOB                       ((GPIO_TypeDef*)                                  GPIOB_BASE)
#define CRC                         ((CRC_TypeDef*)                                     CRC_BASE)
#define PKA                         ((PKA_TypeDef*)                                     PKA_BASE)
#define RCC                         ((RCC_TypeDef*)                                     RCC_BASE)
#define PWR                         ((PWR_TypeDef*)                                     PWR_BASE)
#define RNG                         ((RNG_TypeDef*)                                     RNG_BASE)
#define DMA1                        ((DMA_TypeDef*)                                    DMA1_BASE)
#define DMA1_Channel1               ((DMA_Channel_TypeDef *)                  DMA1_Channel1_BASE)
#define DMA1_Channel2               ((DMA_Channel_TypeDef *)                  DMA1_Channel2_BASE)
#define DMA1_Channel3               ((DMA_Channel_TypeDef *)                  DMA1_Channel3_BASE)
#define DMA1_Channel4               ((DMA_Channel_TypeDef *)                  DMA1_Channel4_BASE)
#define DMA1_Channel5               ((DMA_Channel_TypeDef *)                  DMA1_Channel5_BASE)
#define DMA1_Channel6               ((DMA_Channel_TypeDef *)                  DMA1_Channel6_BASE)
#define DMA1_Channel7               ((DMA_Channel_TypeDef *)                  DMA1_Channel7_BASE)
#define DMA1_Channel8               ((DMA_Channel_TypeDef *)                  DMA1_Channel8_BASE)
#define DMAMUX1                     ((DMAMUX_Channel_TypeDef *)                     DMAMUX1_BASE)
#define DMAMUX1_Channel0            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel0_BASE)
#define DMAMUX1_Channel1            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel1_BASE)
#define DMAMUX1_Channel2            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel2_BASE)
#define DMAMUX1_Channel3            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel3_BASE)
#define DMAMUX1_Channel4            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel4_BASE)
#define DMAMUX1_Channel5            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel5_BASE)
#define DMAMUX1_Channel6            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel6_BASE)
#define DMAMUX1_Channel7            ((DMAMUX_Channel_TypeDef *)            DMAMUX1_Channel7_BASE)

/* Peripherals available on APB2 bus */
#define BLUE                        ((BLUE_TypeDef*)                BLUE_BASE)
#define RADIO                       (BLUE)
#define RADIO_CTRL                  ((RADIO_CTRL_TypeDef*)    RADIO_CTRL_BASE)
#define RRM                         ((RRM_TypeDef*)                  RRM_BASE)
#define WAKEUP                      ((WAKEUP_TypeDef*)            WAKEUP_BASE)

/** @} */ /* End of group Device_Peripheral_declaration */

/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
#pragma pop
#elif defined (__ICCARM__)
/* leave anonymous unions enabled */
#elif (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic pop
#elif defined (__GNUC__)
/* anonymous unions are enabled by default */
#elif defined (__TMS470__)
/* anonymous unions are enabled by default */
#elif defined (__TASKING__)
#pragma warning restore
#elif defined (__CSMC__)
/* anonymous unions are enabled by default */
#endif


/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */


/** @addtogroup PosMask_peripherals
  * @{
  */

/* =========================================================================================================================== */
/*=====================                                    AHBUPCONV                                    ===================== */
/* =========================================================================================================================== */

/* =====================================================    COMMAND    ===================================================== */
#define AHBUPCONV_COMMAND_STALL_AUTO_CLEAR_Pos                             (5UL)    /*!<AHBUPCONV COMMAND: STALL_AUTO_CLEAR (Bit 5) */
#define AHBUPCONV_COMMAND_STALL_AUTO_CLEAR_Msk                             (0x20UL)   /*!< AHBUPCONV COMMAND: STALL_AUTO_CLEAR (Bitfield-Mask: 0x01) */
#define AHBUPCONV_COMMAND_STALL_AUTO_CLEAR                                 AHBUPCONV_COMMAND_STALL_AUTO_CLEAR_Msk
#define AHBUPCONV_COMMAND_STALL_IEN_Pos                                    (4UL)    /*!<AHBUPCONV COMMAND: STALL_IEN (Bit 4) */
#define AHBUPCONV_COMMAND_STALL_IEN_Msk                                    (0x10UL)   /*!< AHBUPCONV COMMAND: STALL_IEN (Bitfield-Mask: 0x01) */
#define AHBUPCONV_COMMAND_STALL_IEN                                        AHBUPCONV_COMMAND_STALL_IEN_Msk
#define AHBUPCONV_COMMAND_STALL_REQ_Pos                                    (3UL)    /*!<AHBUPCONV COMMAND: STALL_REQ (Bit 3) */
#define AHBUPCONV_COMMAND_STALL_REQ_Msk                                    (0x8UL)    /*!< AHBUPCONV COMMAND: STALL_REQ (Bitfield-Mask: 0x01) */
#define AHBUPCONV_COMMAND_STALL_REQ                                        AHBUPCONV_COMMAND_STALL_REQ_Msk
#define AHBUPCONV_COMMAND_ERROR_IEN_Pos                                    (2UL)    /*!<AHBUPCONV COMMAND: ERROR_IEN (Bit 2) */
#define AHBUPCONV_COMMAND_ERROR_IEN_Msk                                    (0x4UL)    /*!< AHBUPCONV COMMAND: ERROR_IEN (Bitfield-Mask: 0x01) */
#define AHBUPCONV_COMMAND_ERROR_IEN                                        AHBUPCONV_COMMAND_ERROR_IEN_Msk
#define AHBUPCONV_COMMAND_CLK_DIV_SEL_Pos                                  (0UL)    /*!<AHBUPCONV COMMAND: CLK_DIV_SEL (Bit 0) */
#define AHBUPCONV_COMMAND_CLK_DIV_SEL_Msk                                  (0x3UL)    /*!< AHBUPCONV COMMAND: CLK_DIV_SEL (Bitfield-Mask: 0x03) */
#define AHBUPCONV_COMMAND_CLK_DIV_SEL                                      AHBUPCONV_COMMAND_CLK_DIV_SEL_Msk
#define AHBUPCONV_COMMAND_CLK_DIV_SEL_0                                    (0x1U << AHBUPCONV_COMMAND_CLK_DIV_SEL_Pos)
#define AHBUPCONV_COMMAND_CLK_DIV_SEL_1                                    (0x2U << AHBUPCONV_COMMAND_CLK_DIV_SEL_Pos)

