stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* =====================================================    CMAR    ===================================================== */
#define DMA_CMAR_MA_Pos                                                    (0UL)    /*!<DMA CMAR: MA (Bit 0) */
#define DMA_CMAR_MA_Msk                                                    (0xffffffffUL)   /*!< DMA CMAR: MA (Bitfield-Mask: 0xffffffff) */
#define DMA_CMAR_MA                                                        DMA_CMAR_MA_Msk
#define DMA_CMAR_MA_0                                                      (0x1U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_1                                                      (0x2U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_2                                                      (0x4U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_3                                                      (0x8U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_4                                                      (0x10U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_5                                                      (0x20U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_6                                                      (0x40U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_7                                                      (0x80U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_8                                                      (0x100U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_9                                                      (0x200U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_10                                                     (0x400U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_11                                                     (0x800U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_12                                                     (0x1000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_13                                                     (0x2000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_14                                                     (0x4000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_15                                                     (0x8000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_16                                                     (0x10000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_17                                                     (0x20000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_18                                                     (0x40000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_19                                                     (0x80000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_20                                                     (0x100000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_21                                                     (0x200000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_22                                                     (0x400000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_23                                                     (0x800000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_24                                                     (0x1000000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_25                                                     (0x2000000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_26                                                     (0x4000000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_27                                                     (0x8000000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_28                                                     (0x10000000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_29                                                     (0x20000000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_30                                                     (0x40000000U << DMA_CMAR_MA_Pos)
#define DMA_CMAR_MA_31                                                     (0x80000000UL << DMA_CMAR_MA_Pos)


/* =========================================================================================================================== */
/*=====================                                      DMAMUX                                      ===================== */
/* =========================================================================================================================== */

/* =====================================================    CxCR    ===================================================== */
#define DMAMUX_CxCR_DMAREQ_ID_Pos                                          (0UL)    /*!<DMAMUX CxCR: DMAREQ_ID (Bit 0) */
#define DMAMUX_CxCR_DMAREQ_ID_Msk                                          (0x1fUL)   /*!< DMAMUX CxCR: DMAREQ_ID (Bitfield-Mask: 0x1f) */
#define DMAMUX_CxCR_DMAREQ_ID                                              DMAMUX_CxCR_DMAREQ_ID_Msk
#define DMAMUX_CxCR_DMAREQ_ID_0                                            (0x1U << DMAMUX_CxCR_DMAREQ_ID_Pos)
#define DMAMUX_CxCR_DMAREQ_ID_1                                            (0x2U << DMAMUX_CxCR_DMAREQ_ID_Pos)
#define DMAMUX_CxCR_DMAREQ_ID_2                                            (0x4U << DMAMUX_CxCR_DMAREQ_ID_Pos)
#define DMAMUX_CxCR_DMAREQ_ID_3                                            (0x8U << DMAMUX_CxCR_DMAREQ_ID_Pos)
#define DMAMUX_CxCR_DMAREQ_ID_4                                            (0x10U << DMAMUX_CxCR_DMAREQ_ID_Pos)


/* =========================================================================================================================== */
/*=====================                                       CRC                                       ===================== */
/* =========================================================================================================================== */

/* =====================================================    DR    ===================================================== */
#define CRC_DR_DR_Pos                                                      (0UL)    /*!<CRC DR: DR (Bit 0) */
#define CRC_DR_DR_Msk                                                      (0xffffffffUL)   /*!< CRC DR: DR (Bitfield-Mask: 0xffffffff) */
#define CRC_DR_DR                                                          CRC_DR_DR_Msk
#define CRC_DR_DR_0                                                        (0x1U << CRC_DR_DR_Pos)
#define CRC_DR_DR_1                                                        (0x2U << CRC_DR_DR_Pos)
#define CRC_DR_DR_2                                                        (0x4U << CRC_DR_DR_Pos)
#define CRC_DR_DR_3                                                        (0x8U << CRC_DR_DR_Pos)
#define CRC_DR_DR_4                                                        (0x10U << CRC_DR_DR_Pos)
#define CRC_DR_DR_5                                                        (0x20U << CRC_DR_DR_Pos)
#define CRC_DR_DR_6                                                        (0x40U << CRC_DR_DR_Pos)
#define CRC_DR_DR_7                                                        (0x80U << CRC_DR_DR_Pos)
#define CRC_DR_DR_8                                                        (0x100U << CRC_DR_DR_Pos)
#define CRC_DR_DR_9                                                        (0x200U << CRC_DR_DR_Pos)
#define CRC_DR_DR_10                                                       (0x400U << CRC_DR_DR_Pos)
#define CRC_DR_DR_11                                                       (0x800U << CRC_DR_DR_Pos)
#define CRC_DR_DR_12                                                       (0x1000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_13                                                       (0x2000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_14                                                       (0x4000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_15                                                       (0x8000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_16                                                       (0x10000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_17                                                       (0x20000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_18                                                       (0x40000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_19                                                       (0x80000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_20                                                       (0x100000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_21                                                       (0x200000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_22                                                       (0x400000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_23                                                       (0x800000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_24                                                       (0x1000000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_25                                                       (0x2000000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_26                                                       (0x4000000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_27                                                       (0x8000000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_28                                                       (0x10000000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_29                                                       (0x20000000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_30                                                       (0x40000000U << CRC_DR_DR_Pos)
#define CRC_DR_DR_31                                                       (0x80000000UL << CRC_DR_DR_Pos)

