stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* =====================================================    DR    ===================================================== */
#define SPI_DR_DR_Pos                                                      (0UL)    /*!<SPI DR: DR (Bit 0) */
#define SPI_DR_DR_Msk                                                      (0xffffUL)   /*!< SPI DR: DR (Bitfield-Mask: 0xffff) */
#define SPI_DR_DR                                                          SPI_DR_DR_Msk
#define SPI_DR_DR_0                                                        (0x1U << SPI_DR_DR_Pos)
#define SPI_DR_DR_1                                                        (0x2U << SPI_DR_DR_Pos)
#define SPI_DR_DR_2                                                        (0x4U << SPI_DR_DR_Pos)
#define SPI_DR_DR_3                                                        (0x8U << SPI_DR_DR_Pos)
#define SPI_DR_DR_4                                                        (0x10U << SPI_DR_DR_Pos)
#define SPI_DR_DR_5                                                        (0x20U << SPI_DR_DR_Pos)
#define SPI_DR_DR_6                                                        (0x40U << SPI_DR_DR_Pos)
#define SPI_DR_DR_7                                                        (0x80U << SPI_DR_DR_Pos)
#define SPI_DR_DR_8                                                        (0x100U << SPI_DR_DR_Pos)
#define SPI_DR_DR_9                                                        (0x200U << SPI_DR_DR_Pos)
#define SPI_DR_DR_10                                                       (0x400U << SPI_DR_DR_Pos)
#define SPI_DR_DR_11                                                       (0x800U << SPI_DR_DR_Pos)
#define SPI_DR_DR_12                                                       (0x1000U << SPI_DR_DR_Pos)
#define SPI_DR_DR_13                                                       (0x2000U << SPI_DR_DR_Pos)
#define SPI_DR_DR_14                                                       (0x4000U << SPI_DR_DR_Pos)
#define SPI_DR_DR_15                                                       (0x8000U << SPI_DR_DR_Pos)

/* =====================================================    CRCPR    ===================================================== */
#define SPI_CRCPR_CRCPOLY_Pos                                              (0UL)    /*!<SPI CRCPR: CRCPOLY (Bit 0) */
#define SPI_CRCPR_CRCPOLY_Msk                                              (0xffffUL)   /*!< SPI CRCPR: CRCPOLY (Bitfield-Mask: 0xffff) */
#define SPI_CRCPR_CRCPOLY                                                  SPI_CRCPR_CRCPOLY_Msk
#define SPI_CRCPR_CRCPOLY_0                                                (0x1U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_1                                                (0x2U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_2                                                (0x4U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_3                                                (0x8U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_4                                                (0x10U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_5                                                (0x20U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_6                                                (0x40U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_7                                                (0x80U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_8                                                (0x100U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_9                                                (0x200U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_10                                               (0x400U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_11                                               (0x800U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_12                                               (0x1000U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_13                                               (0x2000U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_14                                               (0x4000U << SPI_CRCPR_CRCPOLY_Pos)
#define SPI_CRCPR_CRCPOLY_15                                               (0x8000U << SPI_CRCPR_CRCPOLY_Pos)

/* =====================================================    RXCRCR    ===================================================== */
#define SPI_RXCRCR_RXCRC_Pos                                               (0UL)    /*!<SPI RXCRCR: RXCRC (Bit 0) */
#define SPI_RXCRCR_RXCRC_Msk                                               (0xffffUL)   /*!< SPI RXCRCR: RXCRC (Bitfield-Mask: 0xffff) */
#define SPI_RXCRCR_RXCRC                                                   SPI_RXCRCR_RXCRC_Msk
#define SPI_RXCRCR_RXCRC_0                                                 (0x1U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_1                                                 (0x2U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_2                                                 (0x4U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_3                                                 (0x8U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_4                                                 (0x10U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_5                                                 (0x20U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_6                                                 (0x40U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_7                                                 (0x80U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_8                                                 (0x100U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_9                                                 (0x200U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_10                                                (0x400U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_11                                                (0x800U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_12                                                (0x1000U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_13                                                (0x2000U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_14                                                (0x4000U << SPI_RXCRCR_RXCRC_Pos)
#define SPI_RXCRCR_RXCRC_15                                                (0x8000U << SPI_RXCRCR_RXCRC_Pos)

/* =====================================================    TXCRCR    ===================================================== */
#define SPI_TXCRCR_TXCRC_Pos                                               (0UL)    /*!<SPI TXCRCR: TXCRC (Bit 0) */
#define SPI_TXCRCR_TXCRC_Msk                                               (0xffffUL)   /*!< SPI TXCRCR: TXCRC (Bitfield-Mask: 0xffff) */
#define SPI_TXCRCR_TXCRC                                                   SPI_TXCRCR_TXCRC_Msk
#define SPI_TXCRCR_TXCRC_0                                                 (0x1U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_1                                                 (0x2U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_2                                                 (0x4U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_3                                                 (0x8U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_4                                                 (0x10U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_5                                                 (0x20U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_6                                                 (0x40U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_7                                                 (0x80U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_8                                                 (0x100U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_9                                                 (0x200U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_10                                                (0x400U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_11                                                (0x800U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_12                                                (0x1000U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_13                                                (0x2000U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_14                                                (0x4000U << SPI_TXCRCR_TXCRC_Pos)
#define SPI_TXCRCR_TXCRC_15                                                (0x8000U << SPI_TXCRCR_TXCRC_Pos)

/* =====================================================    I2SCFGR    ===================================================== */
#define SPI_I2SCFGR_ASTRTEN_Pos                                            (12UL)   /*!<SPI I2SCFGR: ASTRTEN (Bit 12) */
#define SPI_I2SCFGR_ASTRTEN_Msk                                            (0x1000UL)    /*!< SPI I2SCFGR: ASTRTEN (Bitfield-Mask: 0x01) */
#define SPI_I2SCFGR_ASTRTEN                                                SPI_I2SCFGR_ASTRTEN_Msk
#define SPI_I2SCFGR_I2SMOD_Pos                                             (11UL)   /*!<SPI I2SCFGR: I2SMOD (Bit 11) */
#define SPI_I2SCFGR_I2SMOD_Msk                                             (0x800UL)    /*!< SPI I2SCFGR: I2SMOD (Bitfield-Mask: 0x01) */
#define SPI_I2SCFGR_I2SMOD                                                 SPI_I2SCFGR_I2SMOD_Msk
#define SPI_I2SCFGR_I2SE_Pos                                               (10UL)   /*!<SPI I2SCFGR: I2SE (Bit 10) */
#define SPI_I2SCFGR_I2SE_Msk                                               (0x400UL)    /*!< SPI I2SCFGR: I2SE (Bitfield-Mask: 0x01) */
#define SPI_I2SCFGR_I2SE                                                   SPI_I2SCFGR_I2SE_Msk
#define SPI_I2SCFGR_I2SCFG_Pos                                             (8UL)    /*!<SPI I2SCFGR: I2SCFG (Bit 8) */
#define SPI_I2SCFGR_I2SCFG_Msk                                             (0x300UL)    /*!< SPI I2SCFGR: I2SCFG (Bitfield-Mask: 0x03) */
#define SPI_I2SCFGR_I2SCFG                                                 SPI_I2SCFGR_I2SCFG_Msk
#define SPI_I2SCFGR_I2SCFG_0                                               (0x1U << SPI_I2SCFGR_I2SCFG_Pos)
#define SPI_I2SCFGR_I2SCFG_1                                               (0x2U << SPI_I2SCFGR_I2SCFG_Pos)
#define SPI_I2SCFGR_PCMSYNC_Pos                                            (7UL)    /*!<SPI I2SCFGR: PCMSYNC (Bit 7) */
#define SPI_I2SCFGR_PCMSYNC_Msk                                            (0x80UL)   /*!< SPI I2SCFGR: PCMSYNC (Bitfield-Mask: 0x01) */
#define SPI_I2SCFGR_PCMSYNC                                                SPI_I2SCFGR_PCMSYNC_Msk
#define SPI_I2SCFGR_I2SSTD_Pos                                             (4UL)    /*!<SPI I2SCFGR: I2SSTD (Bit 4) */
#define SPI_I2SCFGR_I2SSTD_Msk                                             (0x30UL)   /*!< SPI I2SCFGR: I2SSTD (Bitfield-Mask: 0x03) */
#define SPI_I2SCFGR_I2SSTD                                                 SPI_I2SCFGR_I2SSTD_Msk
#define SPI_I2SCFGR_I2SSTD_0                                               (0x1U << SPI_I2SCFGR_I2SSTD_Pos)
#define SPI_I2SCFGR_I2SSTD_1                                               (0x2U << SPI_I2SCFGR_I2SSTD_Pos)
#define SPI_I2SCFGR_CKPOL_Pos                                              (3UL)    /*!<SPI I2SCFGR: CKPOL (Bit 3) */
#define SPI_I2SCFGR_CKPOL_Msk                                              (0x8UL)    /*!< SPI I2SCFGR: CKPOL (Bitfield-Mask: 0x01) */
#define SPI_I2SCFGR_CKPOL                                                  SPI_I2SCFGR_CKPOL_Msk
#define SPI_I2SCFGR_DATLEN_Pos                                             (1UL)    /*!<SPI I2SCFGR: DATLEN (Bit 1) */
#define SPI_I2SCFGR_DATLEN_Msk                                             (0x6UL)    /*!< SPI I2SCFGR: DATLEN (Bitfield-Mask: 0x03) */
#define SPI_I2SCFGR_DATLEN                                                 SPI_I2SCFGR_DATLEN_Msk
#define SPI_I2SCFGR_DATLEN_0                                               (0x1U << SPI_I2SCFGR_DATLEN_Pos)
#define SPI_I2SCFGR_DATLEN_1                                               (0x2U << SPI_I2SCFGR_DATLEN_Pos)
#define SPI_I2SCFGR_CHLEN_Pos                                              (0UL)    /*!<SPI I2SCFGR: CHLEN (Bit 0) */
#define SPI_I2SCFGR_CHLEN_Msk                                              (0x1UL)    /*!< SPI I2SCFGR: CHLEN (Bitfield-Mask: 0x01) */
#define SPI_I2SCFGR_CHLEN                                                  SPI_I2SCFGR_CHLEN_Msk

