stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* =====================================================    I2SPR    ===================================================== */
#define SPI_I2SPR_MCKOE_Pos                                                (9UL)    /*!<SPI I2SPR: MCKOE (Bit 9) */
#define SPI_I2SPR_MCKOE_Msk                                                (0x200UL)    /*!< SPI I2SPR: MCKOE (Bitfield-Mask: 0x01) */
#define SPI_I2SPR_MCKOE                                                    SPI_I2SPR_MCKOE_Msk
#define SPI_I2SPR_ODD_Pos                                                  (8UL)    /*!<SPI I2SPR: ODD (Bit 8) */
#define SPI_I2SPR_ODD_Msk                                                  (0x100UL)    /*!< SPI I2SPR: ODD (Bitfield-Mask: 0x01) */
#define SPI_I2SPR_ODD                                                      SPI_I2SPR_ODD_Msk
#define SPI_I2SPR_I2SDIV_Pos                                               (0UL)    /*!<SPI I2SPR: I2SDIV (Bit 0) */
#define SPI_I2SPR_I2SDIV_Msk                                               (0xffUL)   /*!< SPI I2SPR: I2SDIV (Bitfield-Mask: 0xff) */
#define SPI_I2SPR_I2SDIV                                                   SPI_I2SPR_I2SDIV_Msk
#define SPI_I2SPR_I2SDIV_0                                                 (0x1U << SPI_I2SPR_I2SDIV_Pos)
#define SPI_I2SPR_I2SDIV_1                                                 (0x2U << SPI_I2SPR_I2SDIV_Pos)
#define SPI_I2SPR_I2SDIV_2                                                 (0x4U << SPI_I2SPR_I2SDIV_Pos)
#define SPI_I2SPR_I2SDIV_3                                                 (0x8U << SPI_I2SPR_I2SDIV_Pos)
#define SPI_I2SPR_I2SDIV_4                                                 (0x10U << SPI_I2SPR_I2SDIV_Pos)
#define SPI_I2SPR_I2SDIV_5                                                 (0x20U << SPI_I2SPR_I2SDIV_Pos)
#define SPI_I2SPR_I2SDIV_6                                                 (0x40U << SPI_I2SPR_I2SDIV_Pos)
#define SPI_I2SPR_I2SDIV_7                                                 (0x80U << SPI_I2SPR_I2SDIV_Pos)


/* =========================================================================================================================== */
/*=====================                                       RCC                                       ===================== */
/* =========================================================================================================================== */

/* =====================================================    CR    ===================================================== */
#define RCC_CR_HSERDY_Pos                                                  (17UL)   /*!<RCC CR: HSERDY (Bit 17) */
#define RCC_CR_HSERDY_Msk                                                  (0x20000UL)    /*!< RCC CR: HSERDY (Bitfield-Mask: 0x01) */
#define RCC_CR_HSERDY                                                      RCC_CR_HSERDY_Msk
#define RCC_CR_HSEON_Pos                                                   (16UL)   /*!<RCC CR: HSEON (Bit 16) */
#define RCC_CR_HSEON_Msk                                                   (0x10000UL)    /*!< RCC CR: HSEON (Bitfield-Mask: 0x01) */
#define RCC_CR_HSEON                                                       RCC_CR_HSEON_Msk
#define RCC_CR_FMRAT_Pos                                                   (15UL)   /*!<RCC CR: FMRAT (Bit 15) */
#define RCC_CR_FMRAT_Msk                                                   (0x8000UL)   /*!< RCC CR: FMRAT (Bitfield-Mask: 0x01) */
#define RCC_CR_FMRAT                                                       RCC_CR_FMRAT_Msk
#define RCC_CR_HSIPLLRDY_Pos                                               (14UL)   /*!<RCC CR: HSIPLLRDY (Bit 14) */
#define RCC_CR_HSIPLLRDY_Msk                                               (0x4000UL)   /*!< RCC CR: HSIPLLRDY (Bitfield-Mask: 0x01) */
#define RCC_CR_HSIPLLRDY                                                   RCC_CR_HSIPLLRDY_Msk
#define RCC_CR_HSIPLLON_Pos                                                (13UL)   /*!<RCC CR: HSIPLLON (Bit 13) */
#define RCC_CR_HSIPLLON_Msk                                                (0x2000UL)   /*!< RCC CR: HSIPLLON (Bitfield-Mask: 0x01) */
#define RCC_CR_HSIPLLON                                                    RCC_CR_HSIPLLON_Msk
#define RCC_CR_HSEPLLBUFON_Pos                                             (12UL)   /*!<RCC CR: HSEPLLBUFON (Bit 12) */
#define RCC_CR_HSEPLLBUFON_Msk                                             (0x1000UL)   /*!< RCC CR: HSEPLLBUFON (Bitfield-Mask: 0x01) */
#define RCC_CR_HSEPLLBUFON                                                 RCC_CR_HSEPLLBUFON_Msk
#define RCC_CR_HSIRDY_Pos                                                  (10UL)   /*!<RCC CR: HSIRDY (Bit 10) */
#define RCC_CR_HSIRDY_Msk                                                  (0x400UL)    /*!< RCC CR: HSIRDY (Bitfield-Mask: 0x01) */
#define RCC_CR_HSIRDY                                                      RCC_CR_HSIRDY_Msk
#define RCC_CR_LOCKDET_NSTOP_Pos                                           (7UL)    /*!<RCC CR: LOCKDET_NSTOP (Bit 7) */
#define RCC_CR_LOCKDET_NSTOP_Msk                                           (0x380UL)    /*!< RCC CR: LOCKDET_NSTOP (Bitfield-Mask: 0x07) */
#define RCC_CR_LOCKDET_NSTOP                                               RCC_CR_LOCKDET_NSTOP_Msk
#define RCC_CR_LOCKDET_NSTOP_0                                             (0x1U << RCC_CR_LOCKDET_NSTOP_Pos)
#define RCC_CR_LOCKDET_NSTOP_1                                             (0x2U << RCC_CR_LOCKDET_NSTOP_Pos)
#define RCC_CR_LOCKDET_NSTOP_2                                             (0x4U << RCC_CR_LOCKDET_NSTOP_Pos)
#define RCC_CR_LSEBYP_Pos                                                  (6UL)    /*!<RCC CR: LSEBYP (Bit 6) */
#define RCC_CR_LSEBYP_Msk                                                  (0x40UL)   /*!< RCC CR: LSEBYP (Bitfield-Mask: 0x01) */
#define RCC_CR_LSEBYP                                                      RCC_CR_LSEBYP_Msk
#define RCC_CR_LSERDY_Pos                                                  (5UL)    /*!<RCC CR: LSERDY (Bit 5) */
#define RCC_CR_LSERDY_Msk                                                  (0x20UL)   /*!< RCC CR: LSERDY (Bitfield-Mask: 0x01) */
#define RCC_CR_LSERDY                                                      RCC_CR_LSERDY_Msk
#define RCC_CR_LSEON_Pos                                                   (4UL)    /*!<RCC CR: LSEON (Bit 4) */
#define RCC_CR_LSEON_Msk                                                   (0x10UL)   /*!< RCC CR: LSEON (Bitfield-Mask: 0x01) */
#define RCC_CR_LSEON                                                       RCC_CR_LSEON_Msk
#define RCC_CR_LSIRDY_Pos                                                  (3UL)    /*!<RCC CR: LSIRDY (Bit 3) */
#define RCC_CR_LSIRDY_Msk                                                  (0x8UL)    /*!< RCC CR: LSIRDY (Bitfield-Mask: 0x01) */
#define RCC_CR_LSIRDY                                                      RCC_CR_LSIRDY_Msk
#define RCC_CR_LSION_Pos                                                   (2UL)    /*!<RCC CR: LSION (Bit 2) */
#define RCC_CR_LSION_Msk                                                   (0x4UL)    /*!< RCC CR: LSION (Bitfield-Mask: 0x01) */
#define RCC_CR_LSION                                                       RCC_CR_LSION_Msk

/* =====================================================    ICSCR    ===================================================== */
#define RCC_ICSCR_HSITRIM_Pos                                              (24UL)   /*!<RCC ICSCR: HSITRIM (Bit 24) */
#define RCC_ICSCR_HSITRIM_Msk                                              (0x3f000000UL)   /*!< RCC ICSCR: HSITRIM (Bitfield-Mask: 0x3f) */
#define RCC_ICSCR_HSITRIM                                                  RCC_ICSCR_HSITRIM_Msk
#define RCC_ICSCR_HSITRIM_0                                                (0x1U << RCC_ICSCR_HSITRIM_Pos)
#define RCC_ICSCR_HSITRIM_1                                                (0x2U << RCC_ICSCR_HSITRIM_Pos)
#define RCC_ICSCR_HSITRIM_2                                                (0x4U << RCC_ICSCR_HSITRIM_Pos)
#define RCC_ICSCR_HSITRIM_3                                                (0x8U << RCC_ICSCR_HSITRIM_Pos)
#define RCC_ICSCR_HSITRIM_4                                                (0x10U << RCC_ICSCR_HSITRIM_Pos)
#define RCC_ICSCR_HSITRIM_5                                                (0x20U << RCC_ICSCR_HSITRIM_Pos)
#define RCC_ICSCR_LSIBW_Pos                                                (2UL)    /*!<RCC ICSCR: LSIBW (Bit 2) */
#define RCC_ICSCR_LSIBW_Msk                                                (0x3cUL)   /*!< RCC ICSCR: LSIBW (Bitfield-Mask: 0x0f) */
#define RCC_ICSCR_LSIBW                                                    RCC_ICSCR_LSIBW_Msk
#define RCC_ICSCR_LSIBW_0                                                  (0x1U << RCC_ICSCR_LSIBW_Pos)
#define RCC_ICSCR_LSIBW_1                                                  (0x2U << RCC_ICSCR_LSIBW_Pos)
#define RCC_ICSCR_LSIBW_2                                                  (0x4U << RCC_ICSCR_LSIBW_Pos)
#define RCC_ICSCR_LSIBW_3                                                  (0x8U << RCC_ICSCR_LSIBW_Pos)
#define RCC_ICSCR_LSITRIMOK_Pos                                            (1UL)    /*!<RCC ICSCR: LSITRIMOK (Bit 1) */
#define RCC_ICSCR_LSITRIMOK_Msk                                            (0x2UL)    /*!< RCC ICSCR: LSITRIMOK (Bitfield-Mask: 0x01) */
#define RCC_ICSCR_LSITRIMOK                                                RCC_ICSCR_LSITRIMOK_Msk
#define RCC_ICSCR_LSITRIMEN_Pos                                            (0UL)    /*!<RCC ICSCR: LSITRIMEN (Bit 0) */
#define RCC_ICSCR_LSITRIMEN_Msk                                            (0x1UL)    /*!< RCC ICSCR: LSITRIMEN (Bitfield-Mask: 0x01) */
#define RCC_ICSCR_LSITRIMEN                                                RCC_ICSCR_LSITRIMEN_Msk

/* =====================================================    CFGR    ===================================================== */
#define RCC_CFGR_CCOPRE_Pos                                                (29UL)   /*!<RCC CFGR: CCOPRE (Bit 29) */
#define RCC_CFGR_CCOPRE_Msk                                                (0xe0000000UL)   /*!< RCC CFGR: CCOPRE (Bitfield-Mask: 0x07) */
#define RCC_CFGR_CCOPRE                                                    RCC_CFGR_CCOPRE_Msk
#define RCC_CFGR_CCOPRE_0                                                  (0x1U << RCC_CFGR_CCOPRE_Pos)
#define RCC_CFGR_CCOPRE_1                                                  (0x2U << RCC_CFGR_CCOPRE_Pos)
#define RCC_CFGR_CCOPRE_2                                                  (0x4U << RCC_CFGR_CCOPRE_Pos)
#define RCC_CFGR_MCOSEL_Pos                                                (26UL)   /*!<RCC CFGR: MCOSEL (Bit 26) */
#define RCC_CFGR_MCOSEL_Msk                                                (0x1c000000UL)   /*!< RCC CFGR: MCOSEL (Bitfield-Mask: 0x07) */
#define RCC_CFGR_MCOSEL                                                    RCC_CFGR_MCOSEL_Msk
#define RCC_CFGR_MCOSEL_0                                                  (0x1U << RCC_CFGR_MCOSEL_Pos)
#define RCC_CFGR_MCOSEL_1                                                  (0x2U << RCC_CFGR_MCOSEL_Pos)
#define RCC_CFGR_MCOSEL_2                                                  (0x4U << RCC_CFGR_MCOSEL_Pos)
#define RCC_CFGR_LCOSEL_Pos                                                (24UL)   /*!<RCC CFGR: LCOSEL (Bit 24) */
#define RCC_CFGR_LCOSEL_Msk                                                (0x3000000UL)    /*!< RCC CFGR: LCOSEL (Bitfield-Mask: 0x03) */
#define RCC_CFGR_LCOSEL                                                    RCC_CFGR_LCOSEL_Msk
#define RCC_CFGR_LCOSEL_0                                                  (0x1U << RCC_CFGR_LCOSEL_Pos)
#define RCC_CFGR_LCOSEL_1                                                  (0x2U << RCC_CFGR_LCOSEL_Pos)
#define RCC_CFGR_SPI2I2SCLKSEL_Pos                                         (23UL)   /*!<RCC CFGR: SPI2I2SCLKSEL (Bit 23) */
#define RCC_CFGR_SPI2I2SCLKSEL_Msk                                         (0x800000UL)   /*!< RCC CFGR: SPI2I2SCLKSEL (Bitfield-Mask: 0x01) */
#define RCC_CFGR_SPI2I2SCLKSEL                                             RCC_CFGR_SPI2I2SCLKSEL_Msk
#define RCC_CFGR_SPI3I2SCLKSEL_Pos                                         (22UL)   /*!<RCC CFGR: SPI3I2SCLKSEL (Bit 22) */
#define RCC_CFGR_SPI3I2SCLKSEL_Msk                                         (0x400000UL)   /*!< RCC CFGR: SPI3I2SCLKSEL (Bitfield-Mask: 0x01) */
#define RCC_CFGR_SPI3I2SCLKSEL                                             RCC_CFGR_SPI3I2SCLKSEL_Msk
#define RCC_CFGR_IOBOOSTEN_Pos                                             (17UL)   /*!<RCC CFGR: IOBOOSTEN (Bit 17) */
#define RCC_CFGR_IOBOOSTEN_Msk                                             (0x20000UL)    /*!< RCC CFGR: IOBOOSTEN (Bitfield-Mask: 0x01) */
#define RCC_CFGR_IOBOOSTEN                                                 RCC_CFGR_IOBOOSTEN_Msk
#define RCC_CFGR_CLKSLOWSEL_Pos                                            (15UL)   /*!<RCC CFGR: CLKSLOWSEL (Bit 15) */
#define RCC_CFGR_CLKSLOWSEL_Msk                                            (0x18000UL)    /*!< RCC CFGR: CLKSLOWSEL (Bitfield-Mask: 0x03) */
#define RCC_CFGR_CLKSLOWSEL                                                RCC_CFGR_CLKSLOWSEL_Msk
#define RCC_CFGR_CLKSLOWSEL_0                                              (0x1U << RCC_CFGR_CLKSLOWSEL_Pos)
#define RCC_CFGR_CLKSLOWSEL_1                                              (0x2U << RCC_CFGR_CLKSLOWSEL_Pos)
#define RCC_CFGR_SMPSDIV_Pos                                               (12UL)   /*!<RCC CFGR: SMPSDIV (Bit 12) */
#define RCC_CFGR_SMPSDIV_Msk                                               (0x1000UL)   /*!< RCC CFGR: SMPSDIV (Bitfield-Mask: 0x01) */
#define RCC_CFGR_SMPSDIV                                                   RCC_CFGR_SMPSDIV_Msk
#define RCC_CFGR_ANADIV_Pos                                                (10UL)   /*!<RCC CFGR: ANADIV (Bit 10) */
#define RCC_CFGR_ANADIV_Msk                                                (0xc00UL)    /*!< RCC CFGR: ANADIV (Bitfield-Mask: 0x03) */
#define RCC_CFGR_ANADIV                                                    RCC_CFGR_ANADIV_Msk
#define RCC_CFGR_ANADIV_0                                                  (0x1U << RCC_CFGR_ANADIV_Pos)
#define RCC_CFGR_ANADIV_1                                                  (0x2U << RCC_CFGR_ANADIV_Pos)
#define RCC_CFGR_CLKSYSDIV_Pos                                             (5UL)    /*!<RCC CFGR: CLKSYSDIV (Bit 5) */
#define RCC_CFGR_CLKSYSDIV_Msk                                             (0xe0UL)   /*!< RCC CFGR: CLKSYSDIV (Bitfield-Mask: 0x07) */
#define RCC_CFGR_CLKSYSDIV                                                 RCC_CFGR_CLKSYSDIV_Msk
#define RCC_CFGR_CLKSYSDIV_0                                               (0x1U << RCC_CFGR_CLKSYSDIV_Pos)
#define RCC_CFGR_CLKSYSDIV_1                                               (0x2U << RCC_CFGR_CLKSYSDIV_Pos)
#define RCC_CFGR_CLKSYSDIV_2                                               (0x4U << RCC_CFGR_CLKSYSDIV_Pos)
#define RCC_CFGR_STOPHSI_Pos                                               (2UL)    /*!<RCC CFGR: STOPHSI (Bit 2) */
#define RCC_CFGR_STOPHSI_Msk                                               (0x4UL)    /*!< RCC CFGR: STOPHSI (Bitfield-Mask: 0x01) */
#define RCC_CFGR_STOPHSI                                                   RCC_CFGR_STOPHSI_Msk
#define RCC_CFGR_HSESEL_Pos                                                (1UL)    /*!<RCC CFGR: HSESEL (Bit 1) */
#define RCC_CFGR_HSESEL_Msk                                                (0x2UL)    /*!< RCC CFGR: HSESEL (Bitfield-Mask: 0x01) */
#define RCC_CFGR_HSESEL                                                    RCC_CFGR_HSESEL_Msk
#define RCC_CFGR_SMPSINV_Pos                                               (0UL)    /*!<RCC CFGR: SMPSINV (Bit 0) */
#define RCC_CFGR_SMPSINV_Msk                                               (0x1UL)    /*!< RCC CFGR: SMPSINV (Bitfield-Mask: 0x01) */
#define RCC_CFGR_SMPSINV                                                   RCC_CFGR_SMPSINV_Msk

/* =====================================================    CSSWCR    ===================================================== */
#define RCC_CSSWCR_HSITRIMSW_Pos                                           (24UL)   /*!<RCC CSSWCR: HSITRIMSW (Bit 24) */
#define RCC_CSSWCR_HSITRIMSW_Msk                                           (0x3f000000UL)   /*!< RCC CSSWCR: HSITRIMSW (Bitfield-Mask: 0x3f) */
#define RCC_CSSWCR_HSITRIMSW                                               RCC_CSSWCR_HSITRIMSW_Msk
#define RCC_CSSWCR_HSITRIMSW_0                                             (0x1U << RCC_CSSWCR_HSITRIMSW_Pos)
#define RCC_CSSWCR_HSITRIMSW_1                                             (0x2U << RCC_CSSWCR_HSITRIMSW_Pos)
#define RCC_CSSWCR_HSITRIMSW_2                                             (0x4U << RCC_CSSWCR_HSITRIMSW_Pos)
#define RCC_CSSWCR_HSITRIMSW_3                                             (0x8U << RCC_CSSWCR_HSITRIMSW_Pos)
#define RCC_CSSWCR_HSITRIMSW_4                                             (0x10U << RCC_CSSWCR_HSITRIMSW_Pos)
#define RCC_CSSWCR_HSITRIMSW_5                                             (0x20U << RCC_CSSWCR_HSITRIMSW_Pos)
#define RCC_CSSWCR_HSISWTRIMEN_Pos                                         (23UL)   /*!<RCC CSSWCR: HSISWTRIMEN (Bit 23) */
#define RCC_CSSWCR_HSISWTRIMEN_Msk                                         (0x800000UL)   /*!< RCC CSSWCR: HSISWTRIMEN (Bitfield-Mask: 0x01) */
#define RCC_CSSWCR_HSISWTRIMEN                                             RCC_CSSWCR_HSISWTRIMEN_Msk
#define RCC_CSSWCR_LSEDRV_Pos                                              (5UL)    /*!<RCC CSSWCR: LSEDRV (Bit 5) */
#define RCC_CSSWCR_LSEDRV_Msk                                              (0x60UL)   /*!< RCC CSSWCR: LSEDRV (Bitfield-Mask: 0x03) */
#define RCC_CSSWCR_LSEDRV                                                  RCC_CSSWCR_LSEDRV_Msk
#define RCC_CSSWCR_LSEDRV_0                                                (0x1U << RCC_CSSWCR_LSEDRV_Pos)
#define RCC_CSSWCR_LSEDRV_1                                                (0x2U << RCC_CSSWCR_LSEDRV_Pos)
#define RCC_CSSWCR_LSISWBW_Pos                                             (1UL)    /*!<RCC CSSWCR: LSISWBW (Bit 1) */
#define RCC_CSSWCR_LSISWBW_Msk                                             (0x1eUL)   /*!< RCC CSSWCR: LSISWBW (Bitfield-Mask: 0x0f) */
#define RCC_CSSWCR_LSISWBW                                                 RCC_CSSWCR_LSISWBW_Msk
#define RCC_CSSWCR_LSISWBW_0                                               (0x1U << RCC_CSSWCR_LSISWBW_Pos)
#define RCC_CSSWCR_LSISWBW_1                                               (0x2U << RCC_CSSWCR_LSISWBW_Pos)
#define RCC_CSSWCR_LSISWBW_2                                               (0x4U << RCC_CSSWCR_LSISWBW_Pos)
#define RCC_CSSWCR_LSISWBW_3                                               (0x8U << RCC_CSSWCR_LSISWBW_Pos)
#define RCC_CSSWCR_LSISWTRIMEN_Pos                                         (0UL)    /*!<RCC CSSWCR: LSISWTRIMEN (Bit 0) */
#define RCC_CSSWCR_LSISWTRIMEN_Msk                                         (0x1UL)    /*!< RCC CSSWCR: LSISWTRIMEN (Bitfield-Mask: 0x01) */
#define RCC_CSSWCR_LSISWTRIMEN                                             RCC_CSSWCR_LSISWTRIMEN_Msk

