stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* =====================================================    SR3    ===================================================== */
#define PWR_SR3_WUF27_Pos                                                  (15UL)   /*!<PWR SR3: WUF27 (Bit 15) */
#define PWR_SR3_WUF27_Msk                                                  (0x8000UL)   /*!< PWR SR3: WUF27 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF27                                                      PWR_SR3_WUF27_Msk
#define PWR_SR3_WUF26_Pos                                                  (14UL)   /*!<PWR SR3: WUF26 (Bit 14) */
#define PWR_SR3_WUF26_Msk                                                  (0x4000UL)   /*!< PWR SR3: WUF26 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF26                                                      PWR_SR3_WUF26_Msk
#define PWR_SR3_WUF25_Pos                                                  (13UL)   /*!<PWR SR3: WUF25 (Bit 13) */
#define PWR_SR3_WUF25_Msk                                                  (0x2000UL)   /*!< PWR SR3: WUF25 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF25                                                      PWR_SR3_WUF25_Msk
#define PWR_SR3_WUF24_Pos                                                  (12UL)   /*!<PWR SR3: WUF24 (Bit 12) */
#define PWR_SR3_WUF24_Msk                                                  (0x1000UL)   /*!< PWR SR3: WUF24 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF24                                                      PWR_SR3_WUF24_Msk
#define PWR_SR3_WUF23_Pos                                                  (11UL)   /*!<PWR SR3: WUF23 (Bit 11) */
#define PWR_SR3_WUF23_Msk                                                  (0x800UL)    /*!< PWR SR3: WUF23 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF23                                                      PWR_SR3_WUF23_Msk
#define PWR_SR3_WUF22_Pos                                                  (10UL)   /*!<PWR SR3: WUF22 (Bit 10) */
#define PWR_SR3_WUF22_Msk                                                  (0x400UL)    /*!< PWR SR3: WUF22 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF22                                                      PWR_SR3_WUF22_Msk
#define PWR_SR3_WUF21_Pos                                                  (9UL)    /*!<PWR SR3: WUF21 (Bit 9) */
#define PWR_SR3_WUF21_Msk                                                  (0x200UL)    /*!< PWR SR3: WUF21 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF21                                                      PWR_SR3_WUF21_Msk
#define PWR_SR3_WUF20_Pos                                                  (8UL)    /*!<PWR SR3: WUF20 (Bit 8) */
#define PWR_SR3_WUF20_Msk                                                  (0x100UL)    /*!< PWR SR3: WUF20 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF20                                                      PWR_SR3_WUF20_Msk
#define PWR_SR3_WUF19_Pos                                                  (7UL)    /*!<PWR SR3: WUF19 (Bit 7) */
#define PWR_SR3_WUF19_Msk                                                  (0x80UL)   /*!< PWR SR3: WUF19 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF19                                                      PWR_SR3_WUF19_Msk
#define PWR_SR3_WUF18_Pos                                                  (6UL)    /*!<PWR SR3: WUF18 (Bit 6) */
#define PWR_SR3_WUF18_Msk                                                  (0x40UL)   /*!< PWR SR3: WUF18 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF18                                                      PWR_SR3_WUF18_Msk
#define PWR_SR3_WUF17_Pos                                                  (5UL)    /*!<PWR SR3: WUF17 (Bit 5) */
#define PWR_SR3_WUF17_Msk                                                  (0x20UL)   /*!< PWR SR3: WUF17 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF17                                                      PWR_SR3_WUF17_Msk
#define PWR_SR3_WUF16_Pos                                                  (4UL)    /*!<PWR SR3: WUF16 (Bit 4) */
#define PWR_SR3_WUF16_Msk                                                  (0x10UL)   /*!< PWR SR3: WUF16 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF16                                                      PWR_SR3_WUF16_Msk
#define PWR_SR3_WUF15_Pos                                                  (3UL)    /*!<PWR SR3: WUF15 (Bit 3) */
#define PWR_SR3_WUF15_Msk                                                  (0x8UL)    /*!< PWR SR3: WUF15 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF15                                                      PWR_SR3_WUF15_Msk
#define PWR_SR3_WUF14_Pos                                                  (2UL)    /*!<PWR SR3: WUF14 (Bit 2) */
#define PWR_SR3_WUF14_Msk                                                  (0x4UL)    /*!< PWR SR3: WUF14 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF14                                                      PWR_SR3_WUF14_Msk
#define PWR_SR3_WUF13_Pos                                                  (1UL)    /*!<PWR SR3: WUF13 (Bit 1) */
#define PWR_SR3_WUF13_Msk                                                  (0x2UL)    /*!< PWR SR3: WUF13 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF13                                                      PWR_SR3_WUF13_Msk
#define PWR_SR3_WUF12_Pos                                                  (0UL)    /*!<PWR SR3: WUF12 (Bit 0) */
#define PWR_SR3_WUF12_Msk                                                  (0x1UL)    /*!< PWR SR3: WUF12 (Bitfield-Mask: 0x01) */
#define PWR_SR3_WUF12                                                      PWR_SR3_WUF12_Msk

/* =====================================================    IOxCFG    ===================================================== */
#define PWR_IOxCFG_IOCFG7_Pos                                              (14UL)   /*!<PWR IOxCFG: IOCFG7 (Bit 14) */
#define PWR_IOxCFG_IOCFG7_Msk                                              (0xc000UL)   /*!< PWR IOxCFG: IOCFG7 (Bitfield-Mask: 0x03) */
#define PWR_IOxCFG_IOCFG7                                                  PWR_IOxCFG_IOCFG7_Msk
#define PWR_IOxCFG_IOCFG7_0                                                (0x1U << PWR_IOxCFG_IOCFG7_Pos)
#define PWR_IOxCFG_IOCFG7_1                                                (0x2U << PWR_IOxCFG_IOCFG7_Pos)
#define PWR_IOxCFG_IOCFG6_Pos                                              (12UL)   /*!<PWR IOxCFG: IOCFG6 (Bit 12) */
#define PWR_IOxCFG_IOCFG6_Msk                                              (0x3000UL)   /*!< PWR IOxCFG: IOCFG6 (Bitfield-Mask: 0x03) */
#define PWR_IOxCFG_IOCFG6                                                  PWR_IOxCFG_IOCFG6_Msk
#define PWR_IOxCFG_IOCFG6_0                                                (0x1U << PWR_IOxCFG_IOCFG6_Pos)
#define PWR_IOxCFG_IOCFG6_1                                                (0x2U << PWR_IOxCFG_IOCFG6_Pos)
#define PWR_IOxCFG_IOCFG5_Pos                                              (10UL)   /*!<PWR IOxCFG: IOCFG5 (Bit 10) */
#define PWR_IOxCFG_IOCFG5_Msk                                              (0xc00UL)    /*!< PWR IOxCFG: IOCFG5 (Bitfield-Mask: 0x03) */
#define PWR_IOxCFG_IOCFG5                                                  PWR_IOxCFG_IOCFG5_Msk
#define PWR_IOxCFG_IOCFG5_0                                                (0x1U << PWR_IOxCFG_IOCFG5_Pos)
#define PWR_IOxCFG_IOCFG5_1                                                (0x2U << PWR_IOxCFG_IOCFG5_Pos)
#define PWR_IOxCFG_IOCFG4_Pos                                              (8UL)    /*!<PWR IOxCFG: IOCFG4 (Bit 8) */
#define PWR_IOxCFG_IOCFG4_Msk                                              (0x300UL)    /*!< PWR IOxCFG: IOCFG4 (Bitfield-Mask: 0x03) */
#define PWR_IOxCFG_IOCFG4                                                  PWR_IOxCFG_IOCFG4_Msk
#define PWR_IOxCFG_IOCFG4_0                                                (0x1U << PWR_IOxCFG_IOCFG4_Pos)
#define PWR_IOxCFG_IOCFG4_1                                                (0x2U << PWR_IOxCFG_IOCFG4_Pos)
#define PWR_IOxCFG_IOCFG3_Pos                                              (6UL)    /*!<PWR IOxCFG: IOCFG3 (Bit 6) */
#define PWR_IOxCFG_IOCFG3_Msk                                              (0xc0UL)   /*!< PWR IOxCFG: IOCFG3 (Bitfield-Mask: 0x03) */
#define PWR_IOxCFG_IOCFG3                                                  PWR_IOxCFG_IOCFG3_Msk
#define PWR_IOxCFG_IOCFG3_0                                                (0x1U << PWR_IOxCFG_IOCFG3_Pos)
#define PWR_IOxCFG_IOCFG3_1                                                (0x2U << PWR_IOxCFG_IOCFG3_Pos)
#define PWR_IOxCFG_IOCFG2_Pos                                              (4UL)    /*!<PWR IOxCFG: IOCFG2 (Bit 4) */
#define PWR_IOxCFG_IOCFG2_Msk                                              (0x30UL)   /*!< PWR IOxCFG: IOCFG2 (Bitfield-Mask: 0x03) */
#define PWR_IOxCFG_IOCFG2                                                  PWR_IOxCFG_IOCFG2_Msk
#define PWR_IOxCFG_IOCFG2_0                                                (0x1U << PWR_IOxCFG_IOCFG2_Pos)
#define PWR_IOxCFG_IOCFG2_1                                                (0x2U << PWR_IOxCFG_IOCFG2_Pos)
#define PWR_IOxCFG_IOCFG1_Pos                                              (2UL)    /*!<PWR IOxCFG: IOCFG1 (Bit 2) */
#define PWR_IOxCFG_IOCFG1_Msk                                              (0xcUL)    /*!< PWR IOxCFG: IOCFG1 (Bitfield-Mask: 0x03) */
#define PWR_IOxCFG_IOCFG1                                                  PWR_IOxCFG_IOCFG1_Msk
#define PWR_IOxCFG_IOCFG1_0                                                (0x1U << PWR_IOxCFG_IOCFG1_Pos)
#define PWR_IOxCFG_IOCFG1_1                                                (0x2U << PWR_IOxCFG_IOCFG1_Pos)
#define PWR_IOxCFG_IOCFG0_Pos                                              (0UL)    /*!<PWR IOxCFG: IOCFG0 (Bit 0) */
#define PWR_IOxCFG_IOCFG0_Msk                                              (0x3UL)    /*!< PWR IOxCFG: IOCFG0 (Bitfield-Mask: 0x03) */
#define PWR_IOxCFG_IOCFG0                                                  PWR_IOxCFG_IOCFG0_Msk
#define PWR_IOxCFG_IOCFG0_0                                                (0x1U << PWR_IOxCFG_IOCFG0_Pos)
#define PWR_IOxCFG_IOCFG0_1                                                (0x2U << PWR_IOxCFG_IOCFG0_Pos)

/* =====================================================    DBGR    ===================================================== */
#define PWR_DBGR_DEEPSTOP2_Pos                                             (0UL)    /*!<PWR DBGR: DEEPSTOP2 (Bit 0) */
#define PWR_DBGR_DEEPSTOP2_Msk                                             (0x1UL)    /*!< PWR DBGR: DEEPSTOP2 (Bitfield-Mask: 0x01) */
#define PWR_DBGR_DEEPSTOP2                                                 PWR_DBGR_DEEPSTOP2_Msk

/* =====================================================    EXTSRR    ===================================================== */
#define PWR_EXTSRR_RFPHASEF_Pos                                            (10UL)   /*!<PWR EXTSRR: RFPHASEF (Bit 10) */
#define PWR_EXTSRR_RFPHASEF_Msk                                            (0x400UL)    /*!< PWR EXTSRR: RFPHASEF (Bitfield-Mask: 0x01) */
#define PWR_EXTSRR_RFPHASEF                                                PWR_EXTSRR_RFPHASEF_Msk
#define PWR_EXTSRR_DEEPSTOPF_Pos                                           (9UL)    /*!<PWR EXTSRR: DEEPSTOPF (Bit 9) */
#define PWR_EXTSRR_DEEPSTOPF_Msk                                           (0x200UL)    /*!< PWR EXTSRR: DEEPSTOPF (Bitfield-Mask: 0x01) */
#define PWR_EXTSRR_DEEPSTOPF                                               PWR_EXTSRR_DEEPSTOPF_Msk

/* =====================================================    DBGSMPS    ===================================================== */
#define PWR_DBGSMPS_TEST_OL_Pos                                            (11UL)   /*!<PWR DBGSMPS: TEST_OL (Bit 11) */
#define PWR_DBGSMPS_TEST_OL_Msk                                            (0x800UL)    /*!< PWR DBGSMPS: TEST_OL (Bitfield-Mask: 0x01) */
#define PWR_DBGSMPS_TEST_OL                                                PWR_DBGSMPS_TEST_OL_Msk
#define PWR_DBGSMPS_DIS_BIG_MOS_Pos                                        (10UL)   /*!<PWR DBGSMPS: DIS_BIG_MOS (Bit 10) */
#define PWR_DBGSMPS_DIS_BIG_MOS_Msk                                        (0x400UL)    /*!< PWR DBGSMPS: DIS_BIG_MOS (Bitfield-Mask: 0x01) */
#define PWR_DBGSMPS_DIS_BIG_MOS                                            PWR_DBGSMPS_DIS_BIG_MOS_Msk
#define PWR_DBGSMPS_CTLRES_RAMP_Pos                                        (9UL)    /*!<PWR DBGSMPS: CTLRES_RAMP (Bit 9) */
#define PWR_DBGSMPS_CTLRES_RAMP_Msk                                        (0x200UL)    /*!< PWR DBGSMPS: CTLRES_RAMP (Bitfield-Mask: 0x01) */
#define PWR_DBGSMPS_CTLRES_RAMP                                            PWR_DBGSMPS_CTLRES_RAMP_Msk
#define PWR_DBGSMPS_TESTILIM_Pos                                           (8UL)    /*!<PWR DBGSMPS: TESTILIM (Bit 8) */
#define PWR_DBGSMPS_TESTILIM_Msk                                           (0x100UL)    /*!< PWR DBGSMPS: TESTILIM (Bitfield-Mask: 0x01) */
#define PWR_DBGSMPS_TESTILIM                                               PWR_DBGSMPS_TESTILIM_Msk
#define PWR_DBGSMPS_NO_STUP_Pos                                            (7UL)    /*!<PWR DBGSMPS: NO_STUP (Bit 7) */
#define PWR_DBGSMPS_NO_STUP_Msk                                            (0x80UL)   /*!< PWR DBGSMPS: NO_STUP (Bitfield-Mask: 0x01) */
#define PWR_DBGSMPS_NO_STUP                                                PWR_DBGSMPS_NO_STUP_Msk
#define PWR_DBGSMPS_HOT_STUP_Pos                                           (6UL)    /*!<PWR DBGSMPS: HOT_STUP (Bit 6) */
#define PWR_DBGSMPS_HOT_STUP_Msk                                           (0x40UL)   /*!< PWR DBGSMPS: HOT_STUP (Bitfield-Mask: 0x01) */
#define PWR_DBGSMPS_HOT_STUP                                               PWR_DBGSMPS_HOT_STUP_Msk
#define PWR_DBGSMPS_TESTKEL_Pos                                            (4UL)    /*!<PWR DBGSMPS: TESTKEL (Bit 4) */
#define PWR_DBGSMPS_TESTKEL_Msk                                            (0x30UL)   /*!< PWR DBGSMPS: TESTKEL (Bitfield-Mask: 0x03) */
#define PWR_DBGSMPS_TESTKEL                                                PWR_DBGSMPS_TESTKEL_Msk
#define PWR_DBGSMPS_TESTKEL_0                                              (0x1U << PWR_DBGSMPS_TESTKEL_Pos)
#define PWR_DBGSMPS_TESTKEL_1                                              (0x2U << PWR_DBGSMPS_TESTKEL_Pos)
#define PWR_DBGSMPS_TESTDIG_Pos                                            (0UL)    /*!<PWR DBGSMPS: TESTDIG (Bit 0) */
#define PWR_DBGSMPS_TESTDIG_Msk                                            (0xfUL)    /*!< PWR DBGSMPS: TESTDIG (Bitfield-Mask: 0x0f) */
#define PWR_DBGSMPS_TESTDIG                                                PWR_DBGSMPS_TESTDIG_Msk
#define PWR_DBGSMPS_TESTDIG_0                                              (0x1U << PWR_DBGSMPS_TESTDIG_Pos)
#define PWR_DBGSMPS_TESTDIG_1                                              (0x2U << PWR_DBGSMPS_TESTDIG_Pos)
#define PWR_DBGSMPS_TESTDIG_2                                              (0x4U << PWR_DBGSMPS_TESTDIG_Pos)
#define PWR_DBGSMPS_TESTDIG_3                                              (0x8U << PWR_DBGSMPS_TESTDIG_Pos)

/* =====================================================    TRIMR    ===================================================== */
#define PWR_TRIMR_RAM_SIZE_Pos                                             (12UL)   /*!<PWR TRIMR: RAM_SIZE (Bit 12) */
#define PWR_TRIMR_RAM_SIZE_Msk                                             (0x3000UL)   /*!< PWR TRIMR: RAM_SIZE (Bitfield-Mask: 0x03) */
#define PWR_TRIMR_RAM_SIZE                                                 PWR_TRIMR_RAM_SIZE_Msk
#define PWR_TRIMR_RAM_SIZE_0                                               (0x1U << PWR_TRIMR_RAM_SIZE_Pos)
#define PWR_TRIMR_RAM_SIZE_1                                               (0x2U << PWR_TRIMR_RAM_SIZE_Pos)
#define PWR_TRIMR_SMPS_TRIM_Pos                                            (8UL)    /*!<PWR TRIMR: SMPS_TRIM (Bit 8) */
#define PWR_TRIMR_SMPS_TRIM_Msk                                            (0x700UL)    /*!< PWR TRIMR: SMPS_TRIM (Bitfield-Mask: 0x07) */
#define PWR_TRIMR_SMPS_TRIM                                                PWR_TRIMR_SMPS_TRIM_Msk
#define PWR_TRIMR_SMPS_TRIM_0                                              (0x1U << PWR_TRIMR_SMPS_TRIM_Pos)
#define PWR_TRIMR_SMPS_TRIM_1                                              (0x2U << PWR_TRIMR_SMPS_TRIM_Pos)
#define PWR_TRIMR_SMPS_TRIM_2                                              (0x4U << PWR_TRIMR_SMPS_TRIM_Pos)
#define PWR_TRIMR_TRIM_MR_Pos                                              (4UL)    /*!<PWR TRIMR: TRIM_MR (Bit 4) */
#define PWR_TRIMR_TRIM_MR_Msk                                              (0xf0UL)   /*!< PWR TRIMR: TRIM_MR (Bitfield-Mask: 0x0f) */
#define PWR_TRIMR_TRIM_MR                                                  PWR_TRIMR_TRIM_MR_Msk
#define PWR_TRIMR_TRIM_MR_0                                                (0x1U << PWR_TRIMR_TRIM_MR_Pos)
#define PWR_TRIMR_TRIM_MR_1                                                (0x2U << PWR_TRIMR_TRIM_MR_Pos)
#define PWR_TRIMR_TRIM_MR_2                                                (0x4U << PWR_TRIMR_TRIM_MR_Pos)
#define PWR_TRIMR_TRIM_MR_3                                                (0x8U << PWR_TRIMR_TRIM_MR_Pos)
#define PWR_TRIMR_TRIM_LSI_LPMU_Pos                                        (0UL)    /*!<PWR TRIMR: TRIM_LSI_LPMU (Bit 0) */
#define PWR_TRIMR_TRIM_LSI_LPMU_Msk                                        (0xfUL)    /*!< PWR TRIMR: TRIM_LSI_LPMU (Bitfield-Mask: 0x0f) */
#define PWR_TRIMR_TRIM_LSI_LPMU                                            PWR_TRIMR_TRIM_LSI_LPMU_Msk
#define PWR_TRIMR_TRIM_LSI_LPMU_0                                          (0x1U << PWR_TRIMR_TRIM_LSI_LPMU_Pos)
#define PWR_TRIMR_TRIM_LSI_LPMU_1                                          (0x2U << PWR_TRIMR_TRIM_LSI_LPMU_Pos)
#define PWR_TRIMR_TRIM_LSI_LPMU_2                                          (0x4U << PWR_TRIMR_TRIM_LSI_LPMU_Pos)
#define PWR_TRIMR_TRIM_LSI_LPMU_3                                          (0x8U << PWR_TRIMR_TRIM_LSI_LPMU_Pos)

