stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* =====================================================    IO_DTR    ===================================================== */
#define SYSCFG_IO_DTR_PB15_DT_Pos                                          (31UL)   /*!<SYSCFG IO_DTR: PB15_DT (Bit 31) */
#define SYSCFG_IO_DTR_PB15_DT_Msk                                          (0x80000000UL)   /*!< SYSCFG IO_DTR: PB15_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PB15_DT                                              SYSCFG_IO_DTR_PB15_DT_Msk
#define SYSCFG_IO_DTR_PB14_DT_Pos                                          (30UL)   /*!<SYSCFG IO_DTR: PB14_DT (Bit 30) */
#define SYSCFG_IO_DTR_PB14_DT_Msk                                          (0x40000000UL)   /*!< SYSCFG IO_DTR: PB14_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PB14_DT                                              SYSCFG_IO_DTR_PB14_DT_Msk
#define SYSCFG_IO_DTR_PB13_DT_Pos                                          (29UL)   /*!<SYSCFG IO_DTR: PB13_DT (Bit 29) */
#define SYSCFG_IO_DTR_PB13_DT_Msk                                          (0x20000000UL)   /*!< SYSCFG IO_DTR: PB13_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PB13_DT                                              SYSCFG_IO_DTR_PB13_DT_Msk
#define SYSCFG_IO_DTR_PB12_DT_Pos                                          (28UL)   /*!<SYSCFG IO_DTR: PB12_DT (Bit 28) */
#define SYSCFG_IO_DTR_PB12_DT_Msk                                          (0x10000000UL)   /*!< SYSCFG IO_DTR: PB12_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PB12_DT                                              SYSCFG_IO_DTR_PB12_DT_Msk
#define SYSCFG_IO_DTR_PB11_DT_Pos                                          (27UL)   /*!<SYSCFG IO_DTR: PB11_DT (Bit 27) */
#define SYSCFG_IO_DTR_PB11_DT_Msk                                          (0x8000000UL)    /*!< SYSCFG IO_DTR: PB11_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PB11_DT                                              SYSCFG_IO_DTR_PB11_DT_Msk
#define SYSCFG_IO_DTR_PB10_DT_Pos                                          (26UL)   /*!<SYSCFG IO_DTR: PB10_DT (Bit 26) */
#define SYSCFG_IO_DTR_PB10_DT_Msk                                          (0x4000000UL)    /*!< SYSCFG IO_DTR: PB10_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PB10_DT                                              SYSCFG_IO_DTR_PB10_DT_Msk
#define SYSCFG_IO_DTR_PB9_DT_Pos                                           (25UL)   /*!<SYSCFG IO_DTR: PB9_DT (Bit 25) */
#define SYSCFG_IO_DTR_PB9_DT_Msk                                           (0x2000000UL)    /*!< SYSCFG IO_DTR: PB9_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PB9_DT                                               SYSCFG_IO_DTR_PB9_DT_Msk
#define SYSCFG_IO_DTR_PB8_DT_Pos                                           (24UL)   /*!<SYSCFG IO_DTR: PB8_DT (Bit 24) */
#define SYSCFG_IO_DTR_PB8_DT_Msk                                           (0x1000000UL)    /*!< SYSCFG IO_DTR: PB8_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PB8_DT                                               SYSCFG_IO_DTR_PB8_DT_Msk
#define SYSCFG_IO_DTR_PB7_DT_Pos                                           (23UL)   /*!<SYSCFG IO_DTR: PB7_DT (Bit 23) */
#define SYSCFG_IO_DTR_PB7_DT_Msk                                           (0x800000UL)   /*!< SYSCFG IO_DTR: PB7_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PB7_DT                                               SYSCFG_IO_DTR_PB7_DT_Msk
#define SYSCFG_IO_DTR_PB6_DT_Pos                                           (22UL)   /*!<SYSCFG IO_DTR: PB6_DT (Bit 22) */
#define SYSCFG_IO_DTR_PB6_DT_Msk                                           (0x400000UL)   /*!< SYSCFG IO_DTR: PB6_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PB6_DT                                               SYSCFG_IO_DTR_PB6_DT_Msk
#define SYSCFG_IO_DTR_PB5_DT_Pos                                           (21UL)   /*!<SYSCFG IO_DTR: PB5_DT (Bit 21) */
#define SYSCFG_IO_DTR_PB5_DT_Msk                                           (0x200000UL)   /*!< SYSCFG IO_DTR: PB5_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PB5_DT                                               SYSCFG_IO_DTR_PB5_DT_Msk
#define SYSCFG_IO_DTR_PB4_DT_Pos                                           (20UL)   /*!<SYSCFG IO_DTR: PB4_DT (Bit 20) */
#define SYSCFG_IO_DTR_PB4_DT_Msk                                           (0x100000UL)   /*!< SYSCFG IO_DTR: PB4_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PB4_DT                                               SYSCFG_IO_DTR_PB4_DT_Msk
#define SYSCFG_IO_DTR_PB3_DT_Pos                                           (19UL)   /*!<SYSCFG IO_DTR: PB3_DT (Bit 19) */
#define SYSCFG_IO_DTR_PB3_DT_Msk                                           (0x80000UL)    /*!< SYSCFG IO_DTR: PB3_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PB3_DT                                               SYSCFG_IO_DTR_PB3_DT_Msk
#define SYSCFG_IO_DTR_PB2_DT_Pos                                           (18UL)   /*!<SYSCFG IO_DTR: PB2_DT (Bit 18) */
#define SYSCFG_IO_DTR_PB2_DT_Msk                                           (0x40000UL)    /*!< SYSCFG IO_DTR: PB2_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PB2_DT                                               SYSCFG_IO_DTR_PB2_DT_Msk
#define SYSCFG_IO_DTR_PB1_DT_Pos                                           (17UL)   /*!<SYSCFG IO_DTR: PB1_DT (Bit 17) */
#define SYSCFG_IO_DTR_PB1_DT_Msk                                           (0x20000UL)    /*!< SYSCFG IO_DTR: PB1_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PB1_DT                                               SYSCFG_IO_DTR_PB1_DT_Msk
#define SYSCFG_IO_DTR_PB0_DT_Pos                                           (16UL)   /*!<SYSCFG IO_DTR: PB0_DT (Bit 16) */
#define SYSCFG_IO_DTR_PB0_DT_Msk                                           (0x10000UL)    /*!< SYSCFG IO_DTR: PB0_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PB0_DT                                               SYSCFG_IO_DTR_PB0_DT_Msk
#define SYSCFG_IO_DTR_PA15_DT_Pos                                          (15UL)   /*!<SYSCFG IO_DTR: PA15_DT (Bit 15) */
#define SYSCFG_IO_DTR_PA15_DT_Msk                                          (0x8000UL)   /*!< SYSCFG IO_DTR: PA15_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PA15_DT                                              SYSCFG_IO_DTR_PA15_DT_Msk
#define SYSCFG_IO_DTR_PA14_DT_Pos                                          (14UL)   /*!<SYSCFG IO_DTR: PA14_DT (Bit 14) */
#define SYSCFG_IO_DTR_PA14_DT_Msk                                          (0x4000UL)   /*!< SYSCFG IO_DTR: PA14_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PA14_DT                                              SYSCFG_IO_DTR_PA14_DT_Msk
#define SYSCFG_IO_DTR_PA13_DT_Pos                                          (13UL)   /*!<SYSCFG IO_DTR: PA13_DT (Bit 13) */
#define SYSCFG_IO_DTR_PA13_DT_Msk                                          (0x2000UL)   /*!< SYSCFG IO_DTR: PA13_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PA13_DT                                              SYSCFG_IO_DTR_PA13_DT_Msk
#define SYSCFG_IO_DTR_PA12_DT_Pos                                          (12UL)   /*!<SYSCFG IO_DTR: PA12_DT (Bit 12) */
#define SYSCFG_IO_DTR_PA12_DT_Msk                                          (0x1000UL)   /*!< SYSCFG IO_DTR: PA12_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PA12_DT                                              SYSCFG_IO_DTR_PA12_DT_Msk
#define SYSCFG_IO_DTR_PA11_DT_Pos                                          (11UL)   /*!<SYSCFG IO_DTR: PA11_DT (Bit 11) */
#define SYSCFG_IO_DTR_PA11_DT_Msk                                          (0x800UL)    /*!< SYSCFG IO_DTR: PA11_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PA11_DT                                              SYSCFG_IO_DTR_PA11_DT_Msk
#define SYSCFG_IO_DTR_PA10_DT_Pos                                          (10UL)   /*!<SYSCFG IO_DTR: PA10_DT (Bit 10) */
#define SYSCFG_IO_DTR_PA10_DT_Msk                                          (0x400UL)    /*!< SYSCFG IO_DTR: PA10_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PA10_DT                                              SYSCFG_IO_DTR_PA10_DT_Msk
#define SYSCFG_IO_DTR_PA9_DT_Pos                                           (9UL)    /*!<SYSCFG IO_DTR: PA9_DT (Bit 9) */
#define SYSCFG_IO_DTR_PA9_DT_Msk                                           (0x200UL)    /*!< SYSCFG IO_DTR: PA9_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PA9_DT                                               SYSCFG_IO_DTR_PA9_DT_Msk
#define SYSCFG_IO_DTR_PA8_DT_Pos                                           (8UL)    /*!<SYSCFG IO_DTR: PA8_DT (Bit 8) */
#define SYSCFG_IO_DTR_PA8_DT_Msk                                           (0x100UL)    /*!< SYSCFG IO_DTR: PA8_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PA8_DT                                               SYSCFG_IO_DTR_PA8_DT_Msk
#define SYSCFG_IO_DTR_PA7_DT_Pos                                           (7UL)    /*!<SYSCFG IO_DTR: PA7_DT (Bit 7) */
#define SYSCFG_IO_DTR_PA7_DT_Msk                                           (0x80UL)   /*!< SYSCFG IO_DTR: PA7_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PA7_DT                                               SYSCFG_IO_DTR_PA7_DT_Msk
#define SYSCFG_IO_DTR_PA6_DT_Pos                                           (6UL)    /*!<SYSCFG IO_DTR: PA6_DT (Bit 6) */
#define SYSCFG_IO_DTR_PA6_DT_Msk                                           (0x40UL)   /*!< SYSCFG IO_DTR: PA6_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PA6_DT                                               SYSCFG_IO_DTR_PA6_DT_Msk
#define SYSCFG_IO_DTR_PA5_DT_Pos                                           (5UL)    /*!<SYSCFG IO_DTR: PA5_DT (Bit 5) */
#define SYSCFG_IO_DTR_PA5_DT_Msk                                           (0x20UL)   /*!< SYSCFG IO_DTR: PA5_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PA5_DT                                               SYSCFG_IO_DTR_PA5_DT_Msk
#define SYSCFG_IO_DTR_PA4_DT_Pos                                           (4UL)    /*!<SYSCFG IO_DTR: PA4_DT (Bit 4) */
#define SYSCFG_IO_DTR_PA4_DT_Msk                                           (0x10UL)   /*!< SYSCFG IO_DTR: PA4_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PA4_DT                                               SYSCFG_IO_DTR_PA4_DT_Msk
#define SYSCFG_IO_DTR_PA3_DT_Pos                                           (3UL)    /*!<SYSCFG IO_DTR: PA3_DT (Bit 3) */
#define SYSCFG_IO_DTR_PA3_DT_Msk                                           (0x8UL)    /*!< SYSCFG IO_DTR: PA3_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PA3_DT                                               SYSCFG_IO_DTR_PA3_DT_Msk
#define SYSCFG_IO_DTR_PA2_DT_Pos                                           (2UL)    /*!<SYSCFG IO_DTR: PA2_DT (Bit 2) */
#define SYSCFG_IO_DTR_PA2_DT_Msk                                           (0x4UL)    /*!< SYSCFG IO_DTR: PA2_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PA2_DT                                               SYSCFG_IO_DTR_PA2_DT_Msk
#define SYSCFG_IO_DTR_PA1_DT_Pos                                           (1UL)    /*!<SYSCFG IO_DTR: PA1_DT (Bit 1) */
#define SYSCFG_IO_DTR_PA1_DT_Msk                                           (0x2UL)    /*!< SYSCFG IO_DTR: PA1_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PA1_DT                                               SYSCFG_IO_DTR_PA1_DT_Msk
#define SYSCFG_IO_DTR_PA0_DT_Pos                                           (0UL)    /*!<SYSCFG IO_DTR: PA0_DT (Bit 0) */
#define SYSCFG_IO_DTR_PA0_DT_Msk                                           (0x1UL)    /*!< SYSCFG IO_DTR: PA0_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_DTR_PA0_DT                                               SYSCFG_IO_DTR_PA0_DT_Msk

/* =====================================================    IO_IBER    ===================================================== */
#define SYSCFG_IO_IBER_PB15_IBE_Pos                                        (31UL)   /*!<SYSCFG IO_IBER: PB15_IBE (Bit 31) */
#define SYSCFG_IO_IBER_PB15_IBE_Msk                                        (0x80000000UL)   /*!< SYSCFG IO_IBER: PB15_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB15_IBE                                            SYSCFG_IO_IBER_PB15_IBE_Msk
#define SYSCFG_IO_IBER_PB14_IBE_Pos                                        (30UL)   /*!<SYSCFG IO_IBER: PB14_IBE (Bit 30) */
#define SYSCFG_IO_IBER_PB14_IBE_Msk                                        (0x40000000UL)   /*!< SYSCFG IO_IBER: PB14_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB14_IBE                                            SYSCFG_IO_IBER_PB14_IBE_Msk
#define SYSCFG_IO_IBER_PB13_IBE_Pos                                        (29UL)   /*!<SYSCFG IO_IBER: PB13_IBE (Bit 29) */
#define SYSCFG_IO_IBER_PB13_IBE_Msk                                        (0x20000000UL)   /*!< SYSCFG IO_IBER: PB13_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB13_IBE                                            SYSCFG_IO_IBER_PB13_IBE_Msk
#define SYSCFG_IO_IBER_PB12_IBE_Pos                                        (28UL)   /*!<SYSCFG IO_IBER: PB12_IBE (Bit 28) */
#define SYSCFG_IO_IBER_PB12_IBE_Msk                                        (0x10000000UL)   /*!< SYSCFG IO_IBER: PB12_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB12_IBE                                            SYSCFG_IO_IBER_PB12_IBE_Msk
#define SYSCFG_IO_IBER_PB11_IBE_Pos                                        (27UL)   /*!<SYSCFG IO_IBER: PB11_IBE (Bit 27) */
#define SYSCFG_IO_IBER_PB11_IBE_Msk                                        (0x8000000UL)    /*!< SYSCFG IO_IBER: PB11_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB11_IBE                                            SYSCFG_IO_IBER_PB11_IBE_Msk
#define SYSCFG_IO_IBER_PB10_IBE_Pos                                        (26UL)   /*!<SYSCFG IO_IBER: PB10_IBE (Bit 26) */
#define SYSCFG_IO_IBER_PB10_IBE_Msk                                        (0x4000000UL)    /*!< SYSCFG IO_IBER: PB10_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB10_IBE                                            SYSCFG_IO_IBER_PB10_IBE_Msk
#define SYSCFG_IO_IBER_PB9_IBE_Pos                                         (25UL)   /*!<SYSCFG IO_IBER: PB9_IBE (Bit 25) */
#define SYSCFG_IO_IBER_PB9_IBE_Msk                                         (0x2000000UL)    /*!< SYSCFG IO_IBER: PB9_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB9_IBE                                             SYSCFG_IO_IBER_PB9_IBE_Msk
#define SYSCFG_IO_IBER_PB8_IBE_Pos                                         (24UL)   /*!<SYSCFG IO_IBER: PB8_IBE (Bit 24) */
#define SYSCFG_IO_IBER_PB8_IBE_Msk                                         (0x1000000UL)    /*!< SYSCFG IO_IBER: PB8_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB8_IBE                                             SYSCFG_IO_IBER_PB8_IBE_Msk
#define SYSCFG_IO_IBER_PB7_IBE_Pos                                         (23UL)   /*!<SYSCFG IO_IBER: PB7_IBE (Bit 23) */
#define SYSCFG_IO_IBER_PB7_IBE_Msk                                         (0x800000UL)   /*!< SYSCFG IO_IBER: PB7_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB7_IBE                                             SYSCFG_IO_IBER_PB7_IBE_Msk
#define SYSCFG_IO_IBER_PB6_IBE_Pos                                         (22UL)   /*!<SYSCFG IO_IBER: PB6_IBE (Bit 22) */
#define SYSCFG_IO_IBER_PB6_IBE_Msk                                         (0x400000UL)   /*!< SYSCFG IO_IBER: PB6_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB6_IBE                                             SYSCFG_IO_IBER_PB6_IBE_Msk
#define SYSCFG_IO_IBER_PB5_IBE_Pos                                         (21UL)   /*!<SYSCFG IO_IBER: PB5_IBE (Bit 21) */
#define SYSCFG_IO_IBER_PB5_IBE_Msk                                         (0x200000UL)   /*!< SYSCFG IO_IBER: PB5_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB5_IBE                                             SYSCFG_IO_IBER_PB5_IBE_Msk
#define SYSCFG_IO_IBER_PB4_IBE_Pos                                         (20UL)   /*!<SYSCFG IO_IBER: PB4_IBE (Bit 20) */
#define SYSCFG_IO_IBER_PB4_IBE_Msk                                         (0x100000UL)   /*!< SYSCFG IO_IBER: PB4_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB4_IBE                                             SYSCFG_IO_IBER_PB4_IBE_Msk
#define SYSCFG_IO_IBER_PB3_IBE_Pos                                         (19UL)   /*!<SYSCFG IO_IBER: PB3_IBE (Bit 19) */
#define SYSCFG_IO_IBER_PB3_IBE_Msk                                         (0x80000UL)    /*!< SYSCFG IO_IBER: PB3_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB3_IBE                                             SYSCFG_IO_IBER_PB3_IBE_Msk
#define SYSCFG_IO_IBER_PB2_IBE_Pos                                         (18UL)   /*!<SYSCFG IO_IBER: PB2_IBE (Bit 18) */
#define SYSCFG_IO_IBER_PB2_IBE_Msk                                         (0x40000UL)    /*!< SYSCFG IO_IBER: PB2_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB2_IBE                                             SYSCFG_IO_IBER_PB2_IBE_Msk
#define SYSCFG_IO_IBER_PB1_IBE_Pos                                         (17UL)   /*!<SYSCFG IO_IBER: PB1_IBE (Bit 17) */
#define SYSCFG_IO_IBER_PB1_IBE_Msk                                         (0x20000UL)    /*!< SYSCFG IO_IBER: PB1_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB1_IBE                                             SYSCFG_IO_IBER_PB1_IBE_Msk
#define SYSCFG_IO_IBER_PB0_IBE_Pos                                         (16UL)   /*!<SYSCFG IO_IBER: PB0_IBE (Bit 16) */
#define SYSCFG_IO_IBER_PB0_IBE_Msk                                         (0x10000UL)    /*!< SYSCFG IO_IBER: PB0_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PB0_IBE                                             SYSCFG_IO_IBER_PB0_IBE_Msk
#define SYSCFG_IO_IBER_PA15_IBE_Pos                                        (15UL)   /*!<SYSCFG IO_IBER: PA15_IBE (Bit 15) */
#define SYSCFG_IO_IBER_PA15_IBE_Msk                                        (0x8000UL)   /*!< SYSCFG IO_IBER: PA15_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA15_IBE                                            SYSCFG_IO_IBER_PA15_IBE_Msk
#define SYSCFG_IO_IBER_PA14_IBE_Pos                                        (14UL)   /*!<SYSCFG IO_IBER: PA14_IBE (Bit 14) */
#define SYSCFG_IO_IBER_PA14_IBE_Msk                                        (0x4000UL)   /*!< SYSCFG IO_IBER: PA14_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA14_IBE                                            SYSCFG_IO_IBER_PA14_IBE_Msk
#define SYSCFG_IO_IBER_PA13_IBE_Pos                                        (13UL)   /*!<SYSCFG IO_IBER: PA13_IBE (Bit 13) */
#define SYSCFG_IO_IBER_PA13_IBE_Msk                                        (0x2000UL)   /*!< SYSCFG IO_IBER: PA13_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA13_IBE                                            SYSCFG_IO_IBER_PA13_IBE_Msk
#define SYSCFG_IO_IBER_PA12_IBE_Pos                                        (12UL)   /*!<SYSCFG IO_IBER: PA12_IBE (Bit 12) */
#define SYSCFG_IO_IBER_PA12_IBE_Msk                                        (0x1000UL)   /*!< SYSCFG IO_IBER: PA12_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA12_IBE                                            SYSCFG_IO_IBER_PA12_IBE_Msk
#define SYSCFG_IO_IBER_PA11_IBE_Pos                                        (11UL)   /*!<SYSCFG IO_IBER: PA11_IBE (Bit 11) */
#define SYSCFG_IO_IBER_PA11_IBE_Msk                                        (0x800UL)    /*!< SYSCFG IO_IBER: PA11_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA11_IBE                                            SYSCFG_IO_IBER_PA11_IBE_Msk
#define SYSCFG_IO_IBER_PA10_IBE_Pos                                        (10UL)   /*!<SYSCFG IO_IBER: PA10_IBE (Bit 10) */
#define SYSCFG_IO_IBER_PA10_IBE_Msk                                        (0x400UL)    /*!< SYSCFG IO_IBER: PA10_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA10_IBE                                            SYSCFG_IO_IBER_PA10_IBE_Msk
#define SYSCFG_IO_IBER_PA9_IBE_Pos                                         (9UL)    /*!<SYSCFG IO_IBER: PA9_IBE (Bit 9) */
#define SYSCFG_IO_IBER_PA9_IBE_Msk                                         (0x200UL)    /*!< SYSCFG IO_IBER: PA9_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA9_IBE                                             SYSCFG_IO_IBER_PA9_IBE_Msk
#define SYSCFG_IO_IBER_PA8_IBE_Pos                                         (8UL)    /*!<SYSCFG IO_IBER: PA8_IBE (Bit 8) */
#define SYSCFG_IO_IBER_PA8_IBE_Msk                                         (0x100UL)    /*!< SYSCFG IO_IBER: PA8_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA8_IBE                                             SYSCFG_IO_IBER_PA8_IBE_Msk
#define SYSCFG_IO_IBER_PA7_IBE_Pos                                         (7UL)    /*!<SYSCFG IO_IBER: PA7_IBE (Bit 7) */
#define SYSCFG_IO_IBER_PA7_IBE_Msk                                         (0x80UL)   /*!< SYSCFG IO_IBER: PA7_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA7_IBE                                             SYSCFG_IO_IBER_PA7_IBE_Msk
#define SYSCFG_IO_IBER_PA6_IBE_Pos                                         (6UL)    /*!<SYSCFG IO_IBER: PA6_IBE (Bit 6) */
#define SYSCFG_IO_IBER_PA6_IBE_Msk                                         (0x40UL)   /*!< SYSCFG IO_IBER: PA6_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA6_IBE                                             SYSCFG_IO_IBER_PA6_IBE_Msk
#define SYSCFG_IO_IBER_PA5_IBE_Pos                                         (5UL)    /*!<SYSCFG IO_IBER: PA5_IBE (Bit 5) */
#define SYSCFG_IO_IBER_PA5_IBE_Msk                                         (0x20UL)   /*!< SYSCFG IO_IBER: PA5_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA5_IBE                                             SYSCFG_IO_IBER_PA5_IBE_Msk
#define SYSCFG_IO_IBER_PA4_IBE_Pos                                         (4UL)    /*!<SYSCFG IO_IBER: PA4_IBE (Bit 4) */
#define SYSCFG_IO_IBER_PA4_IBE_Msk                                         (0x10UL)   /*!< SYSCFG IO_IBER: PA4_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA4_IBE                                             SYSCFG_IO_IBER_PA4_IBE_Msk
#define SYSCFG_IO_IBER_PA3_IBE_Pos                                         (3UL)    /*!<SYSCFG IO_IBER: PA3_IBE (Bit 3) */
#define SYSCFG_IO_IBER_PA3_IBE_Msk                                         (0x8UL)    /*!< SYSCFG IO_IBER: PA3_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA3_IBE                                             SYSCFG_IO_IBER_PA3_IBE_Msk
#define SYSCFG_IO_IBER_PA2_IBE_Pos                                         (2UL)    /*!<SYSCFG IO_IBER: PA2_IBE (Bit 2) */
#define SYSCFG_IO_IBER_PA2_IBE_Msk                                         (0x4UL)    /*!< SYSCFG IO_IBER: PA2_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA2_IBE                                             SYSCFG_IO_IBER_PA2_IBE_Msk
#define SYSCFG_IO_IBER_PA1_IBE_Pos                                         (1UL)    /*!<SYSCFG IO_IBER: PA1_IBE (Bit 1) */
#define SYSCFG_IO_IBER_PA1_IBE_Msk                                         (0x2UL)    /*!< SYSCFG IO_IBER: PA1_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA1_IBE                                             SYSCFG_IO_IBER_PA1_IBE_Msk
#define SYSCFG_IO_IBER_PA0_IBE_Pos                                         (0UL)    /*!<SYSCFG IO_IBER: PA0_IBE (Bit 0) */
#define SYSCFG_IO_IBER_PA0_IBE_Msk                                         (0x1UL)    /*!< SYSCFG IO_IBER: PA0_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_IBER_PA0_IBE                                             SYSCFG_IO_IBER_PA0_IBE_Msk

