stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* =====================================================    IO_ISCR    ===================================================== */
#define SYSCFG_IO_ISCR_PB15_ISC_Pos                                        (31UL)   /*!<SYSCFG IO_ISCR: PB15_ISC (Bit 31) */
#define SYSCFG_IO_ISCR_PB15_ISC_Msk                                        (0x80000000UL)   /*!< SYSCFG IO_ISCR: PB15_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PB15_ISC                                            SYSCFG_IO_ISCR_PB15_ISC_Msk
#define SYSCFG_IO_ISCR_PB14_ISC_Pos                                        (30UL)   /*!<SYSCFG IO_ISCR: PB14_ISC (Bit 30) */
#define SYSCFG_IO_ISCR_PB14_ISC_Msk                                        (0x40000000UL)   /*!< SYSCFG IO_ISCR: PB14_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PB14_ISC                                            SYSCFG_IO_ISCR_PB14_ISC_Msk
#define SYSCFG_IO_ISCR_PB13_ISC_Pos                                        (29UL)   /*!<SYSCFG IO_ISCR: PB13_ISC (Bit 29) */
#define SYSCFG_IO_ISCR_PB13_ISC_Msk                                        (0x20000000UL)   /*!< SYSCFG IO_ISCR: PB13_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PB13_ISC                                            SYSCFG_IO_ISCR_PB13_ISC_Msk
#define SYSCFG_IO_ISCR_PB12_ISC_Pos                                        (28UL)   /*!<SYSCFG IO_ISCR: PB12_ISC (Bit 28) */
#define SYSCFG_IO_ISCR_PB12_ISC_Msk                                        (0x10000000UL)   /*!< SYSCFG IO_ISCR: PB12_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PB12_ISC                                            SYSCFG_IO_ISCR_PB12_ISC_Msk
#define SYSCFG_IO_ISCR_PB11_ISC_Pos                                        (27UL)   /*!<SYSCFG IO_ISCR: PB11_ISC (Bit 27) */
#define SYSCFG_IO_ISCR_PB11_ISC_Msk                                        (0x8000000UL)    /*!< SYSCFG IO_ISCR: PB11_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PB11_ISC                                            SYSCFG_IO_ISCR_PB11_ISC_Msk
#define SYSCFG_IO_ISCR_PB10_ISC_Pos                                        (26UL)   /*!<SYSCFG IO_ISCR: PB10_ISC (Bit 26) */
#define SYSCFG_IO_ISCR_PB10_ISC_Msk                                        (0x4000000UL)    /*!< SYSCFG IO_ISCR: PB10_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PB10_ISC                                            SYSCFG_IO_ISCR_PB10_ISC_Msk
#define SYSCFG_IO_ISCR_PB9_ISC_Pos                                         (25UL)   /*!<SYSCFG IO_ISCR: PB9_ISC (Bit 25) */
#define SYSCFG_IO_ISCR_PB9_ISC_Msk                                         (0x2000000UL)    /*!< SYSCFG IO_ISCR: PB9_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PB9_ISC                                             SYSCFG_IO_ISCR_PB9_ISC_Msk
#define SYSCFG_IO_ISCR_PB8_ISC_Pos                                         (24UL)   /*!<SYSCFG IO_ISCR: PB8_ISC (Bit 24) */
#define SYSCFG_IO_ISCR_PB8_ISC_Msk                                         (0x1000000UL)    /*!< SYSCFG IO_ISCR: PB8_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PB8_ISC                                             SYSCFG_IO_ISCR_PB8_ISC_Msk
#define SYSCFG_IO_ISCR_PB7_ISC_Pos                                         (23UL)   /*!<SYSCFG IO_ISCR: PB7_ISC (Bit 23) */
#define SYSCFG_IO_ISCR_PB7_ISC_Msk                                         (0x800000UL)   /*!< SYSCFG IO_ISCR: PB7_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PB7_ISC                                             SYSCFG_IO_ISCR_PB7_ISC_Msk
#define SYSCFG_IO_ISCR_PB6_ISC_Pos                                         (22UL)   /*!<SYSCFG IO_ISCR: PB6_ISC (Bit 22) */
#define SYSCFG_IO_ISCR_PB6_ISC_Msk                                         (0x400000UL)   /*!< SYSCFG IO_ISCR: PB6_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PB6_ISC                                             SYSCFG_IO_ISCR_PB6_ISC_Msk
#define SYSCFG_IO_ISCR_PB5_ISC_Pos                                         (21UL)   /*!<SYSCFG IO_ISCR: PB5_ISC (Bit 21) */
#define SYSCFG_IO_ISCR_PB5_ISC_Msk                                         (0x200000UL)   /*!< SYSCFG IO_ISCR: PB5_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PB5_ISC                                             SYSCFG_IO_ISCR_PB5_ISC_Msk
#define SYSCFG_IO_ISCR_PB4_ISC_Pos                                         (20UL)   /*!<SYSCFG IO_ISCR: PB4_ISC (Bit 20) */
#define SYSCFG_IO_ISCR_PB4_ISC_Msk                                         (0x100000UL)   /*!< SYSCFG IO_ISCR: PB4_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PB4_ISC                                             SYSCFG_IO_ISCR_PB4_ISC_Msk
#define SYSCFG_IO_ISCR_PB3_ISC_Pos                                         (19UL)   /*!<SYSCFG IO_ISCR: PB3_ISC (Bit 19) */
#define SYSCFG_IO_ISCR_PB3_ISC_Msk                                         (0x80000UL)    /*!< SYSCFG IO_ISCR: PB3_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PB3_ISC                                             SYSCFG_IO_ISCR_PB3_ISC_Msk
#define SYSCFG_IO_ISCR_PB2_ISC_Pos                                         (18UL)   /*!<SYSCFG IO_ISCR: PB2_ISC (Bit 18) */
#define SYSCFG_IO_ISCR_PB2_ISC_Msk                                         (0x40000UL)    /*!< SYSCFG IO_ISCR: PB2_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PB2_ISC                                             SYSCFG_IO_ISCR_PB2_ISC_Msk
#define SYSCFG_IO_ISCR_PB1_ISC_Pos                                         (17UL)   /*!<SYSCFG IO_ISCR: PB1_ISC (Bit 17) */
#define SYSCFG_IO_ISCR_PB1_ISC_Msk                                         (0x20000UL)    /*!< SYSCFG IO_ISCR: PB1_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PB1_ISC                                             SYSCFG_IO_ISCR_PB1_ISC_Msk
#define SYSCFG_IO_ISCR_PB0_ISC_Pos                                         (16UL)   /*!<SYSCFG IO_ISCR: PB0_ISC (Bit 16) */
#define SYSCFG_IO_ISCR_PB0_ISC_Msk                                         (0x10000UL)    /*!< SYSCFG IO_ISCR: PB0_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PB0_ISC                                             SYSCFG_IO_ISCR_PB0_ISC_Msk
#define SYSCFG_IO_ISCR_PA15_ISC_Pos                                        (15UL)   /*!<SYSCFG IO_ISCR: PA15_ISC (Bit 15) */
#define SYSCFG_IO_ISCR_PA15_ISC_Msk                                        (0x8000UL)   /*!< SYSCFG IO_ISCR: PA15_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PA15_ISC                                            SYSCFG_IO_ISCR_PA15_ISC_Msk
#define SYSCFG_IO_ISCR_PA14_ISC_Pos                                        (14UL)   /*!<SYSCFG IO_ISCR: PA14_ISC (Bit 14) */
#define SYSCFG_IO_ISCR_PA14_ISC_Msk                                        (0x4000UL)   /*!< SYSCFG IO_ISCR: PA14_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PA14_ISC                                            SYSCFG_IO_ISCR_PA14_ISC_Msk
#define SYSCFG_IO_ISCR_PA13_ISC_Pos                                        (13UL)   /*!<SYSCFG IO_ISCR: PA13_ISC (Bit 13) */
#define SYSCFG_IO_ISCR_PA13_ISC_Msk                                        (0x2000UL)   /*!< SYSCFG IO_ISCR: PA13_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PA13_ISC                                            SYSCFG_IO_ISCR_PA13_ISC_Msk
#define SYSCFG_IO_ISCR_PA12_ISC_Pos                                        (12UL)   /*!<SYSCFG IO_ISCR: PA12_ISC (Bit 12) */
#define SYSCFG_IO_ISCR_PA12_ISC_Msk                                        (0x1000UL)   /*!< SYSCFG IO_ISCR: PA12_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PA12_ISC                                            SYSCFG_IO_ISCR_PA12_ISC_Msk
#define SYSCFG_IO_ISCR_PA11_ISC_Pos                                        (11UL)   /*!<SYSCFG IO_ISCR: PA11_ISC (Bit 11) */
#define SYSCFG_IO_ISCR_PA11_ISC_Msk                                        (0x800UL)    /*!< SYSCFG IO_ISCR: PA11_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PA11_ISC                                            SYSCFG_IO_ISCR_PA11_ISC_Msk
#define SYSCFG_IO_ISCR_PA10_ISC_Pos                                        (10UL)   /*!<SYSCFG IO_ISCR: PA10_ISC (Bit 10) */
#define SYSCFG_IO_ISCR_PA10_ISC_Msk                                        (0x400UL)    /*!< SYSCFG IO_ISCR: PA10_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PA10_ISC                                            SYSCFG_IO_ISCR_PA10_ISC_Msk
#define SYSCFG_IO_ISCR_PA9_ISC_Pos                                         (9UL)    /*!<SYSCFG IO_ISCR: PA9_ISC (Bit 9) */
#define SYSCFG_IO_ISCR_PA9_ISC_Msk                                         (0x200UL)    /*!< SYSCFG IO_ISCR: PA9_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PA9_ISC                                             SYSCFG_IO_ISCR_PA9_ISC_Msk
#define SYSCFG_IO_ISCR_PA8_ISC_Pos                                         (8UL)    /*!<SYSCFG IO_ISCR: PA8_ISC (Bit 8) */
#define SYSCFG_IO_ISCR_PA8_ISC_Msk                                         (0x100UL)    /*!< SYSCFG IO_ISCR: PA8_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PA8_ISC                                             SYSCFG_IO_ISCR_PA8_ISC_Msk
#define SYSCFG_IO_ISCR_PA7_ISC_Pos                                         (7UL)    /*!<SYSCFG IO_ISCR: PA7_ISC (Bit 7) */
#define SYSCFG_IO_ISCR_PA7_ISC_Msk                                         (0x80UL)   /*!< SYSCFG IO_ISCR: PA7_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PA7_ISC                                             SYSCFG_IO_ISCR_PA7_ISC_Msk
#define SYSCFG_IO_ISCR_PA6_ISC_Pos                                         (6UL)    /*!<SYSCFG IO_ISCR: PA6_ISC (Bit 6) */
#define SYSCFG_IO_ISCR_PA6_ISC_Msk                                         (0x40UL)   /*!< SYSCFG IO_ISCR: PA6_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PA6_ISC                                             SYSCFG_IO_ISCR_PA6_ISC_Msk
#define SYSCFG_IO_ISCR_PA5_ISC_Pos                                         (5UL)    /*!<SYSCFG IO_ISCR: PA5_ISC (Bit 5) */
#define SYSCFG_IO_ISCR_PA5_ISC_Msk                                         (0x20UL)   /*!< SYSCFG IO_ISCR: PA5_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PA5_ISC                                             SYSCFG_IO_ISCR_PA5_ISC_Msk
#define SYSCFG_IO_ISCR_PA4_ISC_Pos                                         (4UL)    /*!<SYSCFG IO_ISCR: PA4_ISC (Bit 4) */
#define SYSCFG_IO_ISCR_PA4_ISC_Msk                                         (0x10UL)   /*!< SYSCFG IO_ISCR: PA4_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PA4_ISC                                             SYSCFG_IO_ISCR_PA4_ISC_Msk
#define SYSCFG_IO_ISCR_PA3_ISC_Pos                                         (3UL)    /*!<SYSCFG IO_ISCR: PA3_ISC (Bit 3) */
#define SYSCFG_IO_ISCR_PA3_ISC_Msk                                         (0x8UL)    /*!< SYSCFG IO_ISCR: PA3_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PA3_ISC                                             SYSCFG_IO_ISCR_PA3_ISC_Msk
#define SYSCFG_IO_ISCR_PA2_ISC_Pos                                         (2UL)    /*!<SYSCFG IO_ISCR: PA2_ISC (Bit 2) */
#define SYSCFG_IO_ISCR_PA2_ISC_Msk                                         (0x4UL)    /*!< SYSCFG IO_ISCR: PA2_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PA2_ISC                                             SYSCFG_IO_ISCR_PA2_ISC_Msk
#define SYSCFG_IO_ISCR_PA1_ISC_Pos                                         (1UL)    /*!<SYSCFG IO_ISCR: PA1_ISC (Bit 1) */
#define SYSCFG_IO_ISCR_PA1_ISC_Msk                                         (0x2UL)    /*!< SYSCFG IO_ISCR: PA1_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PA1_ISC                                             SYSCFG_IO_ISCR_PA1_ISC_Msk
#define SYSCFG_IO_ISCR_PA0_ISC_Pos                                         (0UL)    /*!<SYSCFG IO_ISCR: PA0_ISC (Bit 0) */
#define SYSCFG_IO_ISCR_PA0_ISC_Msk                                         (0x1UL)    /*!< SYSCFG IO_ISCR: PA0_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_IO_ISCR_PA0_ISC                                             SYSCFG_IO_ISCR_PA0_ISC_Msk

/* =====================================================    PWRC_IER    ===================================================== */
#define SYSCFG_PWRC_IER_WKUP_IE_Pos                                        (2UL)    /*!<SYSCFG PWRC_IER: WKUP_IE (Bit 2) */
#define SYSCFG_PWRC_IER_WKUP_IE_Msk                                        (0x4UL)    /*!< SYSCFG PWRC_IER: WKUP_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_PWRC_IER_WKUP_IE                                            SYSCFG_PWRC_IER_WKUP_IE_Msk
#define SYSCFG_PWRC_IER_PVD_IE_Pos                                         (1UL)    /*!<SYSCFG PWRC_IER: PVD_IE (Bit 1) */
#define SYSCFG_PWRC_IER_PVD_IE_Msk                                         (0x2UL)    /*!< SYSCFG PWRC_IER: PVD_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_PWRC_IER_PVD_IE                                             SYSCFG_PWRC_IER_PVD_IE_Msk

