stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* =====================================================    PWRC_ISCR    ===================================================== */
#define SYSCFG_PWRC_ISCR_WKUP_ISC_Pos                                      (2UL)    /*!<SYSCFG PWRC_ISCR: WKUP_ISC (Bit 2) */
#define SYSCFG_PWRC_ISCR_WKUP_ISC_Msk                                      (0x4UL)    /*!< SYSCFG PWRC_ISCR: WKUP_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_PWRC_ISCR_WKUP_ISC                                          SYSCFG_PWRC_ISCR_WKUP_ISC_Msk
#define SYSCFG_PWRC_ISCR_PVD_ISC_Pos                                       (1UL)    /*!<SYSCFG PWRC_ISCR: PVD_ISC (Bit 1) */
#define SYSCFG_PWRC_ISCR_PVD_ISC_Msk                                       (0x2UL)    /*!< SYSCFG PWRC_ISCR: PVD_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_PWRC_ISCR_PVD_ISC                                           SYSCFG_PWRC_ISCR_PVD_ISC_Msk

/* =====================================================    BLERXTX_DTR    ===================================================== */
#define SYSCFG_BLERXTX_DTR_RX_DT_Pos                                       (1UL)    /*!<SYSCFG BLERXTX_DTR: RX_DT (Bit 1) */
#define SYSCFG_BLERXTX_DTR_RX_DT_Msk                                       (0x2UL)    /*!< SYSCFG BLERXTX_DTR: RX_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_DTR_RX_DT                                           SYSCFG_BLERXTX_DTR_RX_DT_Msk
#define SYSCFG_BLERXTX_DTR_TX_DT_Pos                                       (0UL)    /*!<SYSCFG BLERXTX_DTR: TX_DT (Bit 0) */
#define SYSCFG_BLERXTX_DTR_TX_DT_Msk                                       (0x1UL)    /*!< SYSCFG BLERXTX_DTR: TX_DT (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_DTR_TX_DT                                           SYSCFG_BLERXTX_DTR_TX_DT_Msk

/* =====================================================    BLERXTX_IBER    ===================================================== */
#define SYSCFG_BLERXTX_IBER_RX_IBE_Pos                                     (1UL)    /*!<SYSCFG BLERXTX_IBER: RX_IBE (Bit 1) */
#define SYSCFG_BLERXTX_IBER_RX_IBE_Msk                                     (0x2UL)    /*!< SYSCFG BLERXTX_IBER: RX_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_IBER_RX_IBE                                         SYSCFG_BLERXTX_IBER_RX_IBE_Msk
#define SYSCFG_BLERXTX_IBER_TX_IBE_Pos                                     (0UL)    /*!<SYSCFG BLERXTX_IBER: TX_IBE (Bit 0) */
#define SYSCFG_BLERXTX_IBER_TX_IBE_Msk                                     (0x1UL)    /*!< SYSCFG BLERXTX_IBER: TX_IBE (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_IBER_TX_IBE                                         SYSCFG_BLERXTX_IBER_TX_IBE_Msk

/* =====================================================    BLERXTX_IEVR    ===================================================== */
#define SYSCFG_BLERXTX_IEVR_RX_IEV_Pos                                     (1UL)    /*!<SYSCFG BLERXTX_IEVR: RX_IEV (Bit 1) */
#define SYSCFG_BLERXTX_IEVR_RX_IEV_Msk                                     (0x2UL)    /*!< SYSCFG BLERXTX_IEVR: RX_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_IEVR_RX_IEV                                         SYSCFG_BLERXTX_IEVR_RX_IEV_Msk
#define SYSCFG_BLERXTX_IEVR_TX_IEV_Pos                                     (0UL)    /*!<SYSCFG BLERXTX_IEVR: TX_IEV (Bit 0) */
#define SYSCFG_BLERXTX_IEVR_TX_IEV_Msk                                     (0x1UL)    /*!< SYSCFG BLERXTX_IEVR: TX_IEV (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_IEVR_TX_IEV                                         SYSCFG_BLERXTX_IEVR_TX_IEV_Msk

/* =====================================================    BLERXTX_IER    ===================================================== */
#define SYSCFG_BLERXTX_IER_RX_IE_Pos                                       (1UL)    /*!<SYSCFG BLERXTX_IER: RX_IE (Bit 1) */
#define SYSCFG_BLERXTX_IER_RX_IE_Msk                                       (0x2UL)    /*!< SYSCFG BLERXTX_IER: RX_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_IER_RX_IE                                           SYSCFG_BLERXTX_IER_RX_IE_Msk
#define SYSCFG_BLERXTX_IER_TX_IE_Pos                                       (0UL)    /*!<SYSCFG BLERXTX_IER: TX_IE (Bit 0) */
#define SYSCFG_BLERXTX_IER_TX_IE_Msk                                       (0x1UL)    /*!< SYSCFG BLERXTX_IER: TX_IE (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_IER_TX_IE                                           SYSCFG_BLERXTX_IER_TX_IE_Msk

/* =====================================================    BLERXTX_ISCR    ===================================================== */
#define SYSCFG_BLERXTX_ISCR_RX_ISC_Pos                                     (1UL)    /*!<SYSCFG BLERXTX_ISCR: RX_ISC (Bit 1) */
#define SYSCFG_BLERXTX_ISCR_RX_ISC_Msk                                     (0x2UL)    /*!< SYSCFG BLERXTX_ISCR: RX_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_ISCR_RX_ISC                                         SYSCFG_BLERXTX_ISCR_RX_ISC_Msk
#define SYSCFG_BLERXTX_ISCR_TX_ISC_Pos                                     (0UL)    /*!<SYSCFG BLERXTX_ISCR: TX_ISC (Bit 0) */
#define SYSCFG_BLERXTX_ISCR_TX_ISC_Msk                                     (0x1UL)    /*!< SYSCFG BLERXTX_ISCR: TX_ISC (Bitfield-Mask: 0x01) */
#define SYSCFG_BLERXTX_ISCR_TX_ISC                                         SYSCFG_BLERXTX_ISCR_TX_ISC_Msk


/* =========================================================================================================================== */
/*=====================                                       RNG                                       ===================== */
/* =========================================================================================================================== */

/* =====================================================    CR    ===================================================== */
#define RNG_CR_TST_CLK_Pos                                                 (3UL)    /*!<RNG CR: TST_CLK (Bit 3) */
#define RNG_CR_TST_CLK_Msk                                                 (0x8UL)    /*!< RNG CR: TST_CLK (Bitfield-Mask: 0x01) */
#define RNG_CR_TST_CLK                                                     RNG_CR_TST_CLK_Msk
#define RNG_CR_RNG_DIS_Pos                                                 (2UL)    /*!<RNG CR: RNG_DIS (Bit 2) */
#define RNG_CR_RNG_DIS_Msk                                                 (0x4UL)    /*!< RNG CR: RNG_DIS (Bitfield-Mask: 0x01) */
#define RNG_CR_RNG_DIS                                                     RNG_CR_RNG_DIS_Msk

/* =====================================================    SR    ===================================================== */
#define RNG_SR_FAULT_Pos                                                   (2UL)    /*!<RNG SR: FAULT (Bit 2) */
#define RNG_SR_FAULT_Msk                                                   (0x4UL)    /*!< RNG SR: FAULT (Bitfield-Mask: 0x01) */
#define RNG_SR_FAULT                                                       RNG_SR_FAULT_Msk
#define RNG_SR_REVCLK_Pos                                                  (1UL)    /*!<RNG SR: REVCLK (Bit 1) */
#define RNG_SR_REVCLK_Msk                                                  (0x2UL)    /*!< RNG SR: REVCLK (Bitfield-Mask: 0x01) */
#define RNG_SR_REVCLK                                                      RNG_SR_REVCLK_Msk
#define RNG_SR_RNGRDY_Pos                                                  (0UL)    /*!<RNG SR: RNGRDY (Bit 0) */
#define RNG_SR_RNGRDY_Msk                                                  (0x1UL)    /*!< RNG SR: RNGRDY (Bitfield-Mask: 0x01) */
#define RNG_SR_RNGRDY                                                      RNG_SR_RNGRDY_Msk

/* =====================================================    VAL    ===================================================== */
#define RNG_VAL_RANDOM_VALUE_Pos                                           (0UL)    /*!<RNG VAL: RANDOM_VALUE (Bit 0) */
#define RNG_VAL_RANDOM_VALUE_Msk                                           (0xffffUL)   /*!< RNG VAL: RANDOM_VALUE (Bitfield-Mask: 0xffff) */
#define RNG_VAL_RANDOM_VALUE                                               RNG_VAL_RANDOM_VALUE_Msk
#define RNG_VAL_RANDOM_VALUE_0                                             (0x1U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_1                                             (0x2U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_2                                             (0x4U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_3                                             (0x8U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_4                                             (0x10U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_5                                             (0x20U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_6                                             (0x40U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_7                                             (0x80U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_8                                             (0x100U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_9                                             (0x200U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_10                                            (0x400U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_11                                            (0x800U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_12                                            (0x1000U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_13                                            (0x2000U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_14                                            (0x4000U << RNG_VAL_RANDOM_VALUE_Pos)
#define RNG_VAL_RANDOM_VALUE_15                                            (0x8000U << RNG_VAL_RANDOM_VALUE_Pos)


/* =========================================================================================================================== */
/*=====================                                       GPIO                                       ===================== */
/* =========================================================================================================================== */

