stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* =====================================================    BDTR    ===================================================== */
#define TIM_BDTR_BK2P_Pos                                                  (25UL)   /*!<TIM BDTR: BK2P (Bit 25) */
#define TIM_BDTR_BK2P_Msk                                                  (0x2000000UL)    /*!< TIM BDTR: BK2P (Bitfield-Mask: 0x01) */
#define TIM_BDTR_BK2P                                                      TIM_BDTR_BK2P_Msk
#define TIM_BDTR_BK2E_Pos                                                  (24UL)   /*!<TIM BDTR: BK2E (Bit 24) */
#define TIM_BDTR_BK2E_Msk                                                  (0x1000000UL)    /*!< TIM BDTR: BK2E (Bitfield-Mask: 0x01) */
#define TIM_BDTR_BK2E                                                      TIM_BDTR_BK2E_Msk
#define TIM_BDTR_BK2F_Pos                                                  (20UL)   /*!<TIM BDTR: BK2F (Bit 20) */
#define TIM_BDTR_BK2F_Msk                                                  (0xf00000UL)   /*!< TIM BDTR: BK2F (Bitfield-Mask: 0x0f) */
#define TIM_BDTR_BK2F                                                      TIM_BDTR_BK2F_Msk
#define TIM_BDTR_BK2F_0                                                    (0x1U << TIM_BDTR_BK2F_Pos)
#define TIM_BDTR_BK2F_1                                                    (0x2U << TIM_BDTR_BK2F_Pos)
#define TIM_BDTR_BK2F_2                                                    (0x4U << TIM_BDTR_BK2F_Pos)
#define TIM_BDTR_BK2F_3                                                    (0x8U << TIM_BDTR_BK2F_Pos)
#define TIM_BDTR_BKF_Pos                                                   (16UL)   /*!<TIM BDTR: BKF (Bit 16) */
#define TIM_BDTR_BKF_Msk                                                   (0xf0000UL)    /*!< TIM BDTR: BKF (Bitfield-Mask: 0x0f) */
#define TIM_BDTR_BKF                                                       TIM_BDTR_BKF_Msk
#define TIM_BDTR_BKF_0                                                     (0x1U << TIM_BDTR_BKF_Pos)
#define TIM_BDTR_BKF_1                                                     (0x2U << TIM_BDTR_BKF_Pos)
#define TIM_BDTR_BKF_2                                                     (0x4U << TIM_BDTR_BKF_Pos)
#define TIM_BDTR_BKF_3                                                     (0x8U << TIM_BDTR_BKF_Pos)
#define TIM_BDTR_MOE_Pos                                                   (15UL)   /*!<TIM BDTR: MOE (Bit 15) */
#define TIM_BDTR_MOE_Msk                                                   (0x8000UL)   /*!< TIM BDTR: MOE (Bitfield-Mask: 0x01) */
#define TIM_BDTR_MOE                                                       TIM_BDTR_MOE_Msk
#define TIM_BDTR_AOE_Pos                                                   (14UL)   /*!<TIM BDTR: AOE (Bit 14) */
#define TIM_BDTR_AOE_Msk                                                   (0x4000UL)   /*!< TIM BDTR: AOE (Bitfield-Mask: 0x01) */
#define TIM_BDTR_AOE                                                       TIM_BDTR_AOE_Msk
#define TIM_BDTR_BKP_Pos                                                   (13UL)   /*!<TIM BDTR: BKP (Bit 13) */
#define TIM_BDTR_BKP_Msk                                                   (0x2000UL)   /*!< TIM BDTR: BKP (Bitfield-Mask: 0x01) */
#define TIM_BDTR_BKP                                                       TIM_BDTR_BKP_Msk
#define TIM_BDTR_BKE_Pos                                                   (12UL)   /*!<TIM BDTR: BKE (Bit 12) */
#define TIM_BDTR_BKE_Msk                                                   (0x1000UL)   /*!< TIM BDTR: BKE (Bitfield-Mask: 0x01) */
#define TIM_BDTR_BKE                                                       TIM_BDTR_BKE_Msk
#define TIM_BDTR_OSSR_Pos                                                  (11UL)   /*!<TIM BDTR: OSSR (Bit 11) */
#define TIM_BDTR_OSSR_Msk                                                  (0x800UL)    /*!< TIM BDTR: OSSR (Bitfield-Mask: 0x01) */
#define TIM_BDTR_OSSR                                                      TIM_BDTR_OSSR_Msk
#define TIM_BDTR_OSSI_Pos                                                  (10UL)   /*!<TIM BDTR: OSSI (Bit 10) */
#define TIM_BDTR_OSSI_Msk                                                  (0x400UL)    /*!< TIM BDTR: OSSI (Bitfield-Mask: 0x01) */
#define TIM_BDTR_OSSI                                                      TIM_BDTR_OSSI_Msk
#define TIM_BDTR_LOCK_Pos                                                  (8UL)    /*!<TIM BDTR: LOCK (Bit 8) */
#define TIM_BDTR_LOCK_Msk                                                  (0x300UL)    /*!< TIM BDTR: LOCK (Bitfield-Mask: 0x03) */
#define TIM_BDTR_LOCK                                                      TIM_BDTR_LOCK_Msk
#define TIM_BDTR_LOCK_0                                                    (0x1U << TIM_BDTR_LOCK_Pos)
#define TIM_BDTR_LOCK_1                                                    (0x2U << TIM_BDTR_LOCK_Pos)
#define TIM_BDTR_DTG_Pos                                                   (0UL)    /*!<TIM BDTR: DTG (Bit 0) */
#define TIM_BDTR_DTG_Msk                                                   (0xffUL)   /*!< TIM BDTR: DTG (Bitfield-Mask: 0xff) */
#define TIM_BDTR_DTG                                                       TIM_BDTR_DTG_Msk
#define TIM_BDTR_DTG_0                                                     (0x1U << TIM_BDTR_DTG_Pos)
#define TIM_BDTR_DTG_1                                                     (0x2U << TIM_BDTR_DTG_Pos)
#define TIM_BDTR_DTG_2                                                     (0x4U << TIM_BDTR_DTG_Pos)
#define TIM_BDTR_DTG_3                                                     (0x8U << TIM_BDTR_DTG_Pos)
#define TIM_BDTR_DTG_4                                                     (0x10U << TIM_BDTR_DTG_Pos)
#define TIM_BDTR_DTG_5                                                     (0x20U << TIM_BDTR_DTG_Pos)
#define TIM_BDTR_DTG_6                                                     (0x40U << TIM_BDTR_DTG_Pos)
#define TIM_BDTR_DTG_7                                                     (0x80U << TIM_BDTR_DTG_Pos)

/* =====================================================    CCMR3    ===================================================== */
#define TIM_CCMR3_OC6CE_Pos                                                (15UL)   /*!<TIM CCMR3: OC6CE (Bit 15) */
#define TIM_CCMR3_OC6CE_Msk                                                (0x8000UL)   /*!< TIM CCMR3: OC6CE (Bitfield-Mask: 0x01) */
#define TIM_CCMR3_OC6CE                                                    TIM_CCMR3_OC6CE_Msk
#define TIM_CCMR3_OC6M_Pos                                                 (12UL)   /*!<TIM CCMR3: OC6M (Bit 12) */
#define TIM_CCMR3_OC6M_Msk                                                 (0x1007000UL)    /*!< TIM CCMR3: OC6M (Bitfield-Mask: 0x1007) */
#define TIM_CCMR3_OC6M                                                     TIM_CCMR3_OC6M_Msk
#define TIM_CCMR3_OC6M_0                                                   (0x1U << TIM_CCMR3_OC6M_Pos)
#define TIM_CCMR3_OC6M_1                                                   (0x2U << TIM_CCMR3_OC6M_Pos)
#define TIM_CCMR3_OC6M_2                                                   (0x4U << TIM_CCMR3_OC6M_Pos)
#define TIM_CCMR3_OC6M_3                                                   (0x1000U << TIM_CCMR3_OC6M_Pos)
#define TIM_CCMR3_OC6PE_Pos                                                (11UL)   /*!<TIM CCMR3: OC6PE (Bit 11) */
#define TIM_CCMR3_OC6PE_Msk                                                (0x800UL)    /*!< TIM CCMR3: OC6PE (Bitfield-Mask: 0x01) */
#define TIM_CCMR3_OC6PE                                                    TIM_CCMR3_OC6PE_Msk
#define TIM_CCMR3_OC6FE_Pos                                                (10UL)   /*!<TIM CCMR3: OC6FE (Bit 10) */
#define TIM_CCMR3_OC6FE_Msk                                                (0x400UL)    /*!< TIM CCMR3: OC6FE (Bitfield-Mask: 0x01) */
#define TIM_CCMR3_OC6FE                                                    TIM_CCMR3_OC6FE_Msk
#define TIM_CCMR3_OC5CE_Pos                                                (7UL)    /*!<TIM CCMR3: OC5CE (Bit 7) */
#define TIM_CCMR3_OC5CE_Msk                                                (0x80UL)   /*!< TIM CCMR3: OC5CE (Bitfield-Mask: 0x01) */
#define TIM_CCMR3_OC5CE                                                    TIM_CCMR3_OC5CE_Msk
#define TIM_CCMR3_OC5M_Pos                                                 (4UL)    /*!<TIM CCMR3: OC5M (Bit 4) */
#define TIM_CCMR3_OC5M_Msk                                                 (0x10070UL)    /*!< TIM CCMR3: OC5M (Bitfield-Mask: 0x1007) */
#define TIM_CCMR3_OC5M                                                     TIM_CCMR3_OC5M_Msk
#define TIM_CCMR3_OC5M_0                                                   (0x1U << TIM_CCMR3_OC5M_Pos)
#define TIM_CCMR3_OC5M_1                                                   (0x2U << TIM_CCMR3_OC5M_Pos)
#define TIM_CCMR3_OC5M_2                                                   (0x4U << TIM_CCMR3_OC5M_Pos)
#define TIM_CCMR3_OC5M_3                                                   (0x1000U << TIM_CCMR3_OC5M_Pos)
#define TIM_CCMR3_OC5PE_Pos                                                (3UL)    /*!<TIM CCMR3: OC5PE (Bit 3) */
#define TIM_CCMR3_OC5PE_Msk                                                (0x8UL)    /*!< TIM CCMR3: OC5PE (Bitfield-Mask: 0x01) */
#define TIM_CCMR3_OC5PE                                                    TIM_CCMR3_OC5PE_Msk
#define TIM_CCMR3_OC5FE_Pos                                                (2UL)    /*!<TIM CCMR3: OC5FE (Bit 2) */
#define TIM_CCMR3_OC5FE_Msk                                                (0x4UL)    /*!< TIM CCMR3: OC5FE (Bitfield-Mask: 0x01) */
#define TIM_CCMR3_OC5FE                                                    TIM_CCMR3_OC5FE_Msk

