stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* =====================================================    CCR5    ===================================================== */
#define TIM_CCR5_GC5C3_Pos                                                 (31UL)   /*!<TIM CCR5: GC5C3 (Bit 31) */
#define TIM_CCR5_GC5C3_Msk                                                 (0x80000000UL)   /*!< TIM CCR5: GC5C3 (Bitfield-Mask: 0x01) */
#define TIM_CCR5_GC5C3                                                     TIM_CCR5_GC5C3_Msk
#define TIM_CCR5_GC5C2_Pos                                                 (30UL)   /*!<TIM CCR5: GC5C2 (Bit 30) */
#define TIM_CCR5_GC5C2_Msk                                                 (0x40000000UL)   /*!< TIM CCR5: GC5C2 (Bitfield-Mask: 0x01) */
#define TIM_CCR5_GC5C2                                                     TIM_CCR5_GC5C2_Msk
#define TIM_CCR5_GC5C1_Pos                                                 (29UL)   /*!<TIM CCR5: GC5C1 (Bit 29) */
#define TIM_CCR5_GC5C1_Msk                                                 (0x20000000UL)   /*!< TIM CCR5: GC5C1 (Bitfield-Mask: 0x01) */
#define TIM_CCR5_GC5C1                                                     TIM_CCR5_GC5C1_Msk
#define TIM_CCR5_CCR5_Pos                                                  (0UL)    /*!<TIM CCR5: CCR5 (Bit 0) */
#define TIM_CCR5_CCR5_Msk                                                  (0xffffUL)   /*!< TIM CCR5: CCR5 (Bitfield-Mask: 0xffff) */
#define TIM_CCR5_CCR5                                                      TIM_CCR5_CCR5_Msk
#define TIM_CCR5_CCR5_0                                                    (0x1U << TIM_CCR5_CCR5_Pos)
#define TIM_CCR5_CCR5_1                                                    (0x2U << TIM_CCR5_CCR5_Pos)
#define TIM_CCR5_CCR5_2                                                    (0x4U << TIM_CCR5_CCR5_Pos)
#define TIM_CCR5_CCR5_3                                                    (0x8U << TIM_CCR5_CCR5_Pos)
#define TIM_CCR5_CCR5_4                                                    (0x10U << TIM_CCR5_CCR5_Pos)
#define TIM_CCR5_CCR5_5                                                    (0x20U << TIM_CCR5_CCR5_Pos)
#define TIM_CCR5_CCR5_6                                                    (0x40U << TIM_CCR5_CCR5_Pos)
#define TIM_CCR5_CCR5_7                                                    (0x80U << TIM_CCR5_CCR5_Pos)
#define TIM_CCR5_CCR5_8                                                    (0x100U << TIM_CCR5_CCR5_Pos)
#define TIM_CCR5_CCR5_9                                                    (0x200U << TIM_CCR5_CCR5_Pos)
#define TIM_CCR5_CCR5_10                                                   (0x400U << TIM_CCR5_CCR5_Pos)
#define TIM_CCR5_CCR5_11                                                   (0x800U << TIM_CCR5_CCR5_Pos)
#define TIM_CCR5_CCR5_12                                                   (0x1000U << TIM_CCR5_CCR5_Pos)
#define TIM_CCR5_CCR5_13                                                   (0x2000U << TIM_CCR5_CCR5_Pos)
#define TIM_CCR5_CCR5_14                                                   (0x4000U << TIM_CCR5_CCR5_Pos)
#define TIM_CCR5_CCR5_15                                                   (0x8000U << TIM_CCR5_CCR5_Pos)

/* =====================================================    CCR6    ===================================================== */
#define TIM_CCR6_CCR6_Pos                                                  (0UL)    /*!<TIM CCR6: CCR6 (Bit 0) */
#define TIM_CCR6_CCR6_Msk                                                  (0xffffUL)   /*!< TIM CCR6: CCR6 (Bitfield-Mask: 0xffff) */
#define TIM_CCR6_CCR6                                                      TIM_CCR6_CCR6_Msk
#define TIM_CCR6_CCR6_0                                                    (0x1U << TIM_CCR6_CCR6_Pos)
#define TIM_CCR6_CCR6_1                                                    (0x2U << TIM_CCR6_CCR6_Pos)
#define TIM_CCR6_CCR6_2                                                    (0x4U << TIM_CCR6_CCR6_Pos)
#define TIM_CCR6_CCR6_3                                                    (0x8U << TIM_CCR6_CCR6_Pos)
#define TIM_CCR6_CCR6_4                                                    (0x10U << TIM_CCR6_CCR6_Pos)
#define TIM_CCR6_CCR6_5                                                    (0x20U << TIM_CCR6_CCR6_Pos)
#define TIM_CCR6_CCR6_6                                                    (0x40U << TIM_CCR6_CCR6_Pos)
#define TIM_CCR6_CCR6_7                                                    (0x80U << TIM_CCR6_CCR6_Pos)
#define TIM_CCR6_CCR6_8                                                    (0x100U << TIM_CCR6_CCR6_Pos)
#define TIM_CCR6_CCR6_9                                                    (0x200U << TIM_CCR6_CCR6_Pos)
#define TIM_CCR6_CCR6_10                                                   (0x400U << TIM_CCR6_CCR6_Pos)
#define TIM_CCR6_CCR6_11                                                   (0x800U << TIM_CCR6_CCR6_Pos)
#define TIM_CCR6_CCR6_12                                                   (0x1000U << TIM_CCR6_CCR6_Pos)
#define TIM_CCR6_CCR6_13                                                   (0x2000U << TIM_CCR6_CCR6_Pos)
#define TIM_CCR6_CCR6_14                                                   (0x4000U << TIM_CCR6_CCR6_Pos)
#define TIM_CCR6_CCR6_15                                                   (0x8000U << TIM_CCR6_CCR6_Pos)

/* =====================================================    AF1    ===================================================== */
#define TIM_AF1_BKCMP2P_Pos                                                (11UL)   /*!<TIM AF1: BKCMP2P (Bit 11) */
#define TIM_AF1_BKCMP2P_Msk                                                (0x800UL)    /*!< TIM AF1: BKCMP2P (Bitfield-Mask: 0x01) */
#define TIM_AF1_BKCMP2P                                                    TIM_AF1_BKCMP2P_Msk
#define TIM_AF1_BKCMP1P_Pos                                                (10UL)   /*!<TIM AF1: BKCMP1P (Bit 10) */
#define TIM_AF1_BKCMP1P_Msk                                                (0x400UL)    /*!< TIM AF1: BKCMP1P (Bitfield-Mask: 0x01) */
#define TIM_AF1_BKCMP1P                                                    TIM_AF1_BKCMP1P_Msk
#define TIM_AF1_BKINP_Pos                                                  (9UL)    /*!<TIM AF1: BKINP (Bit 9) */
#define TIM_AF1_BKINP_Msk                                                  (0x200UL)    /*!< TIM AF1: BKINP (Bitfield-Mask: 0x01) */
#define TIM_AF1_BKINP                                                      TIM_AF1_BKINP_Msk
#define TIM_AF1_BKCMP2E_Pos                                                (2UL)    /*!<TIM AF1: BKCMP2E (Bit 2) */
#define TIM_AF1_BKCMP2E_Msk                                                (0x4UL)    /*!< TIM AF1: BKCMP2E (Bitfield-Mask: 0x01) */
#define TIM_AF1_BKCMP2E                                                    TIM_AF1_BKCMP2E_Msk
#define TIM_AF1_BKCMP1E_Pos                                                (1UL)    /*!<TIM AF1: BKCMP1E (Bit 1) */
#define TIM_AF1_BKCMP1E_Msk                                                (0x2UL)    /*!< TIM AF1: BKCMP1E (Bitfield-Mask: 0x01) */
#define TIM_AF1_BKCMP1E                                                    TIM_AF1_BKCMP1E_Msk
#define TIM_AF1_BKINE_Pos                                                  (0UL)    /*!<TIM AF1: BKINE (Bit 0) */
#define TIM_AF1_BKINE_Msk                                                  (0x1UL)    /*!< TIM AF1: BKINE (Bitfield-Mask: 0x01) */
#define TIM_AF1_BKINE                                                      TIM_AF1_BKINE_Msk

