stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* =====================================================    AF2    ===================================================== */
#define TIM_AF2_BK2CMP2P_Pos                                               (11UL)   /*!<TIM AF2: BK2CMP2P (Bit 11) */
#define TIM_AF2_BK2CMP2P_Msk                                               (0x800UL)    /*!< TIM AF2: BK2CMP2P (Bitfield-Mask: 0x01) */
#define TIM_AF2_BK2CMP2P                                                   TIM_AF2_BK2CMP2P_Msk
#define TIM_AF2_BK2CMP1P_Pos                                               (10UL)   /*!<TIM AF2: BK2CMP1P (Bit 10) */
#define TIM_AF2_BK2CMP1P_Msk                                               (0x400UL)    /*!< TIM AF2: BK2CMP1P (Bitfield-Mask: 0x01) */
#define TIM_AF2_BK2CMP1P                                                   TIM_AF2_BK2CMP1P_Msk
#define TIM_AF2_BK2INP_Pos                                                 (9UL)    /*!<TIM AF2: BK2INP (Bit 9) */
#define TIM_AF2_BK2INP_Msk                                                 (0x200UL)    /*!< TIM AF2: BK2INP (Bitfield-Mask: 0x01) */
#define TIM_AF2_BK2INP                                                     TIM_AF2_BK2INP_Msk
#define TIM_AF2_BK2CMP2E_Pos                                               (2UL)    /*!<TIM AF2: BK2CMP2E (Bit 2) */
#define TIM_AF2_BK2CMP2E_Msk                                               (0x4UL)    /*!< TIM AF2: BK2CMP2E (Bitfield-Mask: 0x01) */
#define TIM_AF2_BK2CMP2E                                                   TIM_AF2_BK2CMP2E_Msk
#define TIM_AF2_BK2CMP1E_Pos                                               (1UL)    /*!<TIM AF2: BK2CMP1E (Bit 1) */
#define TIM_AF2_BK2CMP1E_Msk                                               (0x2UL)    /*!< TIM AF2: BK2CMP1E (Bitfield-Mask: 0x01) */
#define TIM_AF2_BK2CMP1E                                                   TIM_AF2_BK2CMP1E_Msk
#define TIM_AF2_BK2INE_Pos                                                 (0UL)    /*!<TIM AF2: BK2INE (Bit 0) */
#define TIM_AF2_BK2INE_Msk                                                 (0x1UL)    /*!< TIM AF2: BK2INE (Bitfield-Mask: 0x01) */
#define TIM_AF2_BK2INE                                                     TIM_AF2_BK2INE_Msk


/* =========================================================================================================================== */
/*=====================                                      USART                                      ===================== */
/* =========================================================================================================================== */

/* =====================================================    CR1    ===================================================== */
#define USART_CR1_RXFFIE_Pos                                               (31UL)   /*!<USART CR1: RXFFIE (Bit 31) */
#define USART_CR1_RXFFIE_Msk                                               (0x80000000UL)   /*!< USART CR1: RXFFIE (Bitfield-Mask: 0x01) */
#define USART_CR1_RXFFIE                                                   USART_CR1_RXFFIE_Msk
#define USART_CR1_TXFEIE_Pos                                               (30UL)   /*!<USART CR1: TXFEIE (Bit 30) */
#define USART_CR1_TXFEIE_Msk                                               (0x40000000UL)   /*!< USART CR1: TXFEIE (Bitfield-Mask: 0x01) */
#define USART_CR1_TXFEIE                                                   USART_CR1_TXFEIE_Msk
#define USART_CR1_FIFOEN_Pos                                               (29UL)   /*!<USART CR1: FIFOEN (Bit 29) */
#define USART_CR1_FIFOEN_Msk                                               (0x20000000UL)   /*!< USART CR1: FIFOEN (Bitfield-Mask: 0x01) */
#define USART_CR1_FIFOEN                                                   USART_CR1_FIFOEN_Msk
#define USART_CR1_M1_Pos                                                   (28U)
#define USART_CR1_M1_Msk                                                   (0x1UL << USART_CR1_M1_Pos)             /*!< 0x10000000 */
#define USART_CR1_M1                                                       USART_CR1_M1_Msk                        /*!< Word length - Bit 1 */
#define USART_CR1_EOBIE_Pos                                                (27UL)   /*!<USART CR1: EOBIE (Bit 27) */
#define USART_CR1_EOBIE_Msk                                                (0x8000000UL)    /*!< USART CR1: EOBIE (Bitfield-Mask: 0x01) */
#define USART_CR1_EOBIE                                                    USART_CR1_EOBIE_Msk
#define USART_CR1_RTOIE_Pos                                                (26UL)   /*!<USART CR1: RTOIE (Bit 26) */
#define USART_CR1_RTOIE_Msk                                                (0x4000000UL)    /*!< USART CR1: RTOIE (Bitfield-Mask: 0x01) */
#define USART_CR1_RTOIE                                                    USART_CR1_RTOIE_Msk
#define USART_CR1_DEAT_Pos                                                 (21UL)   /*!<USART CR1: DEAT (Bit 21) */
#define USART_CR1_DEAT_Msk                                                 (0x3e00000UL)    /*!< USART CR1: DEAT (Bitfield-Mask: 0x1f) */
#define USART_CR1_DEAT                                                     USART_CR1_DEAT_Msk
#define USART_CR1_DEAT_0                                                   (0x1U << USART_CR1_DEAT_Pos)
#define USART_CR1_DEAT_1                                                   (0x2U << USART_CR1_DEAT_Pos)
#define USART_CR1_DEAT_2                                                   (0x4U << USART_CR1_DEAT_Pos)
#define USART_CR1_DEAT_3                                                   (0x8U << USART_CR1_DEAT_Pos)
#define USART_CR1_DEAT_4                                                   (0x10U << USART_CR1_DEAT_Pos)
#define USART_CR1_DEDT_Pos                                                 (16UL)   /*!<USART CR1: DEDT (Bit 16) */
#define USART_CR1_DEDT_Msk                                                 (0x1f0000UL)   /*!< USART CR1: DEDT (Bitfield-Mask: 0x1f) */
#define USART_CR1_DEDT                                                     USART_CR1_DEDT_Msk
#define USART_CR1_DEDT_0                                                   (0x1U << USART_CR1_DEDT_Pos)
#define USART_CR1_DEDT_1                                                   (0x2U << USART_CR1_DEDT_Pos)
#define USART_CR1_DEDT_2                                                   (0x4U << USART_CR1_DEDT_Pos)
#define USART_CR1_DEDT_3                                                   (0x8U << USART_CR1_DEDT_Pos)
#define USART_CR1_DEDT_4                                                   (0x10U << USART_CR1_DEDT_Pos)
#define USART_CR1_OVER8_Pos                                                (15UL)   /*!<USART CR1: OVER8 (Bit 15) */
#define USART_CR1_OVER8_Msk                                                (0x8000UL)   /*!< USART CR1: OVER8 (Bitfield-Mask: 0x01) */
#define USART_CR1_OVER8                                                    USART_CR1_OVER8_Msk
#define USART_CR1_CMIE_Pos                                                 (14UL)   /*!<USART CR1: CMIE (Bit 14) */
#define USART_CR1_CMIE_Msk                                                 (0x4000UL)   /*!< USART CR1: CMIE (Bitfield-Mask: 0x01) */
#define USART_CR1_CMIE                                                     USART_CR1_CMIE_Msk
#define USART_CR1_MME_Pos                                                  (13UL)   /*!<USART CR1: MME (Bit 13) */
#define USART_CR1_MME_Msk                                                  (0x2000UL)   /*!< USART CR1: MME (Bitfield-Mask: 0x01) */
#define USART_CR1_MME                                                      USART_CR1_MME_Msk
#define USART_CR1_M_Pos                                                    (12U)
#define USART_CR1_M_Msk                                                    (0x10001UL << USART_CR1_M_Pos)          /*!< 0x10001000 */
#define USART_CR1_M                                                        USART_CR1_M_Msk                         /*!< Word length */
#define USART_CR1_M0_Pos                                                   (12U)
#define USART_CR1_M0_Msk                                                   (0x1UL << USART_CR1_M0_Pos)             /*!< 0x00001000 */
#define USART_CR1_M0                                                       USART_CR1_M0_Msk                        /*!< Word length - Bit 0 */
#define USART_CR1_WAKE_Pos                                                 (11UL)   /*!<USART CR1: WAKE (Bit 11) */
#define USART_CR1_WAKE_Msk                                                 (0x800UL)    /*!< USART CR1: WAKE (Bitfield-Mask: 0x01) */
#define USART_CR1_WAKE                                                     USART_CR1_WAKE_Msk
#define USART_CR1_PCE_Pos                                                  (10UL)   /*!<USART CR1: PCE (Bit 10) */
#define USART_CR1_PCE_Msk                                                  (0x400UL)    /*!< USART CR1: PCE (Bitfield-Mask: 0x01) */
#define USART_CR1_PCE                                                      USART_CR1_PCE_Msk
#define USART_CR1_PS_Pos                                                   (9UL)    /*!<USART CR1: PS (Bit 9) */
#define USART_CR1_PS_Msk                                                   (0x200UL)    /*!< USART CR1: PS (Bitfield-Mask: 0x01) */
#define USART_CR1_PS                                                       USART_CR1_PS_Msk
#define USART_CR1_PEIE_Pos                                                 (8UL)    /*!<USART CR1: PEIE (Bit 8) */
#define USART_CR1_PEIE_Msk                                                 (0x100UL)    /*!< USART CR1: PEIE (Bitfield-Mask: 0x01) */
#define USART_CR1_PEIE                                                     USART_CR1_PEIE_Msk
#define USART_CR1_TXEIE_TXFNFIE_Pos                                        (7UL)    /*!<USART CR1: TXEIE_TXFNFIE (Bit 7) */
#define USART_CR1_TXEIE_TXFNFIE_Msk                                        (0x80UL)   /*!< USART CR1: TXEIE_TXFNFIE (Bitfield-Mask: 0x01) */
#define USART_CR1_TXEIE_TXFNFIE                                            USART_CR1_TXEIE_TXFNFIE_Msk
#define USART_CR1_TCIE_Pos                                                 (6UL)    /*!<USART CR1: TCIE (Bit 6) */
#define USART_CR1_TCIE_Msk                                                 (0x40UL)   /*!< USART CR1: TCIE (Bitfield-Mask: 0x01) */
#define USART_CR1_TCIE                                                     USART_CR1_TCIE_Msk
#define USART_CR1_RXNEIE_RXFNEIE_Pos                                       (5UL)    /*!<USART CR1: RXNEIE_RXFNEIE (Bit 5) */
#define USART_CR1_RXNEIE_RXFNEIE_Msk                                       (0x20UL)   /*!< USART CR1: RXNEIE_RXFNEIE (Bitfield-Mask: 0x01) */
#define USART_CR1_RXNEIE_RXFNEIE                                           USART_CR1_RXNEIE_RXFNEIE_Msk
#define USART_CR1_IDLEIE_Pos                                               (4UL)    /*!<USART CR1: IDLEIE (Bit 4) */
#define USART_CR1_IDLEIE_Msk                                               (0x10UL)   /*!< USART CR1: IDLEIE (Bitfield-Mask: 0x01) */
#define USART_CR1_IDLEIE                                                   USART_CR1_IDLEIE_Msk
#define USART_CR1_TE_Pos                                                   (3UL)    /*!<USART CR1: TE (Bit 3) */
#define USART_CR1_TE_Msk                                                   (0x8UL)    /*!< USART CR1: TE (Bitfield-Mask: 0x01) */
#define USART_CR1_TE                                                       USART_CR1_TE_Msk
#define USART_CR1_RE_Pos                                                   (2UL)    /*!<USART CR1: RE (Bit 2) */
#define USART_CR1_RE_Msk                                                   (0x4UL)    /*!< USART CR1: RE (Bitfield-Mask: 0x01) */
#define USART_CR1_RE                                                       USART_CR1_RE_Msk
#define USART_CR1_UE_Pos                                                   (0UL)    /*!<USART CR1: UE (Bit 0) */
#define USART_CR1_UE_Msk                                                   (0x1UL)    /*!< USART CR1: UE (Bitfield-Mask: 0x01) */
#define USART_CR1_UE                                                       USART_CR1_UE_Msk

