stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* =====================================================    OCM_CTRL    ===================================================== */
#define ADC_OCM_CTRL_OCM_ENA_Pos                                           (1UL)    /*!<ADC OCM_CTRL: OCM_ENA (Bit 1) */
#define ADC_OCM_CTRL_OCM_ENA_Msk                                           (0x2UL)    /*!< ADC OCM_CTRL: OCM_ENA (Bitfield-Mask: 0x01) */
#define ADC_OCM_CTRL_OCM_ENA                                               ADC_OCM_CTRL_OCM_ENA_Msk
#define ADC_OCM_CTRL_OCM_SRC_Pos                                           (0UL)    /*!<ADC OCM_CTRL: OCM_SRC (Bit 0) */
#define ADC_OCM_CTRL_OCM_SRC_Msk                                           (0x1UL)    /*!< ADC OCM_CTRL: OCM_SRC (Bitfield-Mask: 0x01) */
#define ADC_OCM_CTRL_OCM_SRC                                               ADC_OCM_CTRL_OCM_SRC_Msk

/* =====================================================    PGA_CONF    ===================================================== */
#define ADC_PGA_CONF_PGA_BIAS_Pos                                          (4UL)    /*!<ADC PGA_CONF: PGA_BIAS (Bit 4) */
#define ADC_PGA_CONF_PGA_BIAS_Msk                                          (0x70UL)   /*!< ADC PGA_CONF: PGA_BIAS (Bitfield-Mask: 0x07) */
#define ADC_PGA_CONF_PGA_BIAS                                              ADC_PGA_CONF_PGA_BIAS_Msk
#define ADC_PGA_CONF_PGA_BIAS_0                                            (0x1U << ADC_PGA_CONF_PGA_BIAS_Pos)
#define ADC_PGA_CONF_PGA_BIAS_1                                            (0x2U << ADC_PGA_CONF_PGA_BIAS_Pos)
#define ADC_PGA_CONF_PGA_BIAS_2                                            (0x4U << ADC_PGA_CONF_PGA_BIAS_Pos)
#define ADC_PGA_CONF_PGA_GAIN_Pos                                          (0UL)    /*!<ADC PGA_CONF: PGA_GAIN (Bit 0) */
#define ADC_PGA_CONF_PGA_GAIN_Msk                                          (0xfUL)    /*!< ADC PGA_CONF: PGA_GAIN (Bitfield-Mask: 0x0f) */
#define ADC_PGA_CONF_PGA_GAIN                                              ADC_PGA_CONF_PGA_GAIN_Msk
#define ADC_PGA_CONF_PGA_GAIN_0                                            (0x1U << ADC_PGA_CONF_PGA_GAIN_Pos)
#define ADC_PGA_CONF_PGA_GAIN_1                                            (0x2U << ADC_PGA_CONF_PGA_GAIN_Pos)
#define ADC_PGA_CONF_PGA_GAIN_2                                            (0x4U << ADC_PGA_CONF_PGA_GAIN_Pos)
#define ADC_PGA_CONF_PGA_GAIN_3                                            (0x8U << ADC_PGA_CONF_PGA_GAIN_Pos)

/* =====================================================    SWITCH    ===================================================== */
#define ADC_SWITCH_SE_VIN_7_Pos                                            (14UL)   /*!<ADC SWITCH: SE_VIN_7 (Bit 14) */
#define ADC_SWITCH_SE_VIN_7_Msk                                            (0xc000UL)   /*!< ADC SWITCH: SE_VIN_7 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_7                                                ADC_SWITCH_SE_VIN_7_Msk
#define ADC_SWITCH_SE_VIN_7_0                                              (0x1U << ADC_SWITCH_SE_VIN_7_Pos)
#define ADC_SWITCH_SE_VIN_7_1                                              (0x2U << ADC_SWITCH_SE_VIN_7_Pos)
#define ADC_SWITCH_SE_VIN_6_Pos                                            (12UL)   /*!<ADC SWITCH: SE_VIN_6 (Bit 12) */
#define ADC_SWITCH_SE_VIN_6_Msk                                            (0x3000UL)   /*!< ADC SWITCH: SE_VIN_6 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_6                                                ADC_SWITCH_SE_VIN_6_Msk
#define ADC_SWITCH_SE_VIN_6_0                                              (0x1U << ADC_SWITCH_SE_VIN_6_Pos)
#define ADC_SWITCH_SE_VIN_6_1                                              (0x2U << ADC_SWITCH_SE_VIN_6_Pos)
#define ADC_SWITCH_SE_VIN_5_Pos                                            (10UL)   /*!<ADC SWITCH: SE_VIN_5 (Bit 10) */
#define ADC_SWITCH_SE_VIN_5_Msk                                            (0xc00UL)    /*!< ADC SWITCH: SE_VIN_5 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_5                                                ADC_SWITCH_SE_VIN_5_Msk
#define ADC_SWITCH_SE_VIN_5_0                                              (0x1U << ADC_SWITCH_SE_VIN_5_Pos)
#define ADC_SWITCH_SE_VIN_5_1                                              (0x2U << ADC_SWITCH_SE_VIN_5_Pos)
#define ADC_SWITCH_SE_VIN_4_Pos                                            (8UL)    /*!<ADC SWITCH: SE_VIN_4 (Bit 8) */
#define ADC_SWITCH_SE_VIN_4_Msk                                            (0x300UL)    /*!< ADC SWITCH: SE_VIN_4 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_4                                                ADC_SWITCH_SE_VIN_4_Msk
#define ADC_SWITCH_SE_VIN_4_0                                              (0x1U << ADC_SWITCH_SE_VIN_4_Pos)
#define ADC_SWITCH_SE_VIN_4_1                                              (0x2U << ADC_SWITCH_SE_VIN_4_Pos)
#define ADC_SWITCH_SE_VIN_3_Pos                                            (6UL)    /*!<ADC SWITCH: SE_VIN_3 (Bit 6) */
#define ADC_SWITCH_SE_VIN_3_Msk                                            (0xc0UL)   /*!< ADC SWITCH: SE_VIN_3 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_3                                                ADC_SWITCH_SE_VIN_3_Msk
#define ADC_SWITCH_SE_VIN_3_0                                              (0x1U << ADC_SWITCH_SE_VIN_3_Pos)
#define ADC_SWITCH_SE_VIN_3_1                                              (0x2U << ADC_SWITCH_SE_VIN_3_Pos)
#define ADC_SWITCH_SE_VIN_2_Pos                                            (4UL)    /*!<ADC SWITCH: SE_VIN_2 (Bit 4) */
#define ADC_SWITCH_SE_VIN_2_Msk                                            (0x30UL)   /*!< ADC SWITCH: SE_VIN_2 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_2                                                ADC_SWITCH_SE_VIN_2_Msk
#define ADC_SWITCH_SE_VIN_2_0                                              (0x1U << ADC_SWITCH_SE_VIN_2_Pos)
#define ADC_SWITCH_SE_VIN_2_1                                              (0x2U << ADC_SWITCH_SE_VIN_2_Pos)
#define ADC_SWITCH_SE_VIN_1_Pos                                            (2UL)    /*!<ADC SWITCH: SE_VIN_1 (Bit 2) */
#define ADC_SWITCH_SE_VIN_1_Msk                                            (0xcUL)    /*!< ADC SWITCH: SE_VIN_1 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_1                                                ADC_SWITCH_SE_VIN_1_Msk
#define ADC_SWITCH_SE_VIN_1_0                                              (0x1U << ADC_SWITCH_SE_VIN_1_Pos)
#define ADC_SWITCH_SE_VIN_1_1                                              (0x2U << ADC_SWITCH_SE_VIN_1_Pos)
#define ADC_SWITCH_SE_VIN_0_Pos                                            (0UL)    /*!<ADC SWITCH: SE_VIN_0 (Bit 0) */
#define ADC_SWITCH_SE_VIN_0_Msk                                            (0x3UL)    /*!< ADC SWITCH: SE_VIN_0 (Bitfield-Mask: 0x03) */
#define ADC_SWITCH_SE_VIN_0                                                ADC_SWITCH_SE_VIN_0_Msk
#define ADC_SWITCH_SE_VIN_0_0                                              (0x1U << ADC_SWITCH_SE_VIN_0_Pos)
#define ADC_SWITCH_SE_VIN_0_1                                              (0x2U << ADC_SWITCH_SE_VIN_0_Pos)

