stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* =====================================================    IRQ_ENABLE    ===================================================== */
#define ADC_IRQ_ENABLE_DF_OVRFL_IRQ_ENA_Pos                                (7UL)    /*!<ADC IRQ_ENABLE: DF_OVRFL_IRQ_ENA (Bit 7) */
#define ADC_IRQ_ENABLE_DF_OVRFL_IRQ_ENA_Msk                                (0x80UL)   /*!< ADC IRQ_ENABLE: DF_OVRFL_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_DF_OVRFL_IRQ_ENA                                    ADC_IRQ_ENABLE_DF_OVRFL_IRQ_ENA_Msk
#define ADC_IRQ_ENABLE_OVR_DF_IRQ_ENA_Pos                                  (6UL)    /*!<ADC IRQ_ENABLE: OVR_DF_IRQ_ENA (Bit 6) */
#define ADC_IRQ_ENABLE_OVR_DF_IRQ_ENA_Msk                                  (0x40UL)   /*!< ADC IRQ_ENABLE: OVR_DF_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_OVR_DF_IRQ_ENA                                      ADC_IRQ_ENABLE_OVR_DF_IRQ_ENA_Msk
#define ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA_Pos                                  (5UL)    /*!<ADC IRQ_ENABLE: OVR_DS_IRQ_ENA (Bit 5) */
#define ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA_Msk                                  (0x20UL)   /*!< ADC IRQ_ENABLE: OVR_DS_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA                                      ADC_IRQ_ENABLE_OVR_DS_IRQ_ENA_Msk
#define ADC_IRQ_ENABLE_AWD_IRQ_ENA_Pos                                     (4UL)    /*!<ADC IRQ_ENABLE: AWD_IRQ_ENA (Bit 4) */
#define ADC_IRQ_ENABLE_AWD_IRQ_ENA_Msk                                     (0x10UL)   /*!< ADC IRQ_ENABLE: AWD_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_AWD_IRQ_ENA                                         ADC_IRQ_ENABLE_AWD_IRQ_ENA_Msk
#define ADC_IRQ_ENABLE_EOS_IRQ_ENA_Pos                                     (3UL)    /*!<ADC IRQ_ENABLE: EOS_IRQ_ENA (Bit 3) */
#define ADC_IRQ_ENABLE_EOS_IRQ_ENA_Msk                                     (0x8UL)    /*!< ADC IRQ_ENABLE: EOS_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_EOS_IRQ_ENA                                         ADC_IRQ_ENABLE_EOS_IRQ_ENA_Msk
#define ADC_IRQ_ENABLE_EODF_IRQ_ENA_Pos                                    (2UL)    /*!<ADC IRQ_ENABLE: EODF_IRQ_ENA (Bit 2) */
#define ADC_IRQ_ENABLE_EODF_IRQ_ENA_Msk                                    (0x4UL)    /*!< ADC IRQ_ENABLE: EODF_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_EODF_IRQ_ENA                                        ADC_IRQ_ENABLE_EODF_IRQ_ENA_Msk
#define ADC_IRQ_ENABLE_EODS_IRQ_ENA_Pos                                    (1UL)    /*!<ADC IRQ_ENABLE: EODS_IRQ_ENA (Bit 1) */
#define ADC_IRQ_ENABLE_EODS_IRQ_ENA_Msk                                    (0x2UL)    /*!< ADC IRQ_ENABLE: EODS_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_EODS_IRQ_ENA                                        ADC_IRQ_ENABLE_EODS_IRQ_ENA_Msk
#define ADC_IRQ_ENABLE_EOC_IRQ_ENA_Pos                                     (0UL)    /*!<ADC IRQ_ENABLE: EOC_IRQ_ENA (Bit 0) */
#define ADC_IRQ_ENABLE_EOC_IRQ_ENA_Msk                                     (0x1UL)    /*!< ADC IRQ_ENABLE: EOC_IRQ_ENA (Bitfield-Mask: 0x01) */
#define ADC_IRQ_ENABLE_EOC_IRQ_ENA                                         ADC_IRQ_ENABLE_EOC_IRQ_ENA_Msk

/* =====================================================    TIMER_CONF    ===================================================== */
#define ADC_TIMER_CONF_PRECH_DELAY_SEL_Pos                                 (16UL)   /*!<ADC TIMER_CONF: PRECH_DELAY_SEL (Bit 16) */
#define ADC_TIMER_CONF_PRECH_DELAY_SEL_Msk                                 (0x10000UL)    /*!< ADC TIMER_CONF: PRECH_DELAY_SEL (Bitfield-Mask: 0x01) */
#define ADC_TIMER_CONF_PRECH_DELAY_SEL                                     ADC_TIMER_CONF_PRECH_DELAY_SEL_Msk
#define ADC_TIMER_CONF_VBIAS_PRECH_DELAY_Pos                               (8UL)    /*!<ADC TIMER_CONF: VBIAS_PRECH_DELAY (Bit 8) */
#define ADC_TIMER_CONF_VBIAS_PRECH_DELAY_Msk                               (0xff00UL)   /*!< ADC TIMER_CONF: VBIAS_PRECH_DELAY (Bitfield-Mask: 0xff) */
#define ADC_TIMER_CONF_VBIAS_PRECH_DELAY                                   ADC_TIMER_CONF_VBIAS_PRECH_DELAY_Msk
#define ADC_TIMER_CONF_VBIAS_PRECH_DELAY_0                                 (0x1U << ADC_TIMER_CONF_VBIAS_PRECH_DELAY_Pos)
#define ADC_TIMER_CONF_VBIAS_PRECH_DELAY_1                                 (0x2U << ADC_TIMER_CONF_VBIAS_PRECH_DELAY_Pos)
#define ADC_TIMER_CONF_VBIAS_PRECH_DELAY_2                                 (0x4U << ADC_TIMER_CONF_VBIAS_PRECH_DELAY_Pos)
#define ADC_TIMER_CONF_VBIAS_PRECH_DELAY_3                                 (0x8U << ADC_TIMER_CONF_VBIAS_PRECH_DELAY_Pos)
#define ADC_TIMER_CONF_VBIAS_PRECH_DELAY_4                                 (0x10U << ADC_TIMER_CONF_VBIAS_PRECH_DELAY_Pos)
#define ADC_TIMER_CONF_VBIAS_PRECH_DELAY_5                                 (0x20U << ADC_TIMER_CONF_VBIAS_PRECH_DELAY_Pos)
#define ADC_TIMER_CONF_VBIAS_PRECH_DELAY_6                                 (0x40U << ADC_TIMER_CONF_VBIAS_PRECH_DELAY_Pos)
#define ADC_TIMER_CONF_VBIAS_PRECH_DELAY_7                                 (0x80U << ADC_TIMER_CONF_VBIAS_PRECH_DELAY_Pos)
#define ADC_TIMER_CONF_ADC_LDO_DELAY_Pos                                   (0UL)    /*!<ADC TIMER_CONF: ADC_LDO_DELAY (Bit 0) */
#define ADC_TIMER_CONF_ADC_LDO_DELAY_Msk                                   (0xffUL)   /*!< ADC TIMER_CONF: ADC_LDO_DELAY (Bitfield-Mask: 0xff) */
#define ADC_TIMER_CONF_ADC_LDO_DELAY                                       ADC_TIMER_CONF_ADC_LDO_DELAY_Msk
#define ADC_TIMER_CONF_ADC_LDO_DELAY_0                                     (0x1U << ADC_TIMER_CONF_ADC_LDO_DELAY_Pos)
#define ADC_TIMER_CONF_ADC_LDO_DELAY_1                                     (0x2U << ADC_TIMER_CONF_ADC_LDO_DELAY_Pos)
#define ADC_TIMER_CONF_ADC_LDO_DELAY_2                                     (0x4U << ADC_TIMER_CONF_ADC_LDO_DELAY_Pos)
#define ADC_TIMER_CONF_ADC_LDO_DELAY_3                                     (0x8U << ADC_TIMER_CONF_ADC_LDO_DELAY_Pos)
#define ADC_TIMER_CONF_ADC_LDO_DELAY_4                                     (0x10U << ADC_TIMER_CONF_ADC_LDO_DELAY_Pos)
#define ADC_TIMER_CONF_ADC_LDO_DELAY_5                                     (0x20U << ADC_TIMER_CONF_ADC_LDO_DELAY_Pos)
#define ADC_TIMER_CONF_ADC_LDO_DELAY_6                                     (0x40U << ADC_TIMER_CONF_ADC_LDO_DELAY_Pos)
#define ADC_TIMER_CONF_ADC_LDO_DELAY_7                                     (0x80U << ADC_TIMER_CONF_ADC_LDO_DELAY_Pos)


/* =========================================================================================================================== */
/* ================                                     BLUE                                                  ================ */
/* =========================================================================================================================== */


/* ===============================================   CONTROLLERVERNUMREG   =============================================== */
#define BLUE_CONTROLLERVERNUMREG_SUBVERNUM_Pos                             (0UL)   /*!< BLUE CONTROLLERVERNUMREG: SUBVERNUM (Bit 0) */
#define BLUE_CONTROLLERVERNUMREG_SUBVERNUM_Msk                             (0x000000ffUL)  /*!< BLUE CONTROLLERVERNUMREG: SUBVERNUM (Bitfield-Mask: 0xff) */
#define BLUE_CONTROLLERVERNUMREG_SUBVERNUM                                 BLUE_CONTROLLERVERNUMREG_SUBVERNUM_Msk
#define BLUE_CONTROLLERVERNUMREG_SUBVERNUM_0                               (0x01 << BLUE_CONTROLLERVERNUMREG_SUBVERNUM_Pos)   /*!<0x00000001 */
#define BLUE_CONTROLLERVERNUMREG_SUBVERNUM_1                               (0x02 << BLUE_CONTROLLERVERNUMREG_SUBVERNUM_Pos)   /*!<0x00000002 */
#define BLUE_CONTROLLERVERNUMREG_SUBVERNUM_2                               (0x04 << BLUE_CONTROLLERVERNUMREG_SUBVERNUM_Pos)   /*!<0x00000004 */
#define BLUE_CONTROLLERVERNUMREG_SUBVERNUM_3                               (0x08 << BLUE_CONTROLLERVERNUMREG_SUBVERNUM_Pos)   /*!<0x00000008 */
#define BLUE_CONTROLLERVERNUMREG_SUBVERNUM_4                               (0x10 << BLUE_CONTROLLERVERNUMREG_SUBVERNUM_Pos)   /*!<0x00000010 */
#define BLUE_CONTROLLERVERNUMREG_SUBVERNUM_5                               (0x20 << BLUE_CONTROLLERVERNUMREG_SUBVERNUM_Pos)   /*!<0x00000020 */
#define BLUE_CONTROLLERVERNUMREG_SUBVERNUM_6                               (0x40 << BLUE_CONTROLLERVERNUMREG_SUBVERNUM_Pos)   /*!<0x00000040 */
#define BLUE_CONTROLLERVERNUMREG_SUBVERNUM_7                               (0x80 << BLUE_CONTROLLERVERNUMREG_SUBVERNUM_Pos)   /*!<0x00000080 */
#define BLUE_CONTROLLERVERNUMREG_VERNUM_Pos                                (8UL)   /*!< BLUE CONTROLLERVERNUMREG: VERNUM (Bit 8) */
#define BLUE_CONTROLLERVERNUMREG_VERNUM_Msk                                (0x0000ff00UL)  /*!< BLUE CONTROLLERVERNUMREG: VERNUM (Bitfield-Mask: 0xff) */
#define BLUE_CONTROLLERVERNUMREG_VERNUM                                    BLUE_CONTROLLERVERNUMREG_VERNUM_Msk
#define BLUE_CONTROLLERVERNUMREG_VERNUM_0                                  (0x01 << BLUE_CONTROLLERVERNUMREG_VERNUM_Pos)   /*!<0x00000100 */
#define BLUE_CONTROLLERVERNUMREG_VERNUM_1                                  (0x02 << BLUE_CONTROLLERVERNUMREG_VERNUM_Pos)   /*!<0x00000200 */
#define BLUE_CONTROLLERVERNUMREG_VERNUM_2                                  (0x04 << BLUE_CONTROLLERVERNUMREG_VERNUM_Pos)   /*!<0x00000400 */
#define BLUE_CONTROLLERVERNUMREG_VERNUM_3                                  (0x08 << BLUE_CONTROLLERVERNUMREG_VERNUM_Pos)   /*!<0x00000800 */
#define BLUE_CONTROLLERVERNUMREG_VERNUM_4                                  (0x10 << BLUE_CONTROLLERVERNUMREG_VERNUM_Pos)   /*!<0x00001000 */
#define BLUE_CONTROLLERVERNUMREG_VERNUM_5                                  (0x20 << BLUE_CONTROLLERVERNUMREG_VERNUM_Pos)   /*!<0x00002000 */
#define BLUE_CONTROLLERVERNUMREG_VERNUM_6                                  (0x40 << BLUE_CONTROLLERVERNUMREG_VERNUM_Pos)   /*!<0x00004000 */
#define BLUE_CONTROLLERVERNUMREG_VERNUM_7                                  (0x80 << BLUE_CONTROLLERVERNUMREG_VERNUM_Pos)   /*!<0x00008000 */
#define BLUE_CONTROLLERVERNUMREG_TYP_Pos                                   (16UL)   /*!< BLUE CONTROLLERVERNUMREG: TYP (Bit 16) */
#define BLUE_CONTROLLERVERNUMREG_TYP_Msk                                   (0x00ff0000UL)  /*!< BLUE CONTROLLERVERNUMREG: TYP (Bitfield-Mask: 0xff) */
#define BLUE_CONTROLLERVERNUMREG_TYP                                       BLUE_CONTROLLERVERNUMREG_TYP_Msk
#define BLUE_CONTROLLERVERNUMREG_TYP_0                                     (0x01 << BLUE_CONTROLLERVERNUMREG_TYP_Pos)   /*!<0x00010000 */
#define BLUE_CONTROLLERVERNUMREG_TYP_1                                     (0x02 << BLUE_CONTROLLERVERNUMREG_TYP_Pos)   /*!<0x00020000 */
#define BLUE_CONTROLLERVERNUMREG_TYP_2                                     (0x04 << BLUE_CONTROLLERVERNUMREG_TYP_Pos)   /*!<0x00040000 */
#define BLUE_CONTROLLERVERNUMREG_TYP_3                                     (0x08 << BLUE_CONTROLLERVERNUMREG_TYP_Pos)   /*!<0x00080000 */
#define BLUE_CONTROLLERVERNUMREG_TYP_4                                     (0x10 << BLUE_CONTROLLERVERNUMREG_TYP_Pos)   /*!<0x00100000 */
#define BLUE_CONTROLLERVERNUMREG_TYP_5                                     (0x20 << BLUE_CONTROLLERVERNUMREG_TYP_Pos)   /*!<0x00200000 */
#define BLUE_CONTROLLERVERNUMREG_TYP_6                                     (0x40 << BLUE_CONTROLLERVERNUMREG_TYP_Pos)   /*!<0x00400000 */
#define BLUE_CONTROLLERVERNUMREG_TYP_7                                     (0x80 << BLUE_CONTROLLERVERNUMREG_TYP_Pos)   /*!<0x00800000 */

/* ===============================================   INTERRUPT1REG   =============================================== */

