stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* ===============================================   TIMERCAPTUREREG   =============================================== */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos                              (0UL)   /*!< BLUE TIMERCAPTUREREG: TIMERCAPTURE (Bit 0) */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Msk                              (0xffffffffUL)  /*!< BLUE TIMERCAPTUREREG: TIMERCAPTURE (Bitfield-Mask: 0xffffffffL) */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE                                  BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Msk
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_0                                (0x00000001 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00000001 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_1                                (0x00000002 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00000002 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_2                                (0x00000004 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00000004 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_3                                (0x00000008 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00000008 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_4                                (0x00000010 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00000010 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_5                                (0x00000020 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00000020 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_6                                (0x00000040 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00000040 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_7                                (0x00000080 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00000080 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_8                                (0x00000100 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00000100 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_9                                (0x00000200 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00000200 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_10                               (0x00000400 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00000400 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_11                               (0x00000800 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00000800 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_12                               (0x00001000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00001000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_13                               (0x00002000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00002000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_14                               (0x00004000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00004000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_15                               (0x00008000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00008000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_16                               (0x00010000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00010000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_17                               (0x00020000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00020000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_18                               (0x00040000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00040000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_19                               (0x00080000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00080000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_20                               (0x00100000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00100000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_21                               (0x00200000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00200000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_22                               (0x00400000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00400000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_23                               (0x00800000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x00800000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_24                               (0x01000000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x01000000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_25                               (0x02000000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x02000000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_26                               (0x04000000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x04000000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_27                               (0x08000000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x08000000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_28                               (0x10000000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x10000000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_29                               (0x20000000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x20000000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_30                               (0x40000000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x40000000 */
#define BLUE_TIMERCAPTUREREG_TIMERCAPTURE_31                               (0x80000000 << BLUE_TIMERCAPTUREREG_TIMERCAPTURE_Pos)   /*!<0x80000000 */

/* ===============================================   CMDREG   =============================================== */
#define BLUE_CMDREG_TXRXSKIP_Pos                                           (0UL)   /*!< BLUE CMDREG: TXRXSKIP (Bit 0) */
#define BLUE_CMDREG_TXRXSKIP_Msk                                           (0x00000001UL)  /*!< BLUE CMDREG: TXRXSKIP (Bitfield-Mask: 0x1) */
#define BLUE_CMDREG_TXRXSKIP                                               BLUE_CMDREG_TXRXSKIP_Msk
#define BLUE_CMDREG_LOCKAHBWRITEBACKEN_Pos                                 (1UL)   /*!< BLUE CMDREG: LOCKAHBWRITEBACKEN (Bit 1) */
#define BLUE_CMDREG_LOCKAHBWRITEBACKEN_Msk                                 (0x00000002UL)  /*!< BLUE CMDREG: LOCKAHBWRITEBACKEN (Bitfield-Mask: 0x1) */
#define BLUE_CMDREG_LOCKAHBWRITEBACKEN                                     BLUE_CMDREG_LOCKAHBWRITEBACKEN_Msk
#define BLUE_CMDREG_LOCKAHBFIRSTINITEN_Pos                                 (2UL)   /*!< BLUE CMDREG: LOCKAHBFIRSTINITEN (Bit 2) */
#define BLUE_CMDREG_LOCKAHBFIRSTINITEN_Msk                                 (0x00000004UL)  /*!< BLUE CMDREG: LOCKAHBFIRSTINITEN (Bitfield-Mask: 0x1) */
#define BLUE_CMDREG_LOCKAHBFIRSTINITEN                                     BLUE_CMDREG_LOCKAHBFIRSTINITEN_Msk
#define BLUE_CMDREG_CLEARSEMAREQ_Pos                                       (3UL)   /*!< BLUE CMDREG: CLEARSEMAREQ (Bit 3) */
#define BLUE_CMDREG_CLEARSEMAREQ_Msk                                       (0x00000008UL)  /*!< BLUE CMDREG: CLEARSEMAREQ (Bitfield-Mask: 0x1) */
#define BLUE_CMDREG_CLEARSEMAREQ                                           BLUE_CMDREG_CLEARSEMAREQ_Msk

/* ===============================================   STATUSREG   =============================================== */
#define BLUE_STATUSREG_AESONFLYBUSY_Pos                                    (0UL)   /*!< BLUE STATUSREG: AESONFLYBUSY (Bit 0) */
#define BLUE_STATUSREG_AESONFLYBUSY_Msk                                    (0x00000001UL)  /*!< BLUE STATUSREG: AESONFLYBUSY (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_AESONFLYBUSY                                        BLUE_STATUSREG_AESONFLYBUSY_Msk
#define BLUE_STATUSREG_NOT_SUPPORTED_FEATURE_Pos                           (3UL)   /*!< BLUE STATUSREG: NOT_SUPPORTED_FEATURE (Bit 3) */
#define BLUE_STATUSREG_NOT_SUPPORTED_FEATURE_Msk                           (0x00000008UL)  /*!< BLUE STATUSREG: NOT_SUPPORTED_FEATURE (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_NOT_SUPPORTED_FEATURE                               BLUE_STATUSREG_NOT_SUPPORTED_FEATURE_Msk
#define BLUE_STATUSREG_ADDPOINTERROR_Pos                                   (4UL)   /*!< BLUE STATUSREG: ADDPOINTERROR (Bit 4) */
#define BLUE_STATUSREG_ADDPOINTERROR_Msk                                   (0x00000010UL)  /*!< BLUE STATUSREG: ADDPOINTERROR (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_ADDPOINTERROR                                       BLUE_STATUSREG_ADDPOINTERROR_Msk
#define BLUE_STATUSREG_RXOVERFLOWERROR_Pos                                 (5UL)   /*!< BLUE STATUSREG: RXOVERFLOWERROR (Bit 5) */
#define BLUE_STATUSREG_RXOVERFLOWERROR_Msk                                 (0x00000020UL)  /*!< BLUE STATUSREG: RXOVERFLOWERROR (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_RXOVERFLOWERROR                                     BLUE_STATUSREG_RXOVERFLOWERROR_Msk
#define BLUE_STATUSREG_PREVTRANSMIT_Pos                                    (6UL)   /*!< BLUE STATUSREG: PREVTRANSMIT (Bit 6) */
#define BLUE_STATUSREG_PREVTRANSMIT_Msk                                    (0x00000040UL)  /*!< BLUE STATUSREG: PREVTRANSMIT (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_PREVTRANSMIT                                        BLUE_STATUSREG_PREVTRANSMIT_Msk
#define BLUE_STATUSREG_SEQDONE_Pos                                         (7UL)   /*!< BLUE STATUSREG: SEQDONE (Bit 7) */
#define BLUE_STATUSREG_SEQDONE_Msk                                         (0x00000080UL)  /*!< BLUE STATUSREG: SEQDONE (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_SEQDONE                                             BLUE_STATUSREG_SEQDONE_Msk
#define BLUE_STATUSREG_TXERROR_0_Pos                                       (8UL)   /*!< BLUE STATUSREG: TXERROR_0 (Bit 8) */
#define BLUE_STATUSREG_TXERROR_0_Msk                                       (0x00000100UL)  /*!< BLUE STATUSREG: TXERROR_0 (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_TXERROR_0                                           BLUE_STATUSREG_TXERROR_0_Msk
#define BLUE_STATUSREG_TXERROR_1_Pos                                       (9UL)   /*!< BLUE STATUSREG: TXERROR_1 (Bit 9) */
#define BLUE_STATUSREG_TXERROR_1_Msk                                       (0x00000200UL)  /*!< BLUE STATUSREG: TXERROR_1 (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_TXERROR_1                                           BLUE_STATUSREG_TXERROR_1_Msk
#define BLUE_STATUSREG_TXERROR_2_Pos                                       (10UL)   /*!< BLUE STATUSREG: TXERROR_2 (Bit 10) */
#define BLUE_STATUSREG_TXERROR_2_Msk                                       (0x00000400UL)  /*!< BLUE STATUSREG: TXERROR_2 (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_TXERROR_2                                           BLUE_STATUSREG_TXERROR_2_Msk
#define BLUE_STATUSREG_TXERROR_3_Pos                                       (11UL)   /*!< BLUE STATUSREG: TXERROR_3 (Bit 11) */
#define BLUE_STATUSREG_TXERROR_3_Msk                                       (0x00000800UL)  /*!< BLUE STATUSREG: TXERROR_3 (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_TXERROR_3                                           BLUE_STATUSREG_TXERROR_3_Msk
#define BLUE_STATUSREG_TXERROR_4_Pos                                       (12UL)   /*!< BLUE STATUSREG: TXERROR_4 (Bit 12) */
#define BLUE_STATUSREG_TXERROR_4_Msk                                       (0x00001000UL)  /*!< BLUE STATUSREG: TXERROR_4 (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_TXERROR_4                                           BLUE_STATUSREG_TXERROR_4_Msk
#define BLUE_STATUSREG_ENCERROR_Pos                                        (13UL)   /*!< BLUE STATUSREG: ENCERROR (Bit 13) */
#define BLUE_STATUSREG_ENCERROR_Msk                                        (0x00002000UL)  /*!< BLUE STATUSREG: ENCERROR (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_ENCERROR                                            BLUE_STATUSREG_ENCERROR_Msk
#define BLUE_STATUSREG_ALLTABLEREADYERROR_Pos                              (14UL)   /*!< BLUE STATUSREG: ALLTABLEREADYERROR (Bit 14) */
#define BLUE_STATUSREG_ALLTABLEREADYERROR_Msk                              (0x00004000UL)  /*!< BLUE STATUSREG: ALLTABLEREADYERROR (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_ALLTABLEREADYERROR                                  BLUE_STATUSREG_ALLTABLEREADYERROR_Msk
#define BLUE_STATUSREG_TXDATAREADYERROR_Pos                                (15UL)   /*!< BLUE STATUSREG: TXDATAREADYERROR (Bit 15) */
#define BLUE_STATUSREG_TXDATAREADYERROR_Msk                                (0x00008000UL)  /*!< BLUE STATUSREG: TXDATAREADYERROR (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_TXDATAREADYERROR                                    BLUE_STATUSREG_TXDATAREADYERROR_Msk
#define BLUE_STATUSREG_NOACTIVELERROR_Pos                                  (16UL)   /*!< BLUE STATUSREG: NOACTIVELERROR (Bit 16) */
#define BLUE_STATUSREG_NOACTIVELERROR_Msk                                  (0x00010000UL)  /*!< BLUE STATUSREG: NOACTIVELERROR (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_NOACTIVELERROR                                      BLUE_STATUSREG_NOACTIVELERROR_Msk
#define BLUE_STATUSREG_INITDELAYERROR_Pos                                  (17UL)   /*!< BLUE STATUSREG: INITDELAYERROR (Bit 17) */
#define BLUE_STATUSREG_INITDELAYERROR_Msk                                  (0x00020000UL)  /*!< BLUE STATUSREG: INITDELAYERROR (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_INITDELAYERROR                                      BLUE_STATUSREG_INITDELAYERROR_Msk
#define BLUE_STATUSREG_RCVLENGTHERROR_Pos                                  (18UL)   /*!< BLUE STATUSREG: RCVLENGTHERROR (Bit 18) */
#define BLUE_STATUSREG_RCVLENGTHERROR_Msk                                  (0x00040000UL)  /*!< BLUE STATUSREG: RCVLENGTHERROR (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_RCVLENGTHERROR                                      BLUE_STATUSREG_RCVLENGTHERROR_Msk
#define BLUE_STATUSREG_SEMATIMEOUTERROR_Pos                                (19UL)   /*!< BLUE STATUSREG: SEMATIMEOUTERROR (Bit 19) */
#define BLUE_STATUSREG_SEMATIMEOUTERROR_Msk                                (0x00080000UL)  /*!< BLUE STATUSREG: SEMATIMEOUTERROR (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_SEMATIMEOUTERROR                                    BLUE_STATUSREG_SEMATIMEOUTERROR_Msk
#define BLUE_STATUSREG_SEMAWASPREEMPT_Pos                                  (20UL)   /*!< BLUE STATUSREG: SEMAWASPREEMPT (Bit 20) */
#define BLUE_STATUSREG_SEMAWASPREEMPT_Msk                                  (0x00100000UL)  /*!< BLUE STATUSREG: SEMAWASPREEMPT (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_SEMAWASPREEMPT                                      BLUE_STATUSREG_SEMAWASPREEMPT_Msk
#define BLUE_STATUSREG_TXRXSKIP_Pos                                        (21UL)   /*!< BLUE STATUSREG: TXRXSKIP (Bit 21) */
#define BLUE_STATUSREG_TXRXSKIP_Msk                                        (0x00200000UL)  /*!< BLUE STATUSREG: TXRXSKIP (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_TXRXSKIP                                            BLUE_STATUSREG_TXRXSKIP_Msk
#define BLUE_STATUSREG_ACTIVE2ERROR_Pos                                    (22UL)   /*!< BLUE STATUSREG: ACTIVE2ERROR (Bit 22) */
#define BLUE_STATUSREG_ACTIVE2ERROR_Msk                                    (0x00400000UL)  /*!< BLUE STATUSREG: ACTIVE2ERROR (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_ACTIVE2ERROR                                        BLUE_STATUSREG_ACTIVE2ERROR_Msk
#define BLUE_STATUSREG_CONFIGERROR_Pos                                     (23UL)   /*!< BLUE STATUSREG: CONFIGERROR (Bit 23) */
#define BLUE_STATUSREG_CONFIGERROR_Msk                                     (0x00800000UL)  /*!< BLUE STATUSREG: CONFIGERROR (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_CONFIGERROR                                         BLUE_STATUSREG_CONFIGERROR_Msk
#define BLUE_STATUSREG_TXOK_Pos                                            (24UL)   /*!< BLUE STATUSREG: TXOK (Bit 24) */
#define BLUE_STATUSREG_TXOK_Msk                                            (0x01000000UL)  /*!< BLUE STATUSREG: TXOK (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_TXOK                                                BLUE_STATUSREG_TXOK_Msk
#define BLUE_STATUSREG_DONE_Pos                                            (25UL)   /*!< BLUE STATUSREG: DONE (Bit 25) */
#define BLUE_STATUSREG_DONE_Msk                                            (0x02000000UL)  /*!< BLUE STATUSREG: DONE (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_DONE                                                BLUE_STATUSREG_DONE_Msk
#define BLUE_STATUSREG_RCVTIMEOUT_Pos                                      (26UL)   /*!< BLUE STATUSREG: RCVTIMEOUT (Bit 26) */
#define BLUE_STATUSREG_RCVTIMEOUT_Msk                                      (0x04000000UL)  /*!< BLUE STATUSREG: RCVTIMEOUT (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_RCVTIMEOUT                                          BLUE_STATUSREG_RCVTIMEOUT_Msk
#define BLUE_STATUSREG_RCVNOMD_Pos                                         (27UL)   /*!< BLUE STATUSREG: RCVNOMD (Bit 27) */
#define BLUE_STATUSREG_RCVNOMD_Msk                                         (0x08000000UL)  /*!< BLUE STATUSREG: RCVNOMD (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_RCVNOMD                                             BLUE_STATUSREG_RCVNOMD_Msk
#define BLUE_STATUSREG_RCVCMD_Pos                                          (28UL)   /*!< BLUE STATUSREG: RCVCMD (Bit 28) */
#define BLUE_STATUSREG_RCVCMD_Msk                                          (0x10000000UL)  /*!< BLUE STATUSREG: RCVCMD (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_RCVCMD                                              BLUE_STATUSREG_RCVCMD_Msk
#define BLUE_STATUSREG_TIMECAPTURETRIG_Pos                                 (29UL)   /*!< BLUE STATUSREG: TIMECAPTURETRIG (Bit 29) */
#define BLUE_STATUSREG_TIMECAPTURETRIG_Msk                                 (0x20000000UL)  /*!< BLUE STATUSREG: TIMECAPTURETRIG (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_TIMECAPTURETRIG                                     BLUE_STATUSREG_TIMECAPTURETRIG_Msk
#define BLUE_STATUSREG_RCVCRCERR_Pos                                       (30UL)   /*!< BLUE STATUSREG: RCVCRCERR (Bit 30) */
#define BLUE_STATUSREG_RCVCRCERR_Msk                                       (0x40000000UL)  /*!< BLUE STATUSREG: RCVCRCERR (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_RCVCRCERR                                           BLUE_STATUSREG_RCVCRCERR_Msk
#define BLUE_STATUSREG_RCVOK_Pos                                           (31UL)   /*!< BLUE STATUSREG: RCVOK (Bit 31) */
#define BLUE_STATUSREG_RCVOK_Msk                                           (0x80000000UL)  /*!< BLUE STATUSREG: RCVOK (Bitfield-Mask: 0x1) */
#define BLUE_STATUSREG_RCVOK                                               BLUE_STATUSREG_RCVOK_Msk

