stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* ===============================================   INTERRUPT1ENABLEREG   =============================================== */
#define BLUE_INTERRUPT1ENABLEREG_ADDPOINTERROR_Pos                         (4UL)   /*!< BLUE INTERRUPT1ENABLEREG: ADDPOINTERROR (Bit 4) */
#define BLUE_INTERRUPT1ENABLEREG_ADDPOINTERROR_Msk                         (0x00000010UL)  /*!< BLUE INTERRUPT1ENABLEREG: ADDPOINTERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_ADDPOINTERROR                             BLUE_INTERRUPT1ENABLEREG_ADDPOINTERROR_Msk
#define BLUE_INTERRUPT1ENABLEREG_RXOVERFLOWERROR_Pos                       (5UL)   /*!< BLUE INTERRUPT1ENABLEREG: RXOVERFLOWERROR (Bit 5) */
#define BLUE_INTERRUPT1ENABLEREG_RXOVERFLOWERROR_Msk                       (0x00000020UL)  /*!< BLUE INTERRUPT1ENABLEREG: RXOVERFLOWERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_RXOVERFLOWERROR                           BLUE_INTERRUPT1ENABLEREG_RXOVERFLOWERROR_Msk
#define BLUE_INTERRUPT1ENABLEREG_SEQDONE_Pos                               (7UL)   /*!< BLUE INTERRUPT1ENABLEREG: SEQDONE (Bit 7) */
#define BLUE_INTERRUPT1ENABLEREG_SEQDONE_Msk                               (0x00000080UL)  /*!< BLUE INTERRUPT1ENABLEREG: SEQDONE (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_SEQDONE                                   BLUE_INTERRUPT1ENABLEREG_SEQDONE_Msk
#define BLUE_INTERRUPT1ENABLEREG_TXERROR_0_Pos                             (8UL)   /*!< BLUE INTERRUPT1ENABLEREG: TXERROR_0 (Bit 8) */
#define BLUE_INTERRUPT1ENABLEREG_TXERROR_0_Msk                             (0x00000100UL)  /*!< BLUE INTERRUPT1ENABLEREG: TXERROR_0 (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_TXERROR_0                                 BLUE_INTERRUPT1ENABLEREG_TXERROR_0_Msk
#define BLUE_INTERRUPT1ENABLEREG_TXERROR_1_Pos                             (9UL)   /*!< BLUE INTERRUPT1ENABLEREG: TXERROR_1 (Bit 9) */
#define BLUE_INTERRUPT1ENABLEREG_TXERROR_1_Msk                             (0x00000200UL)  /*!< BLUE INTERRUPT1ENABLEREG: TXERROR_1 (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_TXERROR_1                                 BLUE_INTERRUPT1ENABLEREG_TXERROR_1_Msk
#define BLUE_INTERRUPT1ENABLEREG_TXERROR_2_Pos                             (10UL)   /*!< BLUE INTERRUPT1ENABLEREG: TXERROR_2 (Bit 10) */
#define BLUE_INTERRUPT1ENABLEREG_TXERROR_2_Msk                             (0x00000400UL)  /*!< BLUE INTERRUPT1ENABLEREG: TXERROR_2 (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_TXERROR_2                                 BLUE_INTERRUPT1ENABLEREG_TXERROR_2_Msk
#define BLUE_INTERRUPT1ENABLEREG_TXERROR_3_Pos                             (11UL)   /*!< BLUE INTERRUPT1ENABLEREG: TXERROR_3 (Bit 11) */
#define BLUE_INTERRUPT1ENABLEREG_TXERROR_3_Msk                             (0x00000800UL)  /*!< BLUE INTERRUPT1ENABLEREG: TXERROR_3 (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_TXERROR_3                                 BLUE_INTERRUPT1ENABLEREG_TXERROR_3_Msk
#define BLUE_INTERRUPT1ENABLEREG_TXERROR_4_Pos                             (12UL)   /*!< BLUE INTERRUPT1ENABLEREG: TXERROR_4 (Bit 12) */
#define BLUE_INTERRUPT1ENABLEREG_TXERROR_4_Msk                             (0x00001000UL)  /*!< BLUE INTERRUPT1ENABLEREG: TXERROR_4 (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_TXERROR_4                                 BLUE_INTERRUPT1ENABLEREG_TXERROR_4_Msk
#define BLUE_INTERRUPT1ENABLEREG_ENCERROR_Pos                              (13UL)   /*!< BLUE INTERRUPT1ENABLEREG: ENCERROR (Bit 13) */
#define BLUE_INTERRUPT1ENABLEREG_ENCERROR_Msk                              (0x00002000UL)  /*!< BLUE INTERRUPT1ENABLEREG: ENCERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_ENCERROR                                  BLUE_INTERRUPT1ENABLEREG_ENCERROR_Msk
#define BLUE_INTERRUPT1ENABLEREG_ALLTABLEREADYERROR_Pos                    (14UL)   /*!< BLUE INTERRUPT1ENABLEREG: ALLTABLEREADYERROR (Bit 14) */
#define BLUE_INTERRUPT1ENABLEREG_ALLTABLEREADYERROR_Msk                    (0x00004000UL)  /*!< BLUE INTERRUPT1ENABLEREG: ALLTABLEREADYERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_ALLTABLEREADYERROR                        BLUE_INTERRUPT1ENABLEREG_ALLTABLEREADYERROR_Msk
#define BLUE_INTERRUPT1ENABLEREG_TXDATAREADYERROR_Pos                      (15UL)   /*!< BLUE INTERRUPT1ENABLEREG: TXDATAREADYERROR (Bit 15) */
#define BLUE_INTERRUPT1ENABLEREG_TXDATAREADYERROR_Msk                      (0x00008000UL)  /*!< BLUE INTERRUPT1ENABLEREG: TXDATAREADYERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_TXDATAREADYERROR                          BLUE_INTERRUPT1ENABLEREG_TXDATAREADYERROR_Msk
#define BLUE_INTERRUPT1ENABLEREG_NOACTIVELERROR_Pos                        (16UL)   /*!< BLUE INTERRUPT1ENABLEREG: NOACTIVELERROR (Bit 16) */
#define BLUE_INTERRUPT1ENABLEREG_NOACTIVELERROR_Msk                        (0x00010000UL)  /*!< BLUE INTERRUPT1ENABLEREG: NOACTIVELERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_NOACTIVELERROR                            BLUE_INTERRUPT1ENABLEREG_NOACTIVELERROR_Msk
#define BLUE_INTERRUPT1ENABLEREG_INITDELAYERROR_Pos                        (17UL)   /*!< BLUE INTERRUPT1ENABLEREG: INITDELAYERROR (Bit 17) */
#define BLUE_INTERRUPT1ENABLEREG_INITDELAYERROR_Msk                        (0x00020000UL)  /*!< BLUE INTERRUPT1ENABLEREG: INITDELAYERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_INITDELAYERROR                            BLUE_INTERRUPT1ENABLEREG_INITDELAYERROR_Msk
#define BLUE_INTERRUPT1ENABLEREG_RCVLENGTHERROR_Pos                        (18UL)   /*!< BLUE INTERRUPT1ENABLEREG: RCVLENGTHERROR (Bit 18) */
#define BLUE_INTERRUPT1ENABLEREG_RCVLENGTHERROR_Msk                        (0x00040000UL)  /*!< BLUE INTERRUPT1ENABLEREG: RCVLENGTHERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_RCVLENGTHERROR                            BLUE_INTERRUPT1ENABLEREG_RCVLENGTHERROR_Msk
#define BLUE_INTERRUPT1ENABLEREG_SEMATIMEOUTERROR_Pos                      (19UL)   /*!< BLUE INTERRUPT1ENABLEREG: SEMATIMEOUTERROR (Bit 19) */
#define BLUE_INTERRUPT1ENABLEREG_SEMATIMEOUTERROR_Msk                      (0x00080000UL)  /*!< BLUE INTERRUPT1ENABLEREG: SEMATIMEOUTERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_SEMATIMEOUTERROR                          BLUE_INTERRUPT1ENABLEREG_SEMATIMEOUTERROR_Msk
#define BLUE_INTERRUPT1ENABLEREG_SEMAWASPREEMPT_Pos                        (20UL)   /*!< BLUE INTERRUPT1ENABLEREG: SEMAWASPREEMPT (Bit 20) */
#define BLUE_INTERRUPT1ENABLEREG_SEMAWASPREEMPT_Msk                        (0x00100000UL)  /*!< BLUE INTERRUPT1ENABLEREG: SEMAWASPREEMPT (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_SEMAWASPREEMPT                            BLUE_INTERRUPT1ENABLEREG_SEMAWASPREEMPT_Msk
#define BLUE_INTERRUPT1ENABLEREG_TXRXSKIP_Pos                              (21UL)   /*!< BLUE INTERRUPT1ENABLEREG: TXRXSKIP (Bit 21) */
#define BLUE_INTERRUPT1ENABLEREG_TXRXSKIP_Msk                              (0x00200000UL)  /*!< BLUE INTERRUPT1ENABLEREG: TXRXSKIP (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_TXRXSKIP                                  BLUE_INTERRUPT1ENABLEREG_TXRXSKIP_Msk
#define BLUE_INTERRUPT1ENABLEREG_ACTIVE2ERROR_Pos                          (22UL)   /*!< BLUE INTERRUPT1ENABLEREG: ACTIVE2ERROR (Bit 22) */
#define BLUE_INTERRUPT1ENABLEREG_ACTIVE2ERROR_Msk                          (0x00400000UL)  /*!< BLUE INTERRUPT1ENABLEREG: ACTIVE2ERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_ACTIVE2ERROR                              BLUE_INTERRUPT1ENABLEREG_ACTIVE2ERROR_Msk
#define BLUE_INTERRUPT1ENABLEREG_CONFIGERROR_Pos                           (23UL)   /*!< BLUE INTERRUPT1ENABLEREG: CONFIGERROR (Bit 23) */
#define BLUE_INTERRUPT1ENABLEREG_CONFIGERROR_Msk                           (0x00800000UL)  /*!< BLUE INTERRUPT1ENABLEREG: CONFIGERROR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_CONFIGERROR                               BLUE_INTERRUPT1ENABLEREG_CONFIGERROR_Msk
#define BLUE_INTERRUPT1ENABLEREG_TXOK_Pos                                  (24UL)   /*!< BLUE INTERRUPT1ENABLEREG: TXOK (Bit 24) */
#define BLUE_INTERRUPT1ENABLEREG_TXOK_Msk                                  (0x01000000UL)  /*!< BLUE INTERRUPT1ENABLEREG: TXOK (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_TXOK                                      BLUE_INTERRUPT1ENABLEREG_TXOK_Msk
#define BLUE_INTERRUPT1ENABLEREG_DONE_Pos                                  (25UL)   /*!< BLUE INTERRUPT1ENABLEREG: DONE (Bit 25) */
#define BLUE_INTERRUPT1ENABLEREG_DONE_Msk                                  (0x02000000UL)  /*!< BLUE INTERRUPT1ENABLEREG: DONE (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_DONE                                      BLUE_INTERRUPT1ENABLEREG_DONE_Msk
#define BLUE_INTERRUPT1ENABLEREG_RCVTIMEOUT_Pos                            (26UL)   /*!< BLUE INTERRUPT1ENABLEREG: RCVTIMEOUT (Bit 26) */
#define BLUE_INTERRUPT1ENABLEREG_RCVTIMEOUT_Msk                            (0x04000000UL)  /*!< BLUE INTERRUPT1ENABLEREG: RCVTIMEOUT (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_RCVTIMEOUT                                BLUE_INTERRUPT1ENABLEREG_RCVTIMEOUT_Msk
#define BLUE_INTERRUPT1ENABLEREG_RCVNOMD_Pos                               (27UL)   /*!< BLUE INTERRUPT1ENABLEREG: RCVNOMD (Bit 27) */
#define BLUE_INTERRUPT1ENABLEREG_RCVNOMD_Msk                               (0x08000000UL)  /*!< BLUE INTERRUPT1ENABLEREG: RCVNOMD (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_RCVNOMD                                   BLUE_INTERRUPT1ENABLEREG_RCVNOMD_Msk
#define BLUE_INTERRUPT1ENABLEREG_RCVCMD_Pos                                (28UL)   /*!< BLUE INTERRUPT1ENABLEREG: RCVCMD (Bit 28) */
#define BLUE_INTERRUPT1ENABLEREG_RCVCMD_Msk                                (0x10000000UL)  /*!< BLUE INTERRUPT1ENABLEREG: RCVCMD (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_RCVCMD                                    BLUE_INTERRUPT1ENABLEREG_RCVCMD_Msk
#define BLUE_INTERRUPT1ENABLEREG_TIMECAPTURETRIG_Pos                       (29UL)   /*!< BLUE INTERRUPT1ENABLEREG: TIMECAPTURETRIG (Bit 29) */
#define BLUE_INTERRUPT1ENABLEREG_TIMECAPTURETRIG_Msk                       (0x20000000UL)  /*!< BLUE INTERRUPT1ENABLEREG: TIMECAPTURETRIG (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_TIMECAPTURETRIG                           BLUE_INTERRUPT1ENABLEREG_TIMECAPTURETRIG_Msk
#define BLUE_INTERRUPT1ENABLEREG_RCVCRCERR_Pos                             (30UL)   /*!< BLUE INTERRUPT1ENABLEREG: RCVCRCERR (Bit 30) */
#define BLUE_INTERRUPT1ENABLEREG_RCVCRCERR_Msk                             (0x40000000UL)  /*!< BLUE INTERRUPT1ENABLEREG: RCVCRCERR (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_RCVCRCERR                                 BLUE_INTERRUPT1ENABLEREG_RCVCRCERR_Msk
#define BLUE_INTERRUPT1ENABLEREG_RCVOK_Pos                                 (31UL)   /*!< BLUE INTERRUPT1ENABLEREG: RCVOK (Bit 31) */
#define BLUE_INTERRUPT1ENABLEREG_RCVOK_Msk                                 (0x80000000UL)  /*!< BLUE INTERRUPT1ENABLEREG: RCVOK (Bitfield-Mask: 0x1) */
#define BLUE_INTERRUPT1ENABLEREG_RCVOK                                     BLUE_INTERRUPT1ENABLEREG_RCVOK_Msk

/* ===============================================   INTERRUPT1LATENCYREG   =============================================== */
#define BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_Pos                    (0UL)   /*!< BLUE INTERRUPT1LATENCYREG: INTERRUPT1LATENCY (Bit 0) */
#define BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_Msk                    (0x000000ffUL)  /*!< BLUE INTERRUPT1LATENCYREG: INTERRUPT1LATENCY (Bitfield-Mask: 0xff) */
#define BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY                        BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_Msk
#define BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_0                      (0x01 << BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_Pos)   /*!<0x00000001 */
#define BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_1                      (0x02 << BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_Pos)   /*!<0x00000002 */
#define BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_2                      (0x04 << BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_Pos)   /*!<0x00000004 */
#define BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_3                      (0x08 << BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_Pos)   /*!<0x00000008 */
#define BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_4                      (0x10 << BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_Pos)   /*!<0x00000010 */
#define BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_5                      (0x20 << BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_Pos)   /*!<0x00000020 */
#define BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_6                      (0x40 << BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_Pos)   /*!<0x00000040 */
#define BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_7                      (0x80 << BLUE_INTERRUPT1LATENCYREG_INTERRUPT1LATENCY_Pos)   /*!<0x00000080 */

/* ===============================================   MANAESKEY0REG   =============================================== */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos                              (0UL)   /*!< BLUE MANAESKEY0REG: MANAESKEY_31_0 (Bit 0) */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_Msk                              (0xffffffffUL)  /*!< BLUE MANAESKEY0REG: MANAESKEY_31_0 (Bitfield-Mask: 0xffffffffL) */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0                                  BLUE_MANAESKEY0REG_MANAESKEY_31_0_Msk
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_0                                (0x00000001 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00000001 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_1                                (0x00000002 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00000002 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_2                                (0x00000004 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00000004 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_3                                (0x00000008 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00000008 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_4                                (0x00000010 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00000010 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_5                                (0x00000020 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00000020 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_6                                (0x00000040 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00000040 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_7                                (0x00000080 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00000080 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_8                                (0x00000100 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00000100 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_9                                (0x00000200 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00000200 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_10                               (0x00000400 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00000400 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_11                               (0x00000800 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00000800 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_12                               (0x00001000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00001000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_13                               (0x00002000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00002000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_14                               (0x00004000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00004000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_15                               (0x00008000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00008000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_16                               (0x00010000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00010000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_17                               (0x00020000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00020000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_18                               (0x00040000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00040000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_19                               (0x00080000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00080000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_20                               (0x00100000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00100000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_21                               (0x00200000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00200000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_22                               (0x00400000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00400000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_23                               (0x00800000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x00800000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_24                               (0x01000000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x01000000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_25                               (0x02000000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x02000000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_26                               (0x04000000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x04000000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_27                               (0x08000000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x08000000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_28                               (0x10000000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x10000000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_29                               (0x20000000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x20000000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_30                               (0x40000000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x40000000 */
#define BLUE_MANAESKEY0REG_MANAESKEY_31_0_31                               (0x80000000 << BLUE_MANAESKEY0REG_MANAESKEY_31_0_Pos)   /*!<0x80000000 */

/* ===============================================   MANAESKEY1REG   =============================================== */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos                             (0UL)   /*!< BLUE MANAESKEY1REG: MANAESKEY_63_32 (Bit 0) */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_Msk                             (0xffffffffUL)  /*!< BLUE MANAESKEY1REG: MANAESKEY_63_32 (Bitfield-Mask: 0xffffffffL) */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32                                 BLUE_MANAESKEY1REG_MANAESKEY_63_32_Msk
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_0                               (0x00000001 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00000001 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_1                               (0x00000002 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00000002 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_2                               (0x00000004 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00000004 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_3                               (0x00000008 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00000008 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_4                               (0x00000010 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00000010 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_5                               (0x00000020 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00000020 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_6                               (0x00000040 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00000040 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_7                               (0x00000080 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00000080 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_8                               (0x00000100 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00000100 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_9                               (0x00000200 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00000200 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_10                              (0x00000400 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00000400 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_11                              (0x00000800 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00000800 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_12                              (0x00001000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00001000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_13                              (0x00002000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00002000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_14                              (0x00004000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00004000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_15                              (0x00008000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00008000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_16                              (0x00010000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00010000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_17                              (0x00020000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00020000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_18                              (0x00040000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00040000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_19                              (0x00080000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00080000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_20                              (0x00100000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00100000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_21                              (0x00200000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00200000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_22                              (0x00400000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00400000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_23                              (0x00800000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x00800000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_24                              (0x01000000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x01000000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_25                              (0x02000000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x02000000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_26                              (0x04000000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x04000000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_27                              (0x08000000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x08000000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_28                              (0x10000000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x10000000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_29                              (0x20000000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x20000000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_30                              (0x40000000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x40000000 */
#define BLUE_MANAESKEY1REG_MANAESKEY_63_32_31                              (0x80000000 << BLUE_MANAESKEY1REG_MANAESKEY_63_32_Pos)   /*!<0x80000000 */

