stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* ===============================================   MANAESKEY2REG   =============================================== */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos                             (0UL)   /*!< BLUE MANAESKEY2REG: MANAESKEY_95_64 (Bit 0) */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_Msk                             (0xffffffffUL)  /*!< BLUE MANAESKEY2REG: MANAESKEY_95_64 (Bitfield-Mask: 0xffffffffL) */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64                                 BLUE_MANAESKEY2REG_MANAESKEY_95_64_Msk
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_0                               (0x00000001 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00000001 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_1                               (0x00000002 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00000002 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_2                               (0x00000004 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00000004 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_3                               (0x00000008 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00000008 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_4                               (0x00000010 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00000010 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_5                               (0x00000020 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00000020 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_6                               (0x00000040 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00000040 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_7                               (0x00000080 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00000080 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_8                               (0x00000100 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00000100 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_9                               (0x00000200 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00000200 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_10                              (0x00000400 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00000400 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_11                              (0x00000800 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00000800 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_12                              (0x00001000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00001000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_13                              (0x00002000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00002000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_14                              (0x00004000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00004000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_15                              (0x00008000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00008000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_16                              (0x00010000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00010000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_17                              (0x00020000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00020000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_18                              (0x00040000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00040000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_19                              (0x00080000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00080000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_20                              (0x00100000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00100000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_21                              (0x00200000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00200000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_22                              (0x00400000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00400000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_23                              (0x00800000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x00800000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_24                              (0x01000000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x01000000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_25                              (0x02000000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x02000000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_26                              (0x04000000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x04000000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_27                              (0x08000000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x08000000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_28                              (0x10000000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x10000000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_29                              (0x20000000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x20000000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_30                              (0x40000000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x40000000 */
#define BLUE_MANAESKEY2REG_MANAESKEY_95_64_31                              (0x80000000 << BLUE_MANAESKEY2REG_MANAESKEY_95_64_Pos)   /*!<0x80000000 */

/* ===============================================   MANAESKEY3REG   =============================================== */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos                            (0UL)   /*!< BLUE MANAESKEY3REG: MANAESKEY_127_96 (Bit 0) */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_Msk                            (0xffffffffUL)  /*!< BLUE MANAESKEY3REG: MANAESKEY_127_96 (Bitfield-Mask: 0xffffffffL) */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96                                BLUE_MANAESKEY3REG_MANAESKEY_127_96_Msk
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_0                              (0x00000001 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00000001 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_1                              (0x00000002 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00000002 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_2                              (0x00000004 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00000004 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_3                              (0x00000008 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00000008 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_4                              (0x00000010 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00000010 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_5                              (0x00000020 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00000020 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_6                              (0x00000040 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00000040 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_7                              (0x00000080 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00000080 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_8                              (0x00000100 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00000100 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_9                              (0x00000200 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00000200 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_10                             (0x00000400 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00000400 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_11                             (0x00000800 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00000800 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_12                             (0x00001000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00001000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_13                             (0x00002000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00002000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_14                             (0x00004000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00004000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_15                             (0x00008000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00008000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_16                             (0x00010000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00010000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_17                             (0x00020000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00020000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_18                             (0x00040000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00040000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_19                             (0x00080000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00080000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_20                             (0x00100000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00100000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_21                             (0x00200000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00200000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_22                             (0x00400000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00400000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_23                             (0x00800000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x00800000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_24                             (0x01000000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x01000000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_25                             (0x02000000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x02000000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_26                             (0x04000000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x04000000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_27                             (0x08000000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x08000000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_28                             (0x10000000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x10000000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_29                             (0x20000000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x20000000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_30                             (0x40000000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x40000000 */
#define BLUE_MANAESKEY3REG_MANAESKEY_127_96_31                             (0x80000000 << BLUE_MANAESKEY3REG_MANAESKEY_127_96_Pos)   /*!<0x80000000 */

