stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* ===============================================   MANAESCIPHERTEXT2REG   =============================================== */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos                     (0UL)   /*!< BLUE MANAESCIPHERTEXT2REG: AES_CIPHER_95_64 (Bit 0) */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Msk                     (0xffffffffUL)  /*!< BLUE MANAESCIPHERTEXT2REG: AES_CIPHER_95_64 (Bitfield-Mask: 0xffffffffL) */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64                         BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Msk
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_0                       (0x00000001 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00000001 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_1                       (0x00000002 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00000002 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_2                       (0x00000004 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00000004 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_3                       (0x00000008 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00000008 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_4                       (0x00000010 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00000010 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_5                       (0x00000020 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00000020 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_6                       (0x00000040 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00000040 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_7                       (0x00000080 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00000080 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_8                       (0x00000100 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00000100 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_9                       (0x00000200 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00000200 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_10                      (0x00000400 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00000400 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_11                      (0x00000800 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00000800 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_12                      (0x00001000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00001000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_13                      (0x00002000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00002000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_14                      (0x00004000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00004000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_15                      (0x00008000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00008000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_16                      (0x00010000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00010000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_17                      (0x00020000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00020000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_18                      (0x00040000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00040000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_19                      (0x00080000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00080000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_20                      (0x00100000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00100000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_21                      (0x00200000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00200000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_22                      (0x00400000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00400000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_23                      (0x00800000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x00800000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_24                      (0x01000000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x01000000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_25                      (0x02000000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x02000000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_26                      (0x04000000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x04000000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_27                      (0x08000000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x08000000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_28                      (0x10000000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x10000000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_29                      (0x20000000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x20000000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_30                      (0x40000000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x40000000 */
#define BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_31                      (0x80000000 << BLUE_MANAESCIPHERTEXT2REG_AES_CIPHER_95_64_Pos)   /*!<0x80000000 */

/* ===============================================   MANAESCIPHERTEXT3REG   =============================================== */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos                    (0UL)   /*!< BLUE MANAESCIPHERTEXT3REG: AES_CIPHER_127_96 (Bit 0) */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Msk                    (0xffffffffUL)  /*!< BLUE MANAESCIPHERTEXT3REG: AES_CIPHER_127_96 (Bitfield-Mask: 0xffffffffL) */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96                        BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Msk
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_0                      (0x00000001 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00000001 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_1                      (0x00000002 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00000002 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_2                      (0x00000004 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00000004 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_3                      (0x00000008 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00000008 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_4                      (0x00000010 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00000010 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_5                      (0x00000020 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00000020 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_6                      (0x00000040 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00000040 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_7                      (0x00000080 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00000080 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_8                      (0x00000100 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00000100 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_9                      (0x00000200 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00000200 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_10                     (0x00000400 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00000400 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_11                     (0x00000800 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00000800 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_12                     (0x00001000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00001000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_13                     (0x00002000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00002000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_14                     (0x00004000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00004000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_15                     (0x00008000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00008000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_16                     (0x00010000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00010000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_17                     (0x00020000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00020000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_18                     (0x00040000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00040000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_19                     (0x00080000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00080000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_20                     (0x00100000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00100000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_21                     (0x00200000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00200000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_22                     (0x00400000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00400000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_23                     (0x00800000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x00800000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_24                     (0x01000000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x01000000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_25                     (0x02000000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x02000000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_26                     (0x04000000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x04000000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_27                     (0x08000000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x08000000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_28                     (0x10000000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x10000000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_29                     (0x20000000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x20000000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_30                     (0x40000000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x40000000 */
#define BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_31                     (0x80000000 << BLUE_MANAESCIPHERTEXT3REG_AES_CIPHER_127_96_Pos)   /*!<0x80000000 */

/* ===============================================   MANAESCMDREG   =============================================== */
#define BLUE_MANAESCMDREG_START_Pos                                        (0UL)   /*!< BLUE MANAESCMDREG: START (Bit 0) */
#define BLUE_MANAESCMDREG_START_Msk                                        (0x00000001UL)  /*!< BLUE MANAESCMDREG: START (Bitfield-Mask: 0x1) */
#define BLUE_MANAESCMDREG_START                                            BLUE_MANAESCMDREG_START_Msk
#define BLUE_MANAESCMDREG_INTENA_Pos                                       (1UL)   /*!< BLUE MANAESCMDREG: INTENA (Bit 1) */
#define BLUE_MANAESCMDREG_INTENA_Msk                                       (0x00000002UL)  /*!< BLUE MANAESCMDREG: INTENA (Bitfield-Mask: 0x1) */
#define BLUE_MANAESCMDREG_INTENA                                           BLUE_MANAESCMDREG_INTENA_Msk

/* ===============================================   MANAESSTATREG   =============================================== */
#define BLUE_MANAESSTATREG_BUSY_Pos                                        (0UL)   /*!< BLUE MANAESSTATREG: BUSY (Bit 0) */
#define BLUE_MANAESSTATREG_BUSY_Msk                                        (0x00000001UL)  /*!< BLUE MANAESSTATREG: BUSY (Bitfield-Mask: 0x1) */
#define BLUE_MANAESSTATREG_BUSY                                            BLUE_MANAESSTATREG_BUSY_Msk

/* ===============================================   AESLEPRIVPOINTERREG   =============================================== */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_Pos                               (0UL)   /*!< BLUE AESLEPRIVPOINTERREG: POINTER (Bit 0) */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_Msk                               (0x00ffffffUL)  /*!< BLUE AESLEPRIVPOINTERREG: POINTER (Bitfield-Mask: 0xffffff) */
#define BLUE_AESLEPRIVPOINTERREG_POINTER                                   BLUE_AESLEPRIVPOINTERREG_POINTER_Msk
#define BLUE_AESLEPRIVPOINTERREG_POINTER_0                                 (0x000001 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00000001 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_1                                 (0x000002 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00000002 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_2                                 (0x000004 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00000004 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_3                                 (0x000008 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00000008 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_4                                 (0x000010 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00000010 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_5                                 (0x000020 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00000020 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_6                                 (0x000040 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00000040 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_7                                 (0x000080 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00000080 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_8                                 (0x000100 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00000100 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_9                                 (0x000200 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00000200 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_10                                (0x000400 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00000400 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_11                                (0x000800 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00000800 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_12                                (0x001000 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00001000 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_13                                (0x002000 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00002000 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_14                                (0x004000 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00004000 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_15                                (0x008000 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00008000 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_16                                (0x010000 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00010000 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_17                                (0x020000 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00020000 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_18                                (0x040000 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00040000 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_19                                (0x080000 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00080000 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_20                                (0x100000 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00100000 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_21                                (0x200000 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00200000 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_22                                (0x400000 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00400000 */
#define BLUE_AESLEPRIVPOINTERREG_POINTER_23                                (0x800000 << BLUE_AESLEPRIVPOINTERREG_POINTER_Pos)   /*!<0x00800000 */

/* ===============================================   AESLEPRIVHASHREG   =============================================== */
#define BLUE_AESLEPRIVHASHREG_HASH_Pos                                     (0UL)   /*!< BLUE AESLEPRIVHASHREG: HASH (Bit 0) */
#define BLUE_AESLEPRIVHASHREG_HASH_Msk                                     (0x00ffffffUL)  /*!< BLUE AESLEPRIVHASHREG: HASH (Bitfield-Mask: 0xffffff) */
#define BLUE_AESLEPRIVHASHREG_HASH                                         BLUE_AESLEPRIVHASHREG_HASH_Msk
#define BLUE_AESLEPRIVHASHREG_HASH_0                                       (0x000001 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00000001 */
#define BLUE_AESLEPRIVHASHREG_HASH_1                                       (0x000002 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00000002 */
#define BLUE_AESLEPRIVHASHREG_HASH_2                                       (0x000004 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00000004 */
#define BLUE_AESLEPRIVHASHREG_HASH_3                                       (0x000008 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00000008 */
#define BLUE_AESLEPRIVHASHREG_HASH_4                                       (0x000010 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00000010 */
#define BLUE_AESLEPRIVHASHREG_HASH_5                                       (0x000020 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00000020 */
#define BLUE_AESLEPRIVHASHREG_HASH_6                                       (0x000040 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00000040 */
#define BLUE_AESLEPRIVHASHREG_HASH_7                                       (0x000080 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00000080 */
#define BLUE_AESLEPRIVHASHREG_HASH_8                                       (0x000100 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00000100 */
#define BLUE_AESLEPRIVHASHREG_HASH_9                                       (0x000200 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00000200 */
#define BLUE_AESLEPRIVHASHREG_HASH_10                                      (0x000400 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00000400 */
#define BLUE_AESLEPRIVHASHREG_HASH_11                                      (0x000800 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00000800 */
#define BLUE_AESLEPRIVHASHREG_HASH_12                                      (0x001000 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00001000 */
#define BLUE_AESLEPRIVHASHREG_HASH_13                                      (0x002000 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00002000 */
#define BLUE_AESLEPRIVHASHREG_HASH_14                                      (0x004000 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00004000 */
#define BLUE_AESLEPRIVHASHREG_HASH_15                                      (0x008000 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00008000 */
#define BLUE_AESLEPRIVHASHREG_HASH_16                                      (0x010000 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00010000 */
#define BLUE_AESLEPRIVHASHREG_HASH_17                                      (0x020000 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00020000 */
#define BLUE_AESLEPRIVHASHREG_HASH_18                                      (0x040000 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00040000 */
#define BLUE_AESLEPRIVHASHREG_HASH_19                                      (0x080000 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00080000 */
#define BLUE_AESLEPRIVHASHREG_HASH_20                                      (0x100000 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00100000 */
#define BLUE_AESLEPRIVHASHREG_HASH_21                                      (0x200000 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00200000 */
#define BLUE_AESLEPRIVHASHREG_HASH_22                                      (0x400000 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00400000 */
#define BLUE_AESLEPRIVHASHREG_HASH_23                                      (0x800000 << BLUE_AESLEPRIVHASHREG_HASH_Pos)   /*!<0x00800000 */

