stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* ===============================================   AESLEPRIVPRANDREG   =============================================== */
#define BLUE_AESLEPRIVPRANDREG_PRAND_Pos                                   (0UL)   /*!< BLUE AESLEPRIVPRANDREG: PRAND (Bit 0) */
#define BLUE_AESLEPRIVPRANDREG_PRAND_Msk                                   (0x00ffffffUL)  /*!< BLUE AESLEPRIVPRANDREG: PRAND (Bitfield-Mask: 0xffffff) */
#define BLUE_AESLEPRIVPRANDREG_PRAND                                       BLUE_AESLEPRIVPRANDREG_PRAND_Msk
#define BLUE_AESLEPRIVPRANDREG_PRAND_0                                     (0x000001 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00000001 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_1                                     (0x000002 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00000002 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_2                                     (0x000004 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00000004 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_3                                     (0x000008 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00000008 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_4                                     (0x000010 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00000010 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_5                                     (0x000020 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00000020 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_6                                     (0x000040 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00000040 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_7                                     (0x000080 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00000080 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_8                                     (0x000100 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00000100 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_9                                     (0x000200 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00000200 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_10                                    (0x000400 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00000400 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_11                                    (0x000800 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00000800 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_12                                    (0x001000 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00001000 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_13                                    (0x002000 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00002000 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_14                                    (0x004000 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00004000 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_15                                    (0x008000 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00008000 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_16                                    (0x010000 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00010000 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_17                                    (0x020000 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00020000 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_18                                    (0x040000 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00040000 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_19                                    (0x080000 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00080000 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_20                                    (0x100000 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00100000 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_21                                    (0x200000 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00200000 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_22                                    (0x400000 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00400000 */
#define BLUE_AESLEPRIVPRANDREG_PRAND_23                                    (0x800000 << BLUE_AESLEPRIVPRANDREG_PRAND_Pos)   /*!<0x00800000 */

/* ===============================================   AESLEPRIVCMDREG   =============================================== */
#define BLUE_AESLEPRIVCMDREG_START_Pos                                     (0UL)   /*!< BLUE AESLEPRIVCMDREG: START (Bit 0) */
#define BLUE_AESLEPRIVCMDREG_START_Msk                                     (0x00000001UL)  /*!< BLUE AESLEPRIVCMDREG: START (Bitfield-Mask: 0x1) */
#define BLUE_AESLEPRIVCMDREG_START                                         BLUE_AESLEPRIVCMDREG_START_Msk
#define BLUE_AESLEPRIVCMDREG_INTENA_Pos                                    (1UL)   /*!< BLUE AESLEPRIVCMDREG: INTENA (Bit 1) */
#define BLUE_AESLEPRIVCMDREG_INTENA_Msk                                    (0x00000002UL)  /*!< BLUE AESLEPRIVCMDREG: INTENA (Bitfield-Mask: 0x1) */
#define BLUE_AESLEPRIVCMDREG_INTENA                                        BLUE_AESLEPRIVCMDREG_INTENA_Msk
#define BLUE_AESLEPRIVCMDREG_NBKEYS_Pos                                    (2UL)   /*!< BLUE AESLEPRIVCMDREG: NBKEYS (Bit 2) */
#define BLUE_AESLEPRIVCMDREG_NBKEYS_Msk                                    (0x000003fcUL)  /*!< BLUE AESLEPRIVCMDREG: NBKEYS (Bitfield-Mask: 0xff) */
#define BLUE_AESLEPRIVCMDREG_NBKEYS                                        BLUE_AESLEPRIVCMDREG_NBKEYS_Msk
#define BLUE_AESLEPRIVCMDREG_NBKEYS_0                                      (0x01 << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)   /*!<0x00000004 */
#define BLUE_AESLEPRIVCMDREG_NBKEYS_1                                      (0x02 << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)   /*!<0x00000008 */
#define BLUE_AESLEPRIVCMDREG_NBKEYS_2                                      (0x04 << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)   /*!<0x00000010 */
#define BLUE_AESLEPRIVCMDREG_NBKEYS_3                                      (0x08 << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)   /*!<0x00000020 */
#define BLUE_AESLEPRIVCMDREG_NBKEYS_4                                      (0x10 << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)   /*!<0x00000040 */
#define BLUE_AESLEPRIVCMDREG_NBKEYS_5                                      (0x20 << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)   /*!<0x00000080 */
#define BLUE_AESLEPRIVCMDREG_NBKEYS_6                                      (0x40 << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)   /*!<0x00000100 */
#define BLUE_AESLEPRIVCMDREG_NBKEYS_7                                      (0x80 << BLUE_AESLEPRIVCMDREG_NBKEYS_Pos)   /*!<0x00000200 */

/* ===============================================   AESLEPRIVSTATREG   =============================================== */
#define BLUE_AESLEPRIVSTATREG_BUSY_Pos                                     (0UL)   /*!< BLUE AESLEPRIVSTATREG: BUSY (Bit 0) */
#define BLUE_AESLEPRIVSTATREG_BUSY_Msk                                     (0x00000001UL)  /*!< BLUE AESLEPRIVSTATREG: BUSY (Bitfield-Mask: 0x1) */
#define BLUE_AESLEPRIVSTATREG_BUSY                                         BLUE_AESLEPRIVSTATREG_BUSY_Msk
#define BLUE_AESLEPRIVSTATREG_KEYFND_Pos                                   (1UL)   /*!< BLUE AESLEPRIVSTATREG: KEYFND (Bit 1) */
#define BLUE_AESLEPRIVSTATREG_KEYFND_Msk                                   (0x00000002UL)  /*!< BLUE AESLEPRIVSTATREG: KEYFND (Bitfield-Mask: 0x1) */
#define BLUE_AESLEPRIVSTATREG_KEYFND                                       BLUE_AESLEPRIVSTATREG_KEYFND_Msk
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos                              (2UL)   /*!< BLUE AESLEPRIVSTATREG: KEYFNDINDEX (Bit 2) */
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Msk                              (0x000003fcUL)  /*!< BLUE AESLEPRIVSTATREG: KEYFNDINDEX (Bitfield-Mask: 0xff) */
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX                                  BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Msk
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_0                                (0x01 << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)   /*!<0x00000004 */
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_1                                (0x02 << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)   /*!<0x00000008 */
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_2                                (0x04 << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)   /*!<0x00000010 */
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_3                                (0x08 << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)   /*!<0x00000020 */
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_4                                (0x10 << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)   /*!<0x00000040 */
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_5                                (0x20 << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)   /*!<0x00000080 */
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_6                                (0x40 << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)   /*!<0x00000100 */
#define BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_7                                (0x80 << BLUE_AESLEPRIVSTATREG_KEYFNDINDEX_Pos)   /*!<0x00000200 */

/* ===============================================   DEBUGCMDREG   =============================================== */
#define BLUE_DEBUGCMDREG_CLEARDEBUGINT_Pos                                 (0UL)   /*!< BLUE DEBUGCMDREG: CLEARDEBUGINT (Bit 0) */
#define BLUE_DEBUGCMDREG_CLEARDEBUGINT_Msk                                 (0x00000001UL)  /*!< BLUE DEBUGCMDREG: CLEARDEBUGINT (Bitfield-Mask: 0x1) */
#define BLUE_DEBUGCMDREG_CLEARDEBUGINT                                     BLUE_DEBUGCMDREG_CLEARDEBUGINT_Msk
#define BLUE_DEBUGCMDREG_SEQDEBUGMODE_Pos                                  (1UL)   /*!< BLUE DEBUGCMDREG: SEQDEBUGMODE (Bit 1) */
#define BLUE_DEBUGCMDREG_SEQDEBUGMODE_Msk                                  (0x00000002UL)  /*!< BLUE DEBUGCMDREG: SEQDEBUGMODE (Bitfield-Mask: 0x1) */
#define BLUE_DEBUGCMDREG_SEQDEBUGMODE                                      BLUE_DEBUGCMDREG_SEQDEBUGMODE_Msk
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Pos                                (2UL)   /*!< BLUE DEBUGCMDREG: SEQDEBUGBUSSEL (Bit 2) */
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Msk                                (0x0000003cUL)  /*!< BLUE DEBUGCMDREG: SEQDEBUGBUSSEL (Bitfield-Mask: 0xf) */
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL                                    BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Msk
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_0                                  (0x1 << BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Pos)   /*!<0x00000004 */
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_1                                  (0x2 << BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Pos)   /*!<0x00000008 */
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_2                                  (0x4 << BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Pos)   /*!<0x00000010 */
#define BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_3                                  (0x8 << BLUE_DEBUGCMDREG_SEQDEBUGBUSSEL_Pos)   /*!<0x00000020 */
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_Pos                                  (16UL)   /*!< BLUE DEBUGCMDREG: AESDEBUGMODE (Bit 16) */
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_Msk                                  (0x000f0000UL)  /*!< BLUE DEBUGCMDREG: AESDEBUGMODE (Bitfield-Mask: 0xf) */
#define BLUE_DEBUGCMDREG_AESDEBUGMODE                                      BLUE_DEBUGCMDREG_AESDEBUGMODE_Msk
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_0                                    (0x1 << BLUE_DEBUGCMDREG_AESDEBUGMODE_Pos)   /*!<0x00010000 */
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_1                                    (0x2 << BLUE_DEBUGCMDREG_AESDEBUGMODE_Pos)   /*!<0x00020000 */
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_2                                    (0x4 << BLUE_DEBUGCMDREG_AESDEBUGMODE_Pos)   /*!<0x00040000 */
#define BLUE_DEBUGCMDREG_AESDEBUGMODE_3                                    (0x8 << BLUE_DEBUGCMDREG_AESDEBUGMODE_Pos)   /*!<0x00080000 */

