stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* ===============================================   AVERAGE_PERIOD_LENGTH   =============================================== */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_Pos                      (0UL)   /*!< WAKEUP AVERAGE_PERIOD_LENGTH: LENGTH_FRACT (Bit 0) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_Msk                      (0x0000000fUL)  /*!< WAKEUP AVERAGE_PERIOD_LENGTH: LENGTH_FRACT (Bitfield-Mask: 0xf) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT                          WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_Msk
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_0                        (0x1 << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_Pos)   /*!<0x00000001 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_1                        (0x2 << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_Pos)   /*!<0x00000002 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_2                        (0x4 << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_Pos)   /*!<0x00000004 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_3                        (0x8 << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_FRACT_Pos)   /*!<0x00000008 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos                        (4UL)   /*!< WAKEUP AVERAGE_PERIOD_LENGTH: LENGTH_INT (Bit 4) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Msk                        (0x00003ff0UL)  /*!< WAKEUP AVERAGE_PERIOD_LENGTH: LENGTH_INT (Bitfield-Mask: 0x3ff) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT                            WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Msk
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_0                          (0x01 << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)   /*!<0x00000010 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_1                          (0x02 << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)   /*!<0x00000020 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_2                          (0x04 << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)   /*!<0x00000040 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_3                          (0x08 << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)   /*!<0x00000080 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_4                          (0x10 << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)   /*!<0x00000100 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_5                          (0x20 << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)   /*!<0x00000200 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_6                          (0x40 << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)   /*!<0x00000400 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_7                          (0x80 << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)   /*!<0x00000800 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_8                          (0x100 << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)   /*!<0x00001000 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_9                          (0x200 << WAKEUP_AVERAGE_PERIOD_LENGTH_LENGTH_INT_Pos)   /*!<0x00002000 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos                     (24UL)   /*!< WAKEUP AVERAGE_PERIOD_LENGTH: AVERAGE_COUNT (Bit 24) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Msk                     (0xff000000UL)  /*!< WAKEUP AVERAGE_PERIOD_LENGTH: AVERAGE_COUNT (Bitfield-Mask: 0xff) */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT                         WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Msk
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_0                       (0x01 << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)   /*!<0x01000000 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_1                       (0x02 << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)   /*!<0x02000000 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_2                       (0x04 << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)   /*!<0x04000000 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_3                       (0x08 << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)   /*!<0x08000000 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_4                       (0x10 << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)   /*!<0x10000000 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_5                       (0x20 << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)   /*!<0x20000000 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_6                       (0x40 << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)   /*!<0x40000000 */
#define WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_7                       (0x80 << WAKEUP_AVERAGE_PERIOD_LENGTH_AVERAGE_COUNT_Pos)   /*!<0x80000000 */

/* ===============================================   MAXIMUM_PERIOD_LENGTH   =============================================== */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos                            (4UL)   /*!< WAKEUP MAXIMUM_PERIOD_LENGTH: LENGTH (Bit 4) */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Msk                            (0x00003ff0UL)  /*!< WAKEUP MAXIMUM_PERIOD_LENGTH: LENGTH (Bitfield-Mask: 0x3ff) */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH                                WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Msk
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_0                              (0x01 << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00000010 */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_1                              (0x02 << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00000020 */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_2                              (0x04 << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00000040 */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_3                              (0x08 << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00000080 */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_4                              (0x10 << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00000100 */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_5                              (0x20 << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00000200 */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_6                              (0x40 << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00000400 */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_7                              (0x80 << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00000800 */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_8                              (0x100 << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00001000 */
#define WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_9                              (0x200 << WAKEUP_MAXIMUM_PERIOD_LENGTH_LENGTH_Pos)   /*!<0x00002000 */

