stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* ===============================================   STATISTICS_RESTART   =============================================== */
#define WAKEUP_STATISTICS_RESTART_CLR_MIN_MAX_Pos                          (0UL)   /*!< WAKEUP STATISTICS_RESTART: CLR_MIN_MAX (Bit 0) */
#define WAKEUP_STATISTICS_RESTART_CLR_MIN_MAX_Msk                          (0x00000001UL)  /*!< WAKEUP STATISTICS_RESTART: CLR_MIN_MAX (Bitfield-Mask: 0x1) */
#define WAKEUP_STATISTICS_RESTART_CLR_MIN_MAX                              WAKEUP_STATISTICS_RESTART_CLR_MIN_MAX_Msk
#define WAKEUP_STATISTICS_RESTART_CLR_AVR_Pos                              (1UL)   /*!< WAKEUP STATISTICS_RESTART: CLR_AVR (Bit 1) */
#define WAKEUP_STATISTICS_RESTART_CLR_AVR_Msk                              (0x00000002UL)  /*!< WAKEUP STATISTICS_RESTART: CLR_AVR (Bitfield-Mask: 0x1) */
#define WAKEUP_STATISTICS_RESTART_CLR_AVR                                  WAKEUP_STATISTICS_RESTART_CLR_AVR_Msk

/* ===============================================   BLUE_WAKEUP_TIME   =============================================== */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos                            (0UL)   /*!< WAKEUP BLUE_WAKEUP_TIME: WAKEUP_TIME (Bit 0) */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Msk                            (0xffffffffUL)  /*!< WAKEUP BLUE_WAKEUP_TIME: WAKEUP_TIME (Bitfield-Mask: 0xffffffffL) */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME                                WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Msk
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_0                              (0x00000001 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000001 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_1                              (0x00000002 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000002 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_2                              (0x00000004 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000004 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_3                              (0x00000008 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000008 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_4                              (0x00000010 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000010 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_5                              (0x00000020 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000020 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_6                              (0x00000040 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000040 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_7                              (0x00000080 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000080 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_8                              (0x00000100 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000100 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_9                              (0x00000200 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000200 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_10                             (0x00000400 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000400 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_11                             (0x00000800 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00000800 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_12                             (0x00001000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00001000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_13                             (0x00002000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00002000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_14                             (0x00004000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00004000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_15                             (0x00008000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00008000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_16                             (0x00010000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00010000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_17                             (0x00020000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00020000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_18                             (0x00040000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00040000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_19                             (0x00080000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00080000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_20                             (0x00100000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00100000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_21                             (0x00200000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00200000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_22                             (0x00400000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00400000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_23                             (0x00800000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x00800000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_24                             (0x01000000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x01000000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_25                             (0x02000000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x02000000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_26                             (0x04000000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x04000000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_27                             (0x08000000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x08000000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_28                             (0x10000000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x10000000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_29                             (0x20000000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x20000000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_30                             (0x40000000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x40000000 */
#define WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_31                             (0x80000000 << WAKEUP_BLUE_WAKEUP_TIME_WAKEUP_TIME_Pos)   /*!<0x80000000 */

/* ===============================================   BLUE_SLEEP_REQUEST_MODE   =============================================== */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Pos                  (0UL)   /*!< WAKEUP BLUE_SLEEP_REQUEST_MODE: SLEEP_REQ_MODE (Bit 0) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Msk                  (0x00000007UL)  /*!< WAKEUP BLUE_SLEEP_REQUEST_MODE: SLEEP_REQ_MODE (Bitfield-Mask: 0x7) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE                      WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Msk
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_0                    (0x1 << WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Pos)   /*!<0x00000001 */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_1                    (0x2 << WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Pos)   /*!<0x00000002 */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_2                    (0x4 << WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_REQ_MODE_Pos)   /*!<0x00000004 */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_EN_Pos                        (29UL)   /*!< WAKEUP BLUE_SLEEP_REQUEST_MODE: SLEEP_EN (Bit 29) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_EN_Msk                        (0x20000000UL)  /*!< WAKEUP BLUE_SLEEP_REQUEST_MODE: SLEEP_EN (Bitfield-Mask: 0x1) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_EN                            WAKEUP_BLUE_SLEEP_REQUEST_MODE_SLEEP_EN_Msk
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_BLE_WAKEUP_EN_Pos                   (30UL)   /*!< WAKEUP BLUE_SLEEP_REQUEST_MODE: BLE_WAKEUP_EN (Bit 30) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_BLE_WAKEUP_EN_Msk                   (0x40000000UL)  /*!< WAKEUP BLUE_SLEEP_REQUEST_MODE: BLE_WAKEUP_EN (Bitfield-Mask: 0x1) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_BLE_WAKEUP_EN                       WAKEUP_BLUE_SLEEP_REQUEST_MODE_BLE_WAKEUP_EN_Msk
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Pos                  (31UL)   /*!< WAKEUP BLUE_SLEEP_REQUEST_MODE: FORCE_SLEEPING (Bit 31) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Msk                  (0x80000000UL)  /*!< WAKEUP BLUE_SLEEP_REQUEST_MODE: FORCE_SLEEPING (Bitfield-Mask: 0x1) */
#define WAKEUP_BLUE_SLEEP_REQUEST_MODE_FORCE_SLEEPING                      WAKEUP_BLUE_SLEEP_REQUEST_MODE_FORCE_SLEEPING_Msk

