stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* ===============================================   CLK32FREQUENCY_REG   =============================================== */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos                   (0UL)   /*!< RADIO_CTRL CLK32FREQUENCY_REG: SLOW_FREQUENCY (Bit 0) */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Msk                   (0x07ffffffUL)  /*!< RADIO_CTRL CLK32FREQUENCY_REG: SLOW_FREQUENCY (Bitfield-Mask: 0x7ffffff) */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY                       RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Msk
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_0                     (0x000001 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00000001 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_1                     (0x000002 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00000002 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_2                     (0x000004 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00000004 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_3                     (0x000008 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00000008 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_4                     (0x000010 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00000010 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_5                     (0x000020 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00000020 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_6                     (0x000040 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00000040 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_7                     (0x000080 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00000080 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_8                     (0x000100 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00000100 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_9                     (0x000200 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00000200 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_10                    (0x000400 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00000400 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_11                    (0x000800 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00000800 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_12                    (0x001000 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00001000 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_13                    (0x002000 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00002000 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_14                    (0x004000 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00004000 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_15                    (0x008000 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00008000 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_16                    (0x010000 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00010000 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_17                    (0x020000 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00020000 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_18                    (0x040000 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00040000 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_19                    (0x080000 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00080000 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_20                    (0x100000 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00100000 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_21                    (0x200000 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00200000 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_22                    (0x400000 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00400000 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_23                    (0x800000 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x00800000 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_24                    (0x1000000 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x01000000 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_25                    (0x2000000 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x02000000 */
#define RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_26                    (0x4000000 << RADIO_CTRL_CLK32FREQUENCY_REG_SLOW_FREQUENCY_Pos)   /*!<0x04000000 */

/* ===============================================   RADIO_CONTROL_IRQ_STATUS   =============================================== */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_SLOW_CLK_IRQ_Pos                (0UL)   /*!< RADIO_CTRL RADIO_CONTROL_IRQ_STATUS: SLOW_CLK_IRQ (Bit 0) */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_SLOW_CLK_IRQ_Msk                (0x00000001UL)  /*!< RADIO_CTRL RADIO_CONTROL_IRQ_STATUS: SLOW_CLK_IRQ (Bitfield-Mask: 0x1) */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_SLOW_CLK_IRQ                    RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_SLOW_CLK_IRQ_Msk
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Pos              (8UL)   /*!< RADIO_CTRL RADIO_CONTROL_IRQ_STATUS: RADIO_FSM_IRQ (Bit 8) */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Msk              (0x00003f00UL)  /*!< RADIO_CTRL RADIO_CONTROL_IRQ_STATUS: RADIO_FSM_IRQ (Bitfield-Mask: 0x3f) */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ                  RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Msk
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_0                (0x1 << RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Pos)   /*!<0x00000100 */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_1                (0x2 << RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Pos)   /*!<0x00000200 */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_2                (0x4 << RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Pos)   /*!<0x00000400 */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_3                (0x8 << RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Pos)   /*!<0x00000800 */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_4                (0x10 << RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Pos)   /*!<0x00001000 */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_5                (0x20 << RADIO_CTRL_RADIO_CONTROL_IRQ_STATUS_RADIO_FSM_IRQ_Pos)   /*!<0x00002000 */

/* ===============================================   RADIO_CONTROL_IRQ_ENABLE   =============================================== */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_SLOW_CLK_IRQ_MASK_Pos          (0UL)   /*!< RADIO_CTRL RADIO_CONTROL_IRQ_ENABLE: SLOW_CLK_IRQ_MASK (Bit 0) */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_SLOW_CLK_IRQ_MASK_Msk          (0x00000001UL)  /*!< RADIO_CTRL RADIO_CONTROL_IRQ_ENABLE: SLOW_CLK_IRQ_MASK (Bitfield-Mask: 0x1) */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_SLOW_CLK_IRQ_MASK              RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_SLOW_CLK_IRQ_MASK_Msk
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Pos         (8UL)   /*!< RADIO_CTRL RADIO_CONTROL_IRQ_ENABLE: RADIO_FSM_IRQ_MASK (Bit 8) */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Msk         (0x00003f00UL)  /*!< RADIO_CTRL RADIO_CONTROL_IRQ_ENABLE: RADIO_FSM_IRQ_MASK (Bitfield-Mask: 0x3f) */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK             RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Msk
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_0           (0x1 << RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Pos)   /*!<0x00000100 */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_1           (0x2 << RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Pos)   /*!<0x00000200 */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_2           (0x4 << RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Pos)   /*!<0x00000400 */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_3           (0x8 << RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Pos)   /*!<0x00000800 */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_4           (0x10 << RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Pos)   /*!<0x00001000 */
#define RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_5           (0x20 << RADIO_CTRL_RADIO_CONTROL_IRQ_ENABLE_RADIO_FSM_IRQ_MASK_Pos)   /*!<0x00002000 */


/* =========================================================================================================================== */
/* ================                                     RRM                                                   ================ */
/* =========================================================================================================================== */


/* ===============================================   RRM_ID   =============================================== */
#define RRM_RRM_ID_IDENTIFICATION_Pos                                      (0UL)   /*!< RRM RRM_ID: IDENTIFICATION (Bit 0) */
#define RRM_RRM_ID_IDENTIFICATION_Msk                                      (0x0000000fUL)  /*!< RRM RRM_ID: IDENTIFICATION (Bitfield-Mask: 0xf) */
#define RRM_RRM_ID_IDENTIFICATION                                          RRM_RRM_ID_IDENTIFICATION_Msk
#define RRM_RRM_ID_IDENTIFICATION_0                                        (0x1 << RRM_RRM_ID_IDENTIFICATION_Pos)   /*!<0x00000001 */
#define RRM_RRM_ID_IDENTIFICATION_1                                        (0x2 << RRM_RRM_ID_IDENTIFICATION_Pos)   /*!<0x00000002 */
#define RRM_RRM_ID_IDENTIFICATION_2                                        (0x4 << RRM_RRM_ID_IDENTIFICATION_Pos)   /*!<0x00000004 */
#define RRM_RRM_ID_IDENTIFICATION_3                                        (0x8 << RRM_RRM_ID_IDENTIFICATION_Pos)   /*!<0x00000008 */

/* ===============================================   RRM_CTRL   =============================================== */
#define RRM_RRM_CTRL_PRIORITY_Pos                                          (0UL)   /*!< RRM RRM_CTRL: PRIORITY (Bit 0) */
#define RRM_RRM_CTRL_PRIORITY_Msk                                          (0x00000003UL)  /*!< RRM RRM_CTRL: PRIORITY (Bitfield-Mask: 0x3) */
#define RRM_RRM_CTRL_PRIORITY                                              RRM_RRM_CTRL_PRIORITY_Msk
#define RRM_RRM_CTRL_PRIORITY_0                                            (0x1 << RRM_RRM_CTRL_PRIORITY_Pos)   /*!<0x00000001 */
#define RRM_RRM_CTRL_PRIORITY_1                                            (0x2 << RRM_RRM_CTRL_PRIORITY_Pos)   /*!<0x00000002 */

/* ===============================================   UDRA_CTRL0   =============================================== */
#define RRM_UDRA_CTRL0_RELOAD_RDCFGPTR_Pos                                 (0UL)   /*!< RRM UDRA_CTRL0: RELOAD_RDCFGPTR (Bit 0) */
#define RRM_UDRA_CTRL0_RELOAD_RDCFGPTR_Msk                                 (0x00000001UL)  /*!< RRM UDRA_CTRL0: RELOAD_RDCFGPTR (Bitfield-Mask: 0x1) */
#define RRM_UDRA_CTRL0_RELOAD_RDCFGPTR                                     RRM_UDRA_CTRL0_RELOAD_RDCFGPTR_Msk

/* ===============================================   UDRA_IRQ_ENABLE   =============================================== */
#define RRM_UDRA_IRQ_ENABLE_RADIO_CFG_PTR_RELOADED_Pos                     (0UL)   /*!< RRM UDRA_IRQ_ENABLE: RADIO_CFG_PTR_RELOADED (Bit 0) */
#define RRM_UDRA_IRQ_ENABLE_RADIO_CFG_PTR_RELOADED_Msk                     (0x00000001UL)  /*!< RRM UDRA_IRQ_ENABLE: RADIO_CFG_PTR_RELOADED (Bitfield-Mask: 0x1) */
#define RRM_UDRA_IRQ_ENABLE_RADIO_CFG_PTR_RELOADED                         RRM_UDRA_IRQ_ENABLE_RADIO_CFG_PTR_RELOADED_Msk
#define RRM_UDRA_IRQ_ENABLE_CMD_START_Pos                                  (1UL)   /*!< RRM UDRA_IRQ_ENABLE: CMD_START (Bit 1) */
#define RRM_UDRA_IRQ_ENABLE_CMD_START_Msk                                  (0x00000002UL)  /*!< RRM UDRA_IRQ_ENABLE: CMD_START (Bitfield-Mask: 0x1) */
#define RRM_UDRA_IRQ_ENABLE_CMD_START                                      RRM_UDRA_IRQ_ENABLE_CMD_START_Msk
#define RRM_UDRA_IRQ_ENABLE_CMD_END_Pos                                    (2UL)   /*!< RRM UDRA_IRQ_ENABLE: CMD_END (Bit 2) */
#define RRM_UDRA_IRQ_ENABLE_CMD_END_Msk                                    (0x00000004UL)  /*!< RRM UDRA_IRQ_ENABLE: CMD_END (Bitfield-Mask: 0x1) */
#define RRM_UDRA_IRQ_ENABLE_CMD_END                                        RRM_UDRA_IRQ_ENABLE_CMD_END_Msk
#define RRM_UDRA_IRQ_ENABLE_CMD_NUMBER_ERROR_Pos                           (3UL)   /*!< RRM UDRA_IRQ_ENABLE: CMD_NUMBER_ERROR (Bit 3) */
#define RRM_UDRA_IRQ_ENABLE_CMD_NUMBER_ERROR_Msk                           (0x00000008UL)  /*!< RRM UDRA_IRQ_ENABLE: CMD_NUMBER_ERROR (Bitfield-Mask: 0x1) */
#define RRM_UDRA_IRQ_ENABLE_CMD_NUMBER_ERROR                               RRM_UDRA_IRQ_ENABLE_CMD_NUMBER_ERROR_Msk

/* ===============================================   UDRA_IRQ_STATUS   =============================================== */
#define RRM_UDRA_IRQ_STATUS_RADIO_CFG_PTR_RELOADED_Pos                     (0UL)   /*!< RRM UDRA_IRQ_STATUS: RADIO_CFG_PTR_RELOADED (Bit 0) */
#define RRM_UDRA_IRQ_STATUS_RADIO_CFG_PTR_RELOADED_Msk                     (0x00000001UL)  /*!< RRM UDRA_IRQ_STATUS: RADIO_CFG_PTR_RELOADED (Bitfield-Mask: 0x1) */
#define RRM_UDRA_IRQ_STATUS_RADIO_CFG_PTR_RELOADED                         RRM_UDRA_IRQ_STATUS_RADIO_CFG_PTR_RELOADED_Msk
#define RRM_UDRA_IRQ_STATUS_CMD_START_Pos                                  (1UL)   /*!< RRM UDRA_IRQ_STATUS: CMD_START (Bit 1) */
#define RRM_UDRA_IRQ_STATUS_CMD_START_Msk                                  (0x00000002UL)  /*!< RRM UDRA_IRQ_STATUS: CMD_START (Bitfield-Mask: 0x1) */
#define RRM_UDRA_IRQ_STATUS_CMD_START                                      RRM_UDRA_IRQ_STATUS_CMD_START_Msk
#define RRM_UDRA_IRQ_STATUS_CMD_END_Pos                                    (2UL)   /*!< RRM UDRA_IRQ_STATUS: CMD_END (Bit 2) */
#define RRM_UDRA_IRQ_STATUS_CMD_END_Msk                                    (0x00000004UL)  /*!< RRM UDRA_IRQ_STATUS: CMD_END (Bitfield-Mask: 0x1) */
#define RRM_UDRA_IRQ_STATUS_CMD_END                                        RRM_UDRA_IRQ_STATUS_CMD_END_Msk
#define RRM_UDRA_IRQ_STATUS_CMD_NUMBER_ERROR_Pos                           (3UL)   /*!< RRM UDRA_IRQ_STATUS: CMD_NUMBER_ERROR (Bit 3) */
#define RRM_UDRA_IRQ_STATUS_CMD_NUMBER_ERROR_Msk                           (0x00000008UL)  /*!< RRM UDRA_IRQ_STATUS: CMD_NUMBER_ERROR (Bitfield-Mask: 0x1) */
#define RRM_UDRA_IRQ_STATUS_CMD_NUMBER_ERROR                               RRM_UDRA_IRQ_STATUS_CMD_NUMBER_ERROR_Msk

/* ===============================================   UDRA_RADIO_CFG_PTR   =============================================== */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos                    (0UL)   /*!< RRM UDRA_RADIO_CFG_PTR: RADIO_CONFIG_ADDRESS (Bit 0) */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Msk                    (0xffffffffUL)  /*!< RRM UDRA_RADIO_CFG_PTR: RADIO_CONFIG_ADDRESS (Bitfield-Mask: 0xffffffffL) */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS                        RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Msk
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_0                      (0x00000001 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00000001 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_1                      (0x00000002 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00000002 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_2                      (0x00000004 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00000004 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_3                      (0x00000008 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00000008 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_4                      (0x00000010 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00000010 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_5                      (0x00000020 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00000020 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_6                      (0x00000040 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00000040 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_7                      (0x00000080 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00000080 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_8                      (0x00000100 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00000100 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_9                      (0x00000200 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00000200 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_10                     (0x00000400 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00000400 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_11                     (0x00000800 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00000800 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_12                     (0x00001000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00001000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_13                     (0x00002000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00002000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_14                     (0x00004000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00004000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_15                     (0x00008000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00008000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_16                     (0x00010000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00010000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_17                     (0x00020000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00020000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_18                     (0x00040000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00040000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_19                     (0x00080000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00080000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_20                     (0x00100000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00100000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_21                     (0x00200000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00200000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_22                     (0x00400000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00400000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_23                     (0x00800000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x00800000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_24                     (0x01000000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x01000000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_25                     (0x02000000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x02000000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_26                     (0x04000000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x04000000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_27                     (0x08000000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x08000000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_28                     (0x10000000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x10000000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_29                     (0x20000000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x20000000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_30                     (0x40000000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x40000000 */
#define RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_31                     (0x80000000 << RRM_UDRA_RADIO_CFG_PTR_RADIO_CONFIG_ADDRESS_Pos)   /*!<0x80000000 */

/* ===============================================   SEMA_IRQ_ENABLE   =============================================== */
#define RRM_SEMA_IRQ_ENABLE_LOCK_Pos                                       (0UL)   /*!< RRM SEMA_IRQ_ENABLE: LOCK (Bit 0) */
#define RRM_SEMA_IRQ_ENABLE_LOCK_Msk                                       (0x00000001UL)  /*!< RRM SEMA_IRQ_ENABLE: LOCK (Bitfield-Mask: 0x1) */
#define RRM_SEMA_IRQ_ENABLE_LOCK                                           RRM_SEMA_IRQ_ENABLE_LOCK_Msk
#define RRM_SEMA_IRQ_ENABLE_UNLOCK_Pos                                     (1UL)   /*!< RRM SEMA_IRQ_ENABLE: UNLOCK (Bit 1) */
#define RRM_SEMA_IRQ_ENABLE_UNLOCK_Msk                                     (0x00000002UL)  /*!< RRM SEMA_IRQ_ENABLE: UNLOCK (Bitfield-Mask: 0x1) */
#define RRM_SEMA_IRQ_ENABLE_UNLOCK                                         RRM_SEMA_IRQ_ENABLE_UNLOCK_Msk

/* ===============================================   SEMA_IRQ_STATUS   =============================================== */
#define RRM_SEMA_IRQ_STATUS_LOCK_Pos                                       (0UL)   /*!< RRM SEMA_IRQ_STATUS: LOCK (Bit 0) */
#define RRM_SEMA_IRQ_STATUS_LOCK_Msk                                       (0x00000001UL)  /*!< RRM SEMA_IRQ_STATUS: LOCK (Bitfield-Mask: 0x1) */
#define RRM_SEMA_IRQ_STATUS_LOCK                                           RRM_SEMA_IRQ_STATUS_LOCK_Msk
#define RRM_SEMA_IRQ_STATUS_UNLOCK_Pos                                     (1UL)   /*!< RRM SEMA_IRQ_STATUS: UNLOCK (Bit 1) */
#define RRM_SEMA_IRQ_STATUS_UNLOCK_Msk                                     (0x00000002UL)  /*!< RRM SEMA_IRQ_STATUS: UNLOCK (Bitfield-Mask: 0x1) */
#define RRM_SEMA_IRQ_STATUS_UNLOCK                                         RRM_SEMA_IRQ_STATUS_UNLOCK_Msk

