stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* ===============================================   BLE_IRQ_ENABLE   =============================================== */
#define RRM_BLE_IRQ_ENABLE_PORT_GRANT_Pos                                  (0UL)   /*!< RRM BLE_IRQ_ENABLE: PORT_GRANT (Bit 0) */
#define RRM_BLE_IRQ_ENABLE_PORT_GRANT_Msk                                  (0x00000001UL)  /*!< RRM BLE_IRQ_ENABLE: PORT_GRANT (Bitfield-Mask: 0x1) */
#define RRM_BLE_IRQ_ENABLE_PORT_GRANT                                      RRM_BLE_IRQ_ENABLE_PORT_GRANT_Msk
#define RRM_BLE_IRQ_ENABLE_PORT_RELEASE_Pos                                (1UL)   /*!< RRM BLE_IRQ_ENABLE: PORT_RELEASE (Bit 1) */
#define RRM_BLE_IRQ_ENABLE_PORT_RELEASE_Msk                                (0x00000002UL)  /*!< RRM BLE_IRQ_ENABLE: PORT_RELEASE (Bitfield-Mask: 0x1) */
#define RRM_BLE_IRQ_ENABLE_PORT_RELEASE                                    RRM_BLE_IRQ_ENABLE_PORT_RELEASE_Msk
#define RRM_BLE_IRQ_ENABLE_PORT_PREEMPT_Pos                                (2UL)   /*!< RRM BLE_IRQ_ENABLE: PORT_PREEMPT (Bit 2) */
#define RRM_BLE_IRQ_ENABLE_PORT_PREEMPT_Msk                                (0x00000004UL)  /*!< RRM BLE_IRQ_ENABLE: PORT_PREEMPT (Bitfield-Mask: 0x1) */
#define RRM_BLE_IRQ_ENABLE_PORT_PREEMPT                                    RRM_BLE_IRQ_ENABLE_PORT_PREEMPT_Msk
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_START_Pos                              (3UL)   /*!< RRM BLE_IRQ_ENABLE: PORT_CMD_START (Bit 3) */
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_START_Msk                              (0x00000008UL)  /*!< RRM BLE_IRQ_ENABLE: PORT_CMD_START (Bitfield-Mask: 0x1) */
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_START                                  RRM_BLE_IRQ_ENABLE_PORT_CMD_START_Msk
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_END_Pos                                (4UL)   /*!< RRM BLE_IRQ_ENABLE: PORT_CMD_END (Bit 4) */
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_END_Msk                                (0x00000010UL)  /*!< RRM BLE_IRQ_ENABLE: PORT_CMD_END (Bitfield-Mask: 0x1) */
#define RRM_BLE_IRQ_ENABLE_PORT_CMD_END                                    RRM_BLE_IRQ_ENABLE_PORT_CMD_END_Msk

/* ===============================================   BLE_IRQ_STATUS   =============================================== */
#define RRM_BLE_IRQ_STATUS_PORT_GRANT_Pos                                  (0UL)   /*!< RRM BLE_IRQ_STATUS: PORT_GRANT (Bit 0) */
#define RRM_BLE_IRQ_STATUS_PORT_GRANT_Msk                                  (0x00000001UL)  /*!< RRM BLE_IRQ_STATUS: PORT_GRANT (Bitfield-Mask: 0x1) */
#define RRM_BLE_IRQ_STATUS_PORT_GRANT                                      RRM_BLE_IRQ_STATUS_PORT_GRANT_Msk
#define RRM_BLE_IRQ_STATUS_PORT_RELEASE_Pos                                (1UL)   /*!< RRM BLE_IRQ_STATUS: PORT_RELEASE (Bit 1) */
#define RRM_BLE_IRQ_STATUS_PORT_RELEASE_Msk                                (0x00000002UL)  /*!< RRM BLE_IRQ_STATUS: PORT_RELEASE (Bitfield-Mask: 0x1) */
#define RRM_BLE_IRQ_STATUS_PORT_RELEASE                                    RRM_BLE_IRQ_STATUS_PORT_RELEASE_Msk
#define RRM_BLE_IRQ_STATUS_PORT_PREEMPT_Pos                                (2UL)   /*!< RRM BLE_IRQ_STATUS: PORT_PREEMPT (Bit 2) */
#define RRM_BLE_IRQ_STATUS_PORT_PREEMPT_Msk                                (0x00000004UL)  /*!< RRM BLE_IRQ_STATUS: PORT_PREEMPT (Bitfield-Mask: 0x1) */
#define RRM_BLE_IRQ_STATUS_PORT_PREEMPT                                    RRM_BLE_IRQ_STATUS_PORT_PREEMPT_Msk
#define RRM_BLE_IRQ_STATUS_CMD_START_Pos                                   (3UL)   /*!< RRM BLE_IRQ_STATUS: CMD_START (Bit 3) */
#define RRM_BLE_IRQ_STATUS_CMD_START_Msk                                   (0x00000008UL)  /*!< RRM BLE_IRQ_STATUS: CMD_START (Bitfield-Mask: 0x1) */
#define RRM_BLE_IRQ_STATUS_CMD_START                                       RRM_BLE_IRQ_STATUS_CMD_START_Msk
#define RRM_BLE_IRQ_STATUS_CMD_END_Pos                                     (4UL)   /*!< RRM BLE_IRQ_STATUS: CMD_END (Bit 4) */
#define RRM_BLE_IRQ_STATUS_CMD_END_Msk                                     (0x00000010UL)  /*!< RRM BLE_IRQ_STATUS: CMD_END (Bitfield-Mask: 0x1) */
#define RRM_BLE_IRQ_STATUS_CMD_END                                         RRM_BLE_IRQ_STATUS_CMD_END_Msk

/* ===============================================   VP_CPU_CMD_BUS   =============================================== */
#define RRM_VP_CPU_CMD_BUS_COMMAND_Pos                                     (0UL)   /*!< RRM VP_CPU_CMD_BUS: COMMAND (Bit 0) */
#define RRM_VP_CPU_CMD_BUS_COMMAND_Msk                                     (0x00000007UL)  /*!< RRM VP_CPU_CMD_BUS: COMMAND (Bitfield-Mask: 0x7) */
#define RRM_VP_CPU_CMD_BUS_COMMAND                                         RRM_VP_CPU_CMD_BUS_COMMAND_Msk
#define RRM_VP_CPU_CMD_BUS_COMMAND_0                                       (0x1 << RRM_VP_CPU_CMD_BUS_COMMAND_Pos)   /*!<0x00000001 */
#define RRM_VP_CPU_CMD_BUS_COMMAND_1                                       (0x2 << RRM_VP_CPU_CMD_BUS_COMMAND_Pos)   /*!<0x00000002 */
#define RRM_VP_CPU_CMD_BUS_COMMAND_2                                       (0x4 << RRM_VP_CPU_CMD_BUS_COMMAND_Pos)   /*!<0x00000004 */
#define RRM_VP_CPU_CMD_BUS_COMMAND_REQ_Pos                                 (3UL)   /*!< RRM VP_CPU_CMD_BUS: COMMAND_REQ (Bit 3) */
#define RRM_VP_CPU_CMD_BUS_COMMAND_REQ_Msk                                 (0x00000008UL)  /*!< RRM VP_CPU_CMD_BUS: COMMAND_REQ (Bitfield-Mask: 0x1) */
#define RRM_VP_CPU_CMD_BUS_COMMAND_REQ                                     RRM_VP_CPU_CMD_BUS_COMMAND_REQ_Msk

/* ===============================================   VP_CPU_SEMA_BUS   =============================================== */
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Pos                                  (0UL)   /*!< RRM VP_CPU_SEMA_BUS: TAKE_PRIO (Bit 0) */
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Msk                                  (0x00000007UL)  /*!< RRM VP_CPU_SEMA_BUS: TAKE_PRIO (Bitfield-Mask: 0x7) */
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO                                      RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Msk
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_0                                    (0x1 << RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Pos)   /*!<0x00000001 */
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_1                                    (0x2 << RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Pos)   /*!<0x00000002 */
#define RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_2                                    (0x4 << RRM_VP_CPU_SEMA_BUS_TAKE_PRIO_Pos)   /*!<0x00000004 */
#define RRM_VP_CPU_SEMA_BUS_TAKE_REQ_Pos                                   (3UL)   /*!< RRM VP_CPU_SEMA_BUS: TAKE_REQ (Bit 3) */
#define RRM_VP_CPU_SEMA_BUS_TAKE_REQ_Msk                                   (0x00000008UL)  /*!< RRM VP_CPU_SEMA_BUS: TAKE_REQ (Bitfield-Mask: 0x1) */
#define RRM_VP_CPU_SEMA_BUS_TAKE_REQ                                       RRM_VP_CPU_SEMA_BUS_TAKE_REQ_Msk
#define RRM_VP_CPU_SEMA_BUS_TAKE_PREEMPT_Pos                               (4UL)   /*!< RRM VP_CPU_SEMA_BUS: TAKE_PREEMPT (Bit 4) */
#define RRM_VP_CPU_SEMA_BUS_TAKE_PREEMPT_Msk                               (0x00000010UL)  /*!< RRM VP_CPU_SEMA_BUS: TAKE_PREEMPT (Bitfield-Mask: 0x1) */
#define RRM_VP_CPU_SEMA_BUS_TAKE_PREEMPT                                   RRM_VP_CPU_SEMA_BUS_TAKE_PREEMPT_Msk

/* ===============================================   VP_CPU_IRQ_ENABLE   =============================================== */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_GRANT_Pos                               (0UL)   /*!< RRM VP_CPU_IRQ_ENABLE: PORT_GRANT (Bit 0) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_GRANT_Msk                               (0x00000001UL)  /*!< RRM VP_CPU_IRQ_ENABLE: PORT_GRANT (Bitfield-Mask: 0x1) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_GRANT                                   RRM_VP_CPU_IRQ_ENABLE_PORT_GRANT_Msk
#define RRM_VP_CPU_IRQ_ENABLE_PORT_RELEASE_Pos                             (1UL)   /*!< RRM VP_CPU_IRQ_ENABLE: PORT_RELEASE (Bit 1) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_RELEASE_Msk                             (0x00000002UL)  /*!< RRM VP_CPU_IRQ_ENABLE: PORT_RELEASE (Bitfield-Mask: 0x1) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_RELEASE                                 RRM_VP_CPU_IRQ_ENABLE_PORT_RELEASE_Msk
#define RRM_VP_CPU_IRQ_ENABLE_PORT_PREEMPT_Pos                             (2UL)   /*!< RRM VP_CPU_IRQ_ENABLE: PORT_PREEMPT (Bit 2) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_PREEMPT_Msk                             (0x00000004UL)  /*!< RRM VP_CPU_IRQ_ENABLE: PORT_PREEMPT (Bitfield-Mask: 0x1) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_PREEMPT                                 RRM_VP_CPU_IRQ_ENABLE_PORT_PREEMPT_Msk
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_START_Pos                           (3UL)   /*!< RRM VP_CPU_IRQ_ENABLE: PORT_CMD_START (Bit 3) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_START_Msk                           (0x00000008UL)  /*!< RRM VP_CPU_IRQ_ENABLE: PORT_CMD_START (Bitfield-Mask: 0x1) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_START                               RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_START_Msk
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_END_Pos                             (4UL)   /*!< RRM VP_CPU_IRQ_ENABLE: PORT_CMD_END (Bit 4) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_END_Msk                             (0x00000010UL)  /*!< RRM VP_CPU_IRQ_ENABLE: PORT_CMD_END (Bitfield-Mask: 0x1) */
#define RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_END                                 RRM_VP_CPU_IRQ_ENABLE_PORT_CMD_END_Msk

/* ===============================================   VP_CPU_IRQ_STATUS   =============================================== */
#define RRM_VP_CPU_IRQ_STATUS_PORT_GRANT_Pos                               (0UL)   /*!< RRM VP_CPU_IRQ_STATUS: PORT_GRANT (Bit 0) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_GRANT_Msk                               (0x00000001UL)  /*!< RRM VP_CPU_IRQ_STATUS: PORT_GRANT (Bitfield-Mask: 0x1) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_GRANT                                   RRM_VP_CPU_IRQ_STATUS_PORT_GRANT_Msk
#define RRM_VP_CPU_IRQ_STATUS_PORT_RELEASE_Pos                             (1UL)   /*!< RRM VP_CPU_IRQ_STATUS: PORT_RELEASE (Bit 1) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_RELEASE_Msk                             (0x00000002UL)  /*!< RRM VP_CPU_IRQ_STATUS: PORT_RELEASE (Bitfield-Mask: 0x1) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_RELEASE                                 RRM_VP_CPU_IRQ_STATUS_PORT_RELEASE_Msk
#define RRM_VP_CPU_IRQ_STATUS_PORT_PREEMPT_Pos                             (2UL)   /*!< RRM VP_CPU_IRQ_STATUS: PORT_PREEMPT (Bit 2) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_PREEMPT_Msk                             (0x00000004UL)  /*!< RRM VP_CPU_IRQ_STATUS: PORT_PREEMPT (Bitfield-Mask: 0x1) */
#define RRM_VP_CPU_IRQ_STATUS_PORT_PREEMPT                                 RRM_VP_CPU_IRQ_STATUS_PORT_PREEMPT_Msk
#define RRM_VP_CPU_IRQ_STATUS_CMD_START_Pos                                (3UL)   /*!< RRM VP_CPU_IRQ_STATUS: CMD_START (Bit 3) */
#define RRM_VP_CPU_IRQ_STATUS_CMD_START_Msk                                (0x00000008UL)  /*!< RRM VP_CPU_IRQ_STATUS: CMD_START (Bitfield-Mask: 0x1) */
#define RRM_VP_CPU_IRQ_STATUS_CMD_START                                    RRM_VP_CPU_IRQ_STATUS_CMD_START_Msk
#define RRM_VP_CPU_IRQ_STATUS_CMD_END_Pos                                  (4UL)   /*!< RRM VP_CPU_IRQ_STATUS: CMD_END (Bit 4) */
#define RRM_VP_CPU_IRQ_STATUS_CMD_END_Msk                                  (0x00000010UL)  /*!< RRM VP_CPU_IRQ_STATUS: CMD_END (Bitfield-Mask: 0x1) */
#define RRM_VP_CPU_IRQ_STATUS_CMD_END                                      RRM_VP_CPU_IRQ_STATUS_CMD_END_Msk

