stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* ===============================================   PHYCTRL_DIG_USR   =============================================== */
#define RRM_PHYCTRL_DIG_USR_RXTXPHY_Pos                                    (0UL)   /*!< RRM PHYCTRL_DIG_USR: RXTXPHY (Bit 0) */
#define RRM_PHYCTRL_DIG_USR_RXTXPHY_Msk                                    (0x00000007UL)  /*!< RRM PHYCTRL_DIG_USR: RXTXPHY (Bitfield-Mask: 0x7) */
#define RRM_PHYCTRL_DIG_USR_RXTXPHY                                        RRM_PHYCTRL_DIG_USR_RXTXPHY_Msk
#define RRM_PHYCTRL_DIG_USR_RXTXPHY_0                                      (0x1 << RRM_PHYCTRL_DIG_USR_RXTXPHY_Pos)   /*!<0x00000001 */
#define RRM_PHYCTRL_DIG_USR_RXTXPHY_1                                      (0x2 << RRM_PHYCTRL_DIG_USR_RXTXPHY_Pos)   /*!<0x00000002 */
#define RRM_PHYCTRL_DIG_USR_RXTXPHY_2                                      (0x4 << RRM_PHYCTRL_DIG_USR_RXTXPHY_Pos)   /*!<0x00000004 */
#define RRM_PHYCTRL_DIG_USR_SPARE_Pos                                      (3UL)   /*!< RRM PHYCTRL_DIG_USR: SPARE (Bit 3) */
#define RRM_PHYCTRL_DIG_USR_SPARE_Msk                                      (0x000000F8UL)  /*!< RRM PHYCTRL_DIG_USR: SPARE (Bitfield-Mask: 0x1F) */
#define RRM_PHYCTRL_DIG_USR_SPARE                                          RRM_PHYCTRL_DIG_USR_SPARE_Msk

/* ===============================================   AFC0_DIG_ENG   =============================================== */
#define RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_Pos                                (0UL)   /*!< RRM AFC0_DIG_ENG: AFC_GAIN_AFTER (Bit 0) */
#define RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_Msk                                (0x0000000fUL)  /*!< RRM AFC0_DIG_ENG: AFC_GAIN_AFTER (Bitfield-Mask: 0xf) */
#define RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER                                    RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_Msk
#define RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_0                                  (0x1 << RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_Pos)   /*!<0x00000001 */
#define RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_1                                  (0x2 << RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_Pos)   /*!<0x00000002 */
#define RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_2                                  (0x4 << RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_Pos)   /*!<0x00000004 */
#define RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_3                                  (0x8 << RRM_AFC0_DIG_ENG_AFC_GAIN_AFTER_Pos)   /*!<0x00000008 */
#define RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_Pos                               (4UL)   /*!< RRM AFC0_DIG_ENG: AFC_GAIN_BEFORE (Bit 4) */
#define RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_Msk                               (0x000000f0UL)  /*!< RRM AFC0_DIG_ENG: AFC_GAIN_BEFORE (Bitfield-Mask: 0xf) */
#define RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE                                   RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_Msk
#define RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_0                                 (0x1 << RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_Pos)   /*!<0x00000010 */
#define RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_1                                 (0x2 << RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_Pos)   /*!<0x00000020 */
#define RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_2                                 (0x4 << RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_Pos)   /*!<0x00000040 */
#define RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_3                                 (0x8 << RRM_AFC0_DIG_ENG_AFC_GAIN_BEFORE_Pos)   /*!<0x00000080 */

/* ===============================================   AFC1_DIG_ENG   =============================================== */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Pos                               (0UL)   /*!< RRM AFC1_DIG_ENG: AFC_DELAY_AFTER (Bit 0) */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Msk                               (0x0000000fUL)  /*!< RRM AFC1_DIG_ENG: AFC_DELAY_AFTER (Bitfield-Mask: 0xf) */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER                                   RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Msk
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_0                                 (0x1 << RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Pos)   /*!<0x00000001 */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_1                                 (0x2 << RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Pos)   /*!<0x00000002 */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_2                                 (0x4 << RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Pos)   /*!<0x00000004 */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_3                                 (0x8 << RRM_AFC1_DIG_ENG_AFC_DELAY_AFTER_Pos)   /*!<0x00000008 */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Pos                              (4UL)   /*!< RRM AFC1_DIG_ENG: AFC_DELAY_BEFORE (Bit 4) */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Msk                              (0x000000f0UL)  /*!< RRM AFC1_DIG_ENG: AFC_DELAY_BEFORE (Bitfield-Mask: 0xf) */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE                                  RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Msk
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_0                                (0x1 << RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Pos)   /*!<0x00000010 */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_1                                (0x2 << RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Pos)   /*!<0x00000020 */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_2                                (0x4 << RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Pos)   /*!<0x00000040 */
#define RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_3                                (0x8 << RRM_AFC1_DIG_ENG_AFC_DELAY_BEFORE_Pos)   /*!<0x00000080 */

/* ===============================================   AFC2_DIG_ENG   =============================================== */
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Pos                                (0UL)   /*!< RRM AFC2_DIG_ENG: AFC_FREQ_LIMIT (Bit 0) */
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Msk                                (0x0000007fUL)  /*!< RRM AFC2_DIG_ENG: AFC_FREQ_LIMIT (Bitfield-Mask: 0x7f) */
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT                                    RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Msk
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_0                                  (0x1 << RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Pos)   /*!<0x00000001 */
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_1                                  (0x2 << RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Pos)   /*!<0x00000002 */
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_2                                  (0x4 << RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Pos)   /*!<0x00000004 */
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_3                                  (0x8 << RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Pos)   /*!<0x00000008 */
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_4                                  (0x10 << RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Pos)   /*!<0x00000010 */
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_5                                  (0x20 << RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Pos)   /*!<0x00000020 */
#define RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_6                                  (0x40 << RRM_AFC2_DIG_ENG_AFC_FREQ_LIMIT_Pos)   /*!<0x00000040 */
#define RRM_AFC2_DIG_ENG_AFC_ENABLE_Pos                                    (7UL)   /*!< RRM AFC2_DIG_ENG: AFC_ENABLE (Bit 7) */
#define RRM_AFC2_DIG_ENG_AFC_ENABLE_Msk                                    (0x00000080UL)  /*!< RRM AFC2_DIG_ENG: AFC_ENABLE (Bitfield-Mask: 0x1) */
#define RRM_AFC2_DIG_ENG_AFC_ENABLE                                        RRM_AFC2_DIG_ENG_AFC_ENABLE_Msk

/* ===============================================   AFC3_DIG_ENG   =============================================== */
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos                              (0UL)   /*!< RRM AFC3_DIG_ENG: AFC_MINMAX_LIMIT (Bit 0) */
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Msk                              (0x000000ffUL)  /*!< RRM AFC3_DIG_ENG: AFC_MINMAX_LIMIT (Bitfield-Mask: 0xff) */
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT                                  RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Msk
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_0                                (0x01 << RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos)   /*!<0x00000001 */
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_1                                (0x02 << RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos)   /*!<0x00000002 */
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_2                                (0x04 << RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos)   /*!<0x00000004 */
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_3                                (0x08 << RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos)   /*!<0x00000008 */
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_4                                (0x10 << RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos)   /*!<0x00000010 */
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_5                                (0x20 << RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos)   /*!<0x00000020 */
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_6                                (0x40 << RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos)   /*!<0x00000040 */
#define RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_7                                (0x80 << RRM_AFC3_DIG_ENG_AFC_MINMAX_LIMIT_Pos)   /*!<0x00000080 */

/* ===============================================   CR0_DIG_ENG   =============================================== */
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Pos                                  (0UL)   /*!< RRM CR0_DIG_ENG: CR_GAIN_AFTER (Bit 0) */
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Msk                                  (0x0000000fUL)  /*!< RRM CR0_DIG_ENG: CR_GAIN_AFTER (Bitfield-Mask: 0xf) */
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER                                      RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Msk
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_0                                    (0x1 << RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Pos)   /*!<0x00000001 */
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_1                                    (0x2 << RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Pos)   /*!<0x00000002 */
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_2                                    (0x4 << RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Pos)   /*!<0x00000004 */
#define RRM_CR0_DIG_ENG_CR_GAIN_AFTER_3                                    (0x8 << RRM_CR0_DIG_ENG_CR_GAIN_AFTER_Pos)   /*!<0x00000008 */
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Pos                                 (4UL)   /*!< RRM CR0_DIG_ENG: CR_GAIN_BEFORE (Bit 4) */
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Msk                                 (0x000000f0UL)  /*!< RRM CR0_DIG_ENG: CR_GAIN_BEFORE (Bitfield-Mask: 0xf) */
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE                                     RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Msk
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_0                                   (0x1 << RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Pos)   /*!<0x00000010 */
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_1                                   (0x2 << RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Pos)   /*!<0x00000020 */
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_2                                   (0x4 << RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Pos)   /*!<0x00000040 */
#define RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_3                                   (0x8 << RRM_CR0_DIG_ENG_CR_GAIN_BEFORE_Pos)   /*!<0x00000080 */

