stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* ===============================================   CR0_LR   =============================================== */
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_Pos                                    (0UL)   /*!< RRM CR0_LR: CR_LR_GAIN_AFTER (Bit 0) */
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_Msk                                    (0x0000000fUL)  /*!< RRM CR0_LR: CR_LR_GAIN_AFTER (Bitfield-Mask: 0xf) */
#define RRM_CR0_LR_CR_LR_GAIN_AFTER                                        RRM_CR0_LR_CR_LR_GAIN_AFTER_Msk
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_0                                      (0x1 << RRM_CR0_LR_CR_LR_GAIN_AFTER_Pos)   /*!<0x00000001 */
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_1                                      (0x2 << RRM_CR0_LR_CR_LR_GAIN_AFTER_Pos)   /*!<0x00000002 */
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_2                                      (0x4 << RRM_CR0_LR_CR_LR_GAIN_AFTER_Pos)   /*!<0x00000004 */
#define RRM_CR0_LR_CR_LR_GAIN_AFTER_3                                      (0x8 << RRM_CR0_LR_CR_LR_GAIN_AFTER_Pos)   /*!<0x00000008 */
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_Pos                                   (4UL)   /*!< RRM CR0_LR: CR_LR_GAIN_BEFORE (Bit 4) */
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_Msk                                   (0x000000f0UL)  /*!< RRM CR0_LR: CR_LR_GAIN_BEFORE (Bitfield-Mask: 0xf) */
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE                                       RRM_CR0_LR_CR_LR_GAIN_BEFORE_Msk
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_0                                     (0x1 << RRM_CR0_LR_CR_LR_GAIN_BEFORE_Pos)   /*!<0x00000010 */
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_1                                     (0x2 << RRM_CR0_LR_CR_LR_GAIN_BEFORE_Pos)   /*!<0x00000020 */
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_2                                     (0x4 << RRM_CR0_LR_CR_LR_GAIN_BEFORE_Pos)   /*!<0x00000040 */
#define RRM_CR0_LR_CR_LR_GAIN_BEFORE_3                                     (0x8 << RRM_CR0_LR_CR_LR_GAIN_BEFORE_Pos)   /*!<0x00000080 */

/* ===============================================   VIT_CONF_DIG_ENG   =============================================== */
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos                                  (0UL)   /*!< RRM VIT_CONF_DIG_ENG: VIT_CONF (Bit 0) */
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_Msk                                  (0x000000ffUL)  /*!< RRM VIT_CONF_DIG_ENG: VIT_CONF (Bitfield-Mask: 0xff) */
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF                                      RRM_VIT_CONF_DIG_ENG_VIT_CONF_Msk
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_0                                    (0x01 << RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos)   /*!<0x00000001 */
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_1                                    (0x02 << RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos)   /*!<0x00000002 */
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_2                                    (0x04 << RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos)   /*!<0x00000004 */
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_3                                    (0x08 << RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos)   /*!<0x00000008 */
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_4                                    (0x10 << RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos)   /*!<0x00000010 */
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_5                                    (0x20 << RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos)   /*!<0x00000020 */
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_6                                    (0x40 << RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos)   /*!<0x00000040 */
#define RRM_VIT_CONF_DIG_ENG_VIT_CONF_7                                    (0x80 << RRM_VIT_CONF_DIG_ENG_VIT_CONF_Pos)   /*!<0x00000080 */

/* ===============================================   LR_PD_THR_DIG_ENG   =============================================== */
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos                                (0UL)   /*!< RRM LR_PD_THR_DIG_ENG: LR_PD_THR (Bit 0) */
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Msk                                (0x000000ffUL)  /*!< RRM LR_PD_THR_DIG_ENG: LR_PD_THR (Bitfield-Mask: 0xff) */
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR                                    RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Msk
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_0                                  (0x01 << RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos)   /*!<0x00000001 */
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_1                                  (0x02 << RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos)   /*!<0x00000002 */
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_2                                  (0x04 << RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos)   /*!<0x00000004 */
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_3                                  (0x08 << RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos)   /*!<0x00000008 */
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_4                                  (0x10 << RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos)   /*!<0x00000010 */
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_5                                  (0x20 << RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos)   /*!<0x00000020 */
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_6                                  (0x40 << RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos)   /*!<0x00000040 */
#define RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_7                                  (0x80 << RRM_LR_PD_THR_DIG_ENG_LR_PD_THR_Pos)   /*!<0x00000080 */

/* ===============================================   LR_RSSI_THR_DIG_ENG   =============================================== */
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos                            (0UL)   /*!< RRM LR_RSSI_THR_DIG_ENG: LR_RSSI_THR (Bit 0) */
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Msk                            (0x000000ffUL)  /*!< RRM LR_RSSI_THR_DIG_ENG: LR_RSSI_THR (Bitfield-Mask: 0xff) */
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR                                RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Msk
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_0                              (0x01 << RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos)   /*!<0x00000001 */
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_1                              (0x02 << RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos)   /*!<0x00000002 */
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_2                              (0x04 << RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos)   /*!<0x00000004 */
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_3                              (0x08 << RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos)   /*!<0x00000008 */
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_4                              (0x10 << RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos)   /*!<0x00000010 */
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_5                              (0x20 << RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos)   /*!<0x00000020 */
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_6                              (0x40 << RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos)   /*!<0x00000040 */
#define RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_7                              (0x80 << RRM_LR_RSSI_THR_DIG_ENG_LR_RSSI_THR_Pos)   /*!<0x00000080 */

