stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* ===============================================   AGC_DIG_OUT   =============================================== */
#define RRM_AGC_DIG_OUT_AGC_ATT_OUT_Pos                                    (0UL)   /*!< RRM AGC_DIG_OUT: AGC_ATT_OUT (Bit 0) */
#define RRM_AGC_DIG_OUT_AGC_ATT_OUT_Msk                                    (0x0000000fUL)  /*!< RRM AGC_DIG_OUT: AGC_ATT_OUT (Bitfield-Mask: 0xf) */
#define RRM_AGC_DIG_OUT_AGC_ATT_OUT                                        RRM_AGC_DIG_OUT_AGC_ATT_OUT_Msk
#define RRM_AGC_DIG_OUT_AGC_ATT_OUT_0                                      (0x1 << RRM_AGC_DIG_OUT_AGC_ATT_OUT_Pos)   /*!<0x00000001 */
#define RRM_AGC_DIG_OUT_AGC_ATT_OUT_1                                      (0x2 << RRM_AGC_DIG_OUT_AGC_ATT_OUT_Pos)   /*!<0x00000002 */
#define RRM_AGC_DIG_OUT_AGC_ATT_OUT_2                                      (0x4 << RRM_AGC_DIG_OUT_AGC_ATT_OUT_Pos)   /*!<0x00000004 */
#define RRM_AGC_DIG_OUT_AGC_ATT_OUT_3                                      (0x8 << RRM_AGC_DIG_OUT_AGC_ATT_OUT_Pos)   /*!<0x00000008 */
#define RRM_AGC_DIG_OUT_RESERVE_Pos                                        (4UL)   /*!< RRM AGC_DIG_OUT: RESERVE (Bit 4) */
#define RRM_AGC_DIG_OUT_RESERVE_Msk                                        (0x000000f0UL)  /*!< RRM AGC_DIG_OUT: RESERVE (Bitfield-Mask: 0xf) */
#define RRM_AGC_DIG_OUT_RESERVE                                            RRM_AGC_DIG_OUT_RESERVE_Msk
#define RRM_AGC_DIG_OUT_RESERVE_0                                          (0x1 << RRM_AGC_DIG_OUT_RESERVE_Pos)   /*!<0x00000010 */
#define RRM_AGC_DIG_OUT_RESERVE_1                                          (0x2 << RRM_AGC_DIG_OUT_RESERVE_Pos)   /*!<0x00000020 */
#define RRM_AGC_DIG_OUT_RESERVE_2                                          (0x4 << RRM_AGC_DIG_OUT_RESERVE_Pos)   /*!<0x00000040 */
#define RRM_AGC_DIG_OUT_RESERVE_3                                          (0x8 << RRM_AGC_DIG_OUT_RESERVE_Pos)   /*!<0x00000080 */

/* ===============================================   DEMOD_DIG_OUT   =============================================== */
#define RRM_DEMOD_DIG_OUT_CI_FIELD_Pos                                     (0UL)   /*!< RRM DEMOD_DIG_OUT: CI_FIELD (Bit 0) */
#define RRM_DEMOD_DIG_OUT_CI_FIELD_Msk                                     (0x00000003UL)  /*!< RRM DEMOD_DIG_OUT: CI_FIELD (Bitfield-Mask: 0x3) */
#define RRM_DEMOD_DIG_OUT_CI_FIELD                                         RRM_DEMOD_DIG_OUT_CI_FIELD_Msk
#define RRM_DEMOD_DIG_OUT_CI_FIELD_0                                       (0x1 << RRM_DEMOD_DIG_OUT_CI_FIELD_Pos)   /*!<0x00000001 */
#define RRM_DEMOD_DIG_OUT_CI_FIELD_1                                       (0x2 << RRM_DEMOD_DIG_OUT_CI_FIELD_Pos)   /*!<0x00000002 */
#define RRM_DEMOD_DIG_OUT_AAC_FOUND_Pos                                    (2UL)   /*!< RRM DEMOD_DIG_OUT: AAC_FOUND (Bit 2) */
#define RRM_DEMOD_DIG_OUT_AAC_FOUND_Msk                                    (0x00000004UL)  /*!< RRM DEMOD_DIG_OUT: AAC_FOUND (Bitfield-Mask: 0x1) */
#define RRM_DEMOD_DIG_OUT_AAC_FOUND                                        RRM_DEMOD_DIG_OUT_AAC_FOUND_Msk
#define RRM_DEMOD_DIG_OUT_PD_FOUND_Pos                                     (3UL)   /*!< RRM DEMOD_DIG_OUT: PD_FOUND (Bit 3) */
#define RRM_DEMOD_DIG_OUT_PD_FOUND_Msk                                     (0x00000008UL)  /*!< RRM DEMOD_DIG_OUT: PD_FOUND (Bitfield-Mask: 0x1) */
#define RRM_DEMOD_DIG_OUT_PD_FOUND                                         RRM_DEMOD_DIG_OUT_PD_FOUND_Msk
#define RRM_DEMOD_DIG_OUT_RX_END_Pos                                       (4UL)   /*!< RRM DEMOD_DIG_OUT: RX_END (Bit 4) */
#define RRM_DEMOD_DIG_OUT_RX_END_Msk                                       (0x00000010UL)  /*!< RRM DEMOD_DIG_OUT: RX_END (Bitfield-Mask: 0x1) */
#define RRM_DEMOD_DIG_OUT_RX_END                                           RRM_DEMOD_DIG_OUT_RX_END_Msk
#define RRM_DEMOD_DIG_OUT_RESERVE_Pos                                      (5UL)   /*!< RRM DEMOD_DIG_OUT: RESERVE (Bit 5) */
#define RRM_DEMOD_DIG_OUT_RESERVE_Msk                                      (0x000000e0UL)  /*!< RRM DEMOD_DIG_OUT: RESERVE (Bitfield-Mask: 0x7) */
#define RRM_DEMOD_DIG_OUT_RESERVE                                          RRM_DEMOD_DIG_OUT_RESERVE_Msk
#define RRM_DEMOD_DIG_OUT_RESERVE_0                                        (0x1 << RRM_DEMOD_DIG_OUT_RESERVE_Pos)   /*!<0x00000020 */
#define RRM_DEMOD_DIG_OUT_RESERVE_1                                        (0x2 << RRM_DEMOD_DIG_OUT_RESERVE_Pos)   /*!<0x00000040 */
#define RRM_DEMOD_DIG_OUT_RESERVE_2                                        (0x4 << RRM_DEMOD_DIG_OUT_RESERVE_Pos)   /*!<0x00000080 */

/* ===============================================   AGC0_ANA_TST   =============================================== */
#define RRM_AGC0_ANA_TST_AGC0_ANA_TST_SEL_Pos                              (0UL)   /*!< RRM AGC0_ANA_TST: AGC0_ANA_TST_SEL (Bit 0) */
#define RRM_AGC0_ANA_TST_AGC0_ANA_TST_SEL_Msk                              (0x00000001UL)  /*!< RRM AGC0_ANA_TST: AGC0_ANA_TST_SEL (Bitfield-Mask: 0x1) */
#define RRM_AGC0_ANA_TST_AGC0_ANA_TST_SEL                                  RRM_AGC0_ANA_TST_AGC0_ANA_TST_SEL_Msk
#define RRM_AGC0_ANA_TST_AGC_ANT_Pos                                       (1UL)   /*!< RRM AGC0_ANA_TST: AGC_ANT (Bit 1) */
#define RRM_AGC0_ANA_TST_AGC_ANT_Msk                                       (0x0000000eUL)  /*!< RRM AGC0_ANA_TST: AGC_ANT (Bitfield-Mask: 0x7) */
#define RRM_AGC0_ANA_TST_AGC_ANT                                           RRM_AGC0_ANA_TST_AGC_ANT_Msk
#define RRM_AGC0_ANA_TST_AGC_ANT_0                                         (0x1 << RRM_AGC0_ANA_TST_AGC_ANT_Pos)   /*!<0x00000002 */
#define RRM_AGC0_ANA_TST_AGC_ANT_1                                         (0x2 << RRM_AGC0_ANA_TST_AGC_ANT_Pos)   /*!<0x00000004 */
#define RRM_AGC0_ANA_TST_AGC_ANT_2                                         (0x4 << RRM_AGC0_ANA_TST_AGC_ANT_Pos)   /*!<0x00000008 */
#define RRM_AGC0_ANA_TST_AGC_LNA_Pos                                       (4UL)   /*!< RRM AGC0_ANA_TST: AGC_LNA (Bit 4) */
#define RRM_AGC0_ANA_TST_AGC_LNA_Msk                                       (0x00000010UL)  /*!< RRM AGC0_ANA_TST: AGC_LNA (Bitfield-Mask: 0x1) */
#define RRM_AGC0_ANA_TST_AGC_LNA                                           RRM_AGC0_ANA_TST_AGC_LNA_Msk
#define RRM_AGC0_ANA_TST_SPARE_Pos                                         (5UL)   /*!< RRM AGC0_ANA_TST: SPARE (Bit 5) */
#define RRM_AGC0_ANA_TST_SPARE_Msk                                         (0x000000e0UL)  /*!< RRM AGC0_ANA_TST: SPARE (Bitfield-Mask: 0x7) */
#define RRM_AGC0_ANA_TST_SPARE                                             RRM_AGC0_ANA_TST_SPARE_Msk

