stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WB0x/Include/stm32wb06.h
/* ===============================================   AGC18_DIG_ENG   =============================================== */
#define RRM_AGC18_DIG_ENG_ATT_8_Pos                                        (0UL)   /*!< RRM AGC18_DIG_ENG: ATT_8 (Bit 0) */
#define RRM_AGC18_DIG_ENG_ATT_8_Msk                                        (0x0000003fUL)  /*!< RRM AGC18_DIG_ENG: ATT_8 (Bitfield-Mask: 0x3f) */
#define RRM_AGC18_DIG_ENG_ATT_8                                            RRM_AGC18_DIG_ENG_ATT_8_Msk
#define RRM_AGC18_DIG_ENG_ATT_8_0                                          (0x1 << RRM_AGC18_DIG_ENG_ATT_8_Pos)   /*!<0x00000001 */
#define RRM_AGC18_DIG_ENG_ATT_8_1                                          (0x2 << RRM_AGC18_DIG_ENG_ATT_8_Pos)   /*!<0x00000002 */
#define RRM_AGC18_DIG_ENG_ATT_8_2                                          (0x4 << RRM_AGC18_DIG_ENG_ATT_8_Pos)   /*!<0x00000004 */
#define RRM_AGC18_DIG_ENG_ATT_8_3                                          (0x8 << RRM_AGC18_DIG_ENG_ATT_8_Pos)   /*!<0x00000008 */
#define RRM_AGC18_DIG_ENG_ATT_8_4                                          (0x10 << RRM_AGC18_DIG_ENG_ATT_8_Pos)   /*!<0x00000010 */
#define RRM_AGC18_DIG_ENG_ATT_8_5                                          (0x20 << RRM_AGC18_DIG_ENG_ATT_8_Pos)   /*!<0x00000020 */
#define RRM_AGC18_DIG_ENG_SPARE_Pos                                        (6UL)   /*!< RRM AGC18_DIG_ENG: SPARE (Bit 6) */
#define RRM_AGC18_DIG_ENG_SPARE_Msk                                        (0x000000c0UL)  /*!< RRM AGC18_DIG_ENG: SPARE (Bitfield-Mask: 0x3) */
#define RRM_AGC18_DIG_ENG_SPARE                                            RRM_AGC18_DIG_ENG_SPARE_Msk

/* ===============================================   AGC19_DIG_ENG   =============================================== */
#define RRM_AGC19_DIG_ENG_ATT_9_Pos                                        (0UL)   /*!< RRM AGC19_DIG_ENG: ATT_9 (Bit 0) */
#define RRM_AGC19_DIG_ENG_ATT_9_Msk                                        (0x0000003fUL)  /*!< RRM AGC19_DIG_ENG: ATT_9 (Bitfield-Mask: 0x3f) */
#define RRM_AGC19_DIG_ENG_ATT_9                                            RRM_AGC19_DIG_ENG_ATT_9_Msk
#define RRM_AGC19_DIG_ENG_ATT_9_0                                          (0x1 << RRM_AGC19_DIG_ENG_ATT_9_Pos)   /*!<0x00000001 */
#define RRM_AGC19_DIG_ENG_ATT_9_1                                          (0x2 << RRM_AGC19_DIG_ENG_ATT_9_Pos)   /*!<0x00000002 */
#define RRM_AGC19_DIG_ENG_ATT_9_2                                          (0x4 << RRM_AGC19_DIG_ENG_ATT_9_Pos)   /*!<0x00000004 */
#define RRM_AGC19_DIG_ENG_ATT_9_3                                          (0x8 << RRM_AGC19_DIG_ENG_ATT_9_Pos)   /*!<0x00000008 */
#define RRM_AGC19_DIG_ENG_ATT_9_4                                          (0x10 << RRM_AGC19_DIG_ENG_ATT_9_Pos)   /*!<0x00000010 */
#define RRM_AGC19_DIG_ENG_ATT_9_5                                          (0x20 << RRM_AGC19_DIG_ENG_ATT_9_Pos)   /*!<0x00000020 */
#define RRM_AGC19_DIG_ENG_SPARE_Pos                                        (6UL)   /*!< RRM AGC19_DIG_ENG: SPARE (Bit 6) */
#define RRM_AGC19_DIG_ENG_SPARE_Msk                                        (0x000000c0UL)  /*!< RRM AGC19_DIG_ENG: SPARE (Bitfield-Mask: 0x3) */
#define RRM_AGC19_DIG_ENG_SPARE                                            RRM_AGC19_DIG_ENG_SPARE_Msk

/* ===============================================   AGC20_DIG_ENG   =============================================== */
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos                                  (0UL)   /*!< RRM AGC20_DIG_ENG: I_GAIN_COMP (Bit 0) */
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_Msk                                  (0x000000ffUL)  /*!< RRM AGC20_DIG_ENG: I_GAIN_COMP (Bitfield-Mask: 0xff) */
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP                                      RRM_AGC20_DIG_ENG_I_GAIN_COMP_Msk
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_0                                    (0x01 << RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos)   /*!<0x00000001 */
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_1                                    (0x02 << RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos)   /*!<0x00000002 */
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_2                                    (0x04 << RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos)   /*!<0x00000004 */
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_3                                    (0x08 << RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos)   /*!<0x00000008 */
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_4                                    (0x10 << RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos)   /*!<0x00000010 */
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_5                                    (0x20 << RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos)   /*!<0x00000020 */
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_6                                    (0x40 << RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos)   /*!<0x00000040 */
#define RRM_AGC20_DIG_ENG_I_GAIN_COMP_7                                    (0x80 << RRM_AGC20_DIG_ENG_I_GAIN_COMP_Pos)   /*!<0x00000080 */

/* =====================================================    RXADC_HW_TRIM_OUT    ===================================================== */
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Pos                     (0UL)    /*!<RRM RXADC_HW_TRIM_OUT: HW_RXADC_DELAYTRIM_I (Bit 0) */
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Msk                     (0x7UL)    /*!< RRM RXADC_HW_TRIM_OUT: HW_RXADC_DELAYTRIM_I (Bitfield-Mask: 0x07) */
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I                         RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Msk
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_0                       (0x1U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Pos)
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_1                       (0x2U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Pos)
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_2                       (0x4U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_I_Pos)
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Pos                     (3UL)    /*!<RRM RXADC_HW_TRIM_OUT: HW_RXADC_DELAYTRIM_Q (Bit 3) */
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Msk                     (0x38UL)   /*!< RRM RXADC_HW_TRIM_OUT: HW_RXADC_DELAYTRIM_Q (Bitfield-Mask: 0x07) */
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q                         RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Msk
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_0                       (0x1U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Pos)
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_1                       (0x2U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Pos)
#define RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_2                       (0x4U << RRM_RXADC_HW_TRIM_OUT_HW_RXADC_DELAYTRIM_Q_Pos)

/* =====================================================    CBIAS0_HW_TRIM_OUT    ===================================================== */
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_Pos                     (0UL)    /*!<RRM CBIAS0_HW_TRIM_OUT: HW_CBIAS_IBIAS_TRIM (Bit 0) */
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_Msk                     (0xfUL)    /*!< RRM CBIAS0_HW_TRIM_OUT: HW_CBIAS_IBIAS_TRIM (Bitfield-Mask: 0x0f) */
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM                         RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_Msk
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_0                       (0x1U << RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_1                       (0x2U << RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_2                       (0x4U << RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_3                       (0x8U << RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IBIAS_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_Pos                     (4UL)    /*!<RRM CBIAS0_HW_TRIM_OUT: HW_CBIAS_IPTAT_TRIM (Bit 4) */
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_Msk                     (0xf0UL)   /*!< RRM CBIAS0_HW_TRIM_OUT: HW_CBIAS_IPTAT_TRIM (Bitfield-Mask: 0x0f) */
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM                         RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_Msk
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_0                       (0x1U << RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_1                       (0x2U << RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_2                       (0x4U << RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_Pos)
#define RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_3                       (0x8U << RRM_CBIAS0_HW_TRIM_OUT_HW_CBIAS_IPTAT_TRIM_Pos)

/* =====================================================    CBIAS1_HW_TRIM_OUT    ===================================================== */
#define RRM_CBIAS1_HW_TRIM_OUT_HW_CBIAS_VBG_TRIM_Pos                       (0UL)    /*!<RRM CBIAS1_HW_TRIM_OUT: HW_CBIAS_VBG_TRIM (Bit 0) */
#define RRM_CBIAS1_HW_TRIM_OUT_HW_CBIAS_VBG_TRIM_Msk                       (0xfUL)    /*!< RRM CBIAS1_HW_TRIM_OUT: HW_CBIAS_VBG_TRIM (Bitfield-Mask: 0x0f) */
#define RRM_CBIAS1_HW_TRIM_OUT_HW_CBIAS_VBG_TRIM                           RRM_CBIAS1_HW_TRIM_OUT_HW_CBIAS_VBG_TRIM_Msk
#define RRM_CBIAS1_HW_TRIM_OUT_HW_CBIAS_VBG_TRIM_0                         (0x1U << RRM_CBIAS1_HW_TRIM_OUT_HW_CBIAS_VBG_TRIM_Pos)
#define RRM_CBIAS1_HW_TRIM_OUT_HW_CBIAS_VBG_TRIM_1                         (0x2U << RRM_CBIAS1_HW_TRIM_OUT_HW_CBIAS_VBG_TRIM_Pos)
#define RRM_CBIAS1_HW_TRIM_OUT_HW_CBIAS_VBG_TRIM_2                         (0x4U << RRM_CBIAS1_HW_TRIM_OUT_HW_CBIAS_VBG_TRIM_Pos)
#define RRM_CBIAS1_HW_TRIM_OUT_HW_CBIAS_VBG_TRIM_3                         (0x8U << RRM_CBIAS1_HW_TRIM_OUT_HW_CBIAS_VBG_TRIM_Pos)

/* =====================================================    AGC_HW_TRIM_OUT    ===================================================== */
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Pos                       (1UL)    /*!<RRM AGC_HW_TRIM_OUT: HW_AGC_ANTENNAE_TRIM (Bit 1) */
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Msk                       (0xeUL)    /*!< RRM AGC_HW_TRIM_OUT: HW_AGC_ANTENNAE_TRIM (Bitfield-Mask: 0x07) */
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM                           RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Msk
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_0                         (0x1U << RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Pos)
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_1                         (0x2U << RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Pos)
#define RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_2                         (0x4U << RRM_AGC_HW_TRIM_OUT_HW_AGC_ANTENNAE_TRIM_Pos)

/** @} */ /* End of group PosMask_peripherals */

/** @addtogroup Exported_macros
  * @{
  */

/*********************** UART Instances : Asynchronous mode *******************/
#define IS_UART_INSTANCE(INSTANCE) ((INSTANCE) == USART1)

